import React, {Component} from 'react';
import "./style.css"

export default class Barnakl1 extends Component{
    render(){
        return(
                <div className='h'> 
                <h1>Барнакл</h1>
                            <p>Существо колонновидной формы с ротовым отверстием на верхней части тела, всегда обращённой вниз.
                                 Тело тёмно-красного или коричневатого цвета, состоит из большого количества мышц. Рот барнакла
                                  окружен продолговатыми щупальцами с крепкими клыками, вниз из отверстия спускается длинное
                                   липкое щупальце светлого оттенка с реакцией на касания. Ротовое отверстие продолжается 
                                   недлинной пластичной глоткой со множеством хитиновых зубцов. Из-за образа жизни и охоты
                                    существо часто встречается в тёмных и влажных местах. Ведёт пассивную охоту: свисая с 
                                    потолка, вытягивает до самого низа чувствительное щупальце. Поймав добычу, барнакл тянет
                                     её к себе и сжимает своими мощными челюстями, убивая жертву парой сильных укусов, после 
                                     чего переваривает проглоченное.</p>
                </div>
                )
            }
        }