import React, {Component} from 'react';
import "./style.css"

export default class BlackHecu extends Component{
    render(){
        return(
                <div className='h'> 
                    <h1>Чёрные оперативники</h1>
                                                                                                                                                 <p>Чёрные оперативники (англ. Black Ops) — элитное подразделение отлично подготовленных 
                                                                                                                                                    бойцов-убийц, появившееся сначала в Half-Life, а затем и в Half-Life: Opposing Force.
                                                                                                                                                     Прибыли в Чёрную Мезу, чтобы ликвидировать оставшихся бойцов HECU и саму Чёрную Мезу
                                                                                                                                                      при помощи бомбы.</p>
                                                                                                                                                      <p>Чёрные оперативники впервые встречаются в Секторе Е, в главе «Мрачные предчувствия»,
                                                                                                                                                         а затем и в Секторе F в главе «Ядро Лямбды». В игре появляются только женщины-ассасины.
                                                                                                                                                          Также можно предположить, что часть снайперов, которых встречает Фримен, являются 
                                                                                                                                                          чёрными оперативниками, но из-за отсутствия у снайперов индивидуальных моделей определить
                                                                                                                                                           их принадлежность невозможно.

Женщины-ассасины очень проворные и ловкие, способны бегать быстрее всех остальных врагов и запрыгивать на высокие предметы. Снабжены ПНВ со встроенным микрофоном (хотя никогда его не используют) и одеты в специальный чёрный латекс-костюм.
 Вооружены Glock 17 с глушителем и гранатами.</p>
                </div>
                )
            }
        }