import React, {Component} from 'react';
import "./style.css"

export default class Bullskvid extends Component{
    render(){
        return(
                <div className='h'> 
                    <h1>Буллсквид</h1>
                                     <p>Буллсквид (по транслитерации, англ. Bullsquid — дословно «быкокальмар») — крайне агрессивное
                                         двуногое создание, попавшее на Землю из Зена в результате портальных штормов, вызванных 
                                         Каскадным резонансом. Буллсквиды прекрасно живут, если не процветают, в условиях, вредных 
                                         и даже опасных для человека, например, в канализациях и в отстойниках для радиоактивного,
                                          химического и биологического мусора. На Зене буллсквидов можно увидеть пасущимися в 
                                          целебных водоёмах. Они впервые представлены во второй главе Half-Life, «Аномальные материалы».</p>
                </div>
                )
            }
        }