import React, {Component} from 'react';
import "./style.css"

export default class Controler extends Component{
    render(){
        return(
                <div className='h'> 
                    <h1>Контроллер пришельцев</h1>
                <p>Контроллер (англ. Controller) — разумное существо из измерения Зен.</p>
                <p>Строение тела контроллеров схоже с таковым у Нихиланта, однако их рост 
                    значительно меньше (чуть выше человеческого). Так же, как и Нихилант, 
                    они могут стрелять в противника энергетическими шарами и раскрывать 
                    голову подобно цветку. В отличие от вортигонтов и пехотинцев, конечности 
                    контроллеров сгибаются вперёд. Всё это говорит о расовом родстве с ними.
                     Также контроллер имеет третью руку в центре грудной клетки, острые стопы,
                      кожу коричневых оттенков и три красных глаза на голове, а на нижней части
                       торса имеется нечто вроде набедренной повязки.</p>
                       <p>Во время боя контроллеры постоянно летают вокруг противника, держась на
                         расстоянии и обстреливая его энергетическими сферами из рук. Также они 
                         могут раскрыть свою голову и выпустить самонаводящийся энергетический 
                         сгусток, который несколько больше, чем обычный и исчезает только при 
                         полном приземлении.</p>
                </div>
                )
            }
        }