import React, {Component} from 'react';
import "./style.css"

export default class Gargantua extends Component{
    render(){
        return(
                <div className='h'> 
                <h1>Гаргантюа</h1>
                                          <p>Гаргантюа (англ. Gargantua) — огромный и мощный пришелец с Зена, появляющийся в серии Half-Life.</p>
                                          <p>Рост пришельца составляет примерно шесть метров в высоту; он синего цвета с одним жёлтым глазом,
                                             который становится красным, когда монстр обнаруживает вражескую цель. Вместо рук у гаргантюа
                                              массивные клешни, которые могут выбрасывать длинные струи огня (руки гаргантюа схожи с руками 
                                              пехотинца пришельцев). Помимо этого, у него есть пара рудиментарных лап ниже туловища, что
                                               роднит его с другими существами Зена, обладающими схожими чертами. Существо имеет толстую 
                                               оболочку или панцирь, делающий его полностью неуязвимым для пуль. Для того, чтобы уничтожить
                                                гаргантюа, требуется много взрывчатки, электричества или другой разрушительной энергии; 
                                                традиционными же методами победить гаргантюа невозможно или очень трудно.</p>
                </div>
                )
            }
        }