import React, {Component} from 'react';
import "./style.css"

export default class Gonarch extends Component{
    render(){
        return(
                <div className='h'> 
                    <h1>Гонарх</h1>
                                                <p>Гонарх (англ. Gonarch) — высшая стадия развития хедкраба. Предпоследний босс
                                                     оригинальной Half-Life, он оказывается на пути Фримена в Зене в главе «Логово
                                                      гонарха».</p>
                                                      <p>Гонарх выглядит как гигантское существо с гладким тёмно-коричневым панцирем,
                                                         поддерживаемым четырьмя мощными паукообразными лапами и крупным свисающим вниз
                                                          кожаным студенистым мешком в форме яйца. Мало что известно о том, как и когда
                                                           происходит метаморфоз хедкраба в гонарха из-за того, что редкому паразиту
                                                            удаётся дожить до этой стадии. Гордон Фримен прибывает в логово существа
                                                             и побеждает его вскоре после своего прибытия в Зен.</p>
                </div>
                )
            }
        }