import React, {Component} from 'react';
import "./style.css"

export default class Haunday extends Component{
    render(){
        return(
                <div className='h'> 
                    <h1>Хаундай</h1>
                                                            <p>Хаундай (по транслитерации, англ. Houndeye — дословно Гончий глаз или Гончеглаз) — трёхногое 
                                                                создание, попавшее на Землю из Зена после каскадного резонанса. Впервые появляется в третьей
                                                                 главе Half-Life «Непредвиденные последствия».</p>
                                                                 <p>Тело хаундая состоит из грудной клетки и трёх ног, его шкурка имеет слабый желто-зелёный 
                                                                    окрас с голубыми «тигриными» полосками поперёк позвоночника. На месте головы у него большой 
                                                                    чёрный фасеточный глаз и веко. Хаундаи общаются между собой с помощью высокого писка или 
                                                                    ворчания, отдалённо напоминающего собачий лай. Их поведение также основано на поведении 
                                                                    собак (отсюда и их название: с англ. hound — «гончая собака»). Как и большинство существ
                                                                     Зена, хаундаи изучаются в комплексе «Биокупол» сектора Е.</p>
                </div>
                )
            }
        }