import React, {Component} from 'react';
import "./style.css"

export default class Headcrab1 extends Component{
    render(){
        return(
                <div className='h'> 
                     <h1>Хедкраб</h1>
                                                      <p>Хедкрабы (англ. Headcrabs, дословно — «головокраб») также именуемые Барни Калхуном
                                                         мозгососами (англ. headhumpers), а Альянсом — паразитами (англ. Parasitics) — наиболее
                                                          многочисленный и, возможно, наиболее культовый всеядный вид пришельцев в серии Half-Life.</p>
                                                          <p>Хедкрабы — мешкообразные существа, чьи размеры соизмеримы с арбузом, имеющие четыре 
                                                            конечности с помощью которых могут совершать прыжки на расстояние до 3-х метров в 
                                                            любом направлении. В нижней части находится большое ротовое отверстие со скрытым 
                                                            «жалом», используемым для фиксации на жертвах. Как видно из оригинальной Half-Life,
                                                             хедкрабы размножаются посредством матки гонарха, однако немногие способны дожить до этой стадии.

Хедкрабов изучали в Чёрной Мезе, в частности, в Продвинутой биологической лаборатории и Гамма-лабораториях.</p>
                </div>
                )
            }
        }