import React, {Component} from 'react';
import "./style.css"

export default class Hecu extends Component{
    render(){
        return(
                <div className='h'> 
                  <h1>Спецподразделение HECU</h1>
                                                                                                           <p>HECU (англ. Hazardous Environment Combat Unit, дословно — Боевое подразделение для действий в особо
                                                                                                             опасных условиях окружающей среды) — специальное подразделение Морской пехоты, посланное правительством
                                                                                                              США в Чёрную Мезу.</p>
                                                                                                              <p>Бойцы HECU специально обучены для ведения борьбы в различных внутренних боевых ситуациях, в том числе и в особо опасных условиях с «необычными» противниками. Члены HECU тренируются Дуайтом Т. Барнсом и Шарпом, база укомплектована сотрудниками военной полиции.

Совместно с Чёрными оперативниками они являются «опасной и эффективной силой зачистки», направляющейся в Чёрную Мезу в случае чрезвычайной ситуации на объекте, и должны взаимодействовать с силами безопасности Чёрной Мезы.

У солдат HECU имеется свой аналог защитного костюма H.E.V. — энергетический боевой жилет (P.C.V.), выполняющий те же функции для защиты человека от опасных воздействий среды, что и H.E.V.</p>  
                </div>
                )
            }
        }