import React, {Component} from 'react';
import "./style.css"

export default class Ihtyozavr extends Component{
    render(){
        return(
                <div className='h'> 
                
                <h1>Ихтиозавр</h1>
                                                                     <p>Хотя это существо названо в честь отряда вымерших морских пресмыкающихся, ихтиозавров,
                                                                         оно похоже на них лишь плотоядностью и размерами. Вероятно, наиболее характерная
                                                                          черта этого тёмно-зелёного водного животного — это большая голова с эпокципиталом и
                                                                           пасть с просторно растущими зубами. У ихтиозавра несколько плавников; длинный, 
                                                                           похожий на хлыст хвост, используемый для перемещения, и две передние конечности,
                                                                            оканчивающиеся одиночными подобными кинжалу когтями. На концепт-арте указано, 
                                                                            что существо использует конечности, чтобы ползать по мутному дну, а затем протыкать
                                                                             и удерживать жертву. Когда ихтиозавр впервые встречается в главе «Мрачные предчувствия»
                                                                              в Half-Life, учёный отмечает, что ему сказали, будто его выловили в Бездне Челленджера
                                                                               в Тихом океане, однако он считает, что до недавнего времени это существо не плавало
                                                                                в земных водах.</p>
                </div>
                )
            }
        }