import React, {Component} from 'react';
import "./style.css"

export default class Nihilant extends Component{
    render(){
        return(
                <div className='h'> 
                <h1>Нихилант</h1>
                                                                                    <p>Нихила́нт (англ. Nihilanth) —главный антагонист Half-Life и лидер военных сил Зена, вторгнувшихся в Чёрную Мезу 
                                                                                        во время Инцидента. Он служит финальным боссом Half-Life.</p>
                                                                                        <p>Нихилант — гигантское, летающее существо, внешне похожее на человеческий плод с искривлёнными пропорциями тела,
                                                                                             огромной головой на небольшом теле. Он разделяет многие черты с другими разумными формами жизни на Зене, в
                                                                                              особенности, с контроллерами и вортигонтами, что даёт ему возможность управлять ими. Он носит такие же кандалы,
                                                                                               как и порабощённые вортигонты. На теле Нихиланта заметны следы хирургического вмешательства, его крошечные ноги
                                                                                                по-видимому представляют собой рудимент или остатки после ампутации.</p>
                </div>
                )
            }
        }