import React, {Component} from 'react';
import "./style.css"

export default class Sniperhecu extends Component{
    render(){
        return(
                <div className='h'> 
                <h1>Снайпер HECU</h1>
                                                                                                              <p>Снайпер — солдат HECU, снаряжённый снайперской винтовкой M40A1. Впервые появляется во главе «По рельсам».
                                                                                                                 Является предшественником снайпера Альянса, показанного в Half-Life 2.</p>
                                                                                                                 <p>Снайпер занимает позицию на недоступных для других существ точках и ведёт оттуда огонь из своей 
                                                                                                                    снайперской винтовки. Так как винтовка достаточно мощная, то он может убить игрока за 4-5 попаданий
                                                                                                                     (то есть снимая за выстрел 25 ед. Здоровья).</p>
                </div>
                )
            }
        }