import React, {Component} from 'react';
import "./style.css"

export default class Tentakl extends Component{
    render(){
        return(
                <div className='h'> 
                <h1>Тентакл</h1>
                                                                                                <p>Тентакл (англ. Tentacle, что можно перевести, как Щупальце) — существо из мира Зен. Огромные существа,
                                                                                                     похожие на щупальца, выросшие из-под земли.</p>
                                                                                                     <p>Тентаклы имеют необычную внешность. Длинный, зелёный, сегментированный стебель увенчан головой,
                                                                                                         заканчивающейся отростком, похожим на нос и глазом. Существо слепо и реагирует только на вибрации
                                                                                                          и звуки. Тентаклы обычно появляются из каких-либо углублений, ям, в которые они могут втягиваться
                                                                                                           при угрозе извне. Часто они издают громкие крики, похожие на зов китов.</p>
                </div>
                )
            }
        }