import React, {Component} from 'react';
import "./style.css"

export default class Troopervort extends Component{
    render(){
        return(
                <div className='h'> 
                    <h1>Пехотинец пришельцев</h1>
                       <p>Пехотинец пришельцев (англ. Alien Grunt) — существо из Зена, основная боевая единица военных сил Нихиланта.</p>
                       <p>Крепкие, сильные и чрезвычайно агрессивные, пехотинцы больше двух метров в высоту и вооружены биологическим оружием
                         под названием рукоулей, которое стреляет живыми снарядами: самостоятельными, похожими на насекомых существами,
                          называемыми «шершнями», которые способны находить противника за препятствиями. Если противник вблизи, они прибегают
                           к рукопашному бою. Пехотинцы разделяют многие физические характеристики с вортигонтами: множество красных глаз,
                            вытянутые назад колени, копыта и короткую третью руку, растущую из центра груди и используемую для питания.</p>
                </div>
                )
            }
        }