import React, {Component} from 'react';
import "./style.css"

export default class Vort1 extends Component{
    render(){
        return(
                <div className='h'> 
                <h1>Вортигонт</h1>
                            <p>Вортигонт (также известный как Раб пришельцев или Раб Зена) — разумный вид пришельцев, встречающийся во всех играх серии Half-Life.
Задолго до событий Half-Life родной мир вортигонтов был захвачен Альянсом. Те из них, кому удалось, бежали в Зен вместе
 с другими видами. После инцидента в Чёрной Мезе их хозяин Нихилант рассмотрел открывшиеся порталы как возможность спастись,
  перебравшись на Землю. Для этой цели он послал вортигонтов для вторжения на планету. После смерти хозяина вортигонты, как
   вид, решили объединиться с человечеством под руководством Сопротивления в стремлении свергнуть правление Альянса.</p>
                </div>
                )
            }
        }