import React, {Component} from 'react';

export default class History extends Component{
    render(){
        return(
            <div>
            <h1>Сюжет</h1>
            <p>Действие игры происходит примерно через 20 лет после событий первой части (по подсчётам фанатов). G-Man пробуждает Гордона Фримена из стазиса и перемещает в поезд, идущий в Сити 17, город в Восточной Европе. Сразу же становится понятно, что Земля захвачена инопланетной цивилизацией, именуемой Альянсом, а управляет человечеством некий Уоллес Брин — как позже выяснится, бывший администратор исследовательского центра «Чёрная Меза». На вокзале Барни, в прошлом охранник «Чёрной Мезы» и друг Гордона, спасает его от участи быть пойманным Гражданской Обороной. Он направляет его в лабораторию доктора Кляйнера.

ГО устраивает облаву на Гордона и в конце концов оглушает его, но учёного выручает девушка по имени Аликс — дочь коллеги Фримена по «Чёрной Мезе» Илая Вэнса — и отводит в лабораторию, где Гордону выдают обновлённый костюм H.E.V. Далее Аликс телепортируют в Восточную Чёрную Мезу — подпольную базу Сопротивления. Гордона также собираются телепортировать на базу, но всё срывает Ламарр, ручной хедкраб Кляйнера. Гордон переносится на задний двор, Барни кидает ему монтировку, и герой начинает своё путешествие через каналы.

В результате Фримен, прорываясь сквозь атаки отрядов ГО и техники Альянса, всё же достигает Восточной Чёрной Мезы, где встречается с Аликс, её отцом Илаем и доктором Джудит Моссман. Гордону дают новое оружие — гравитационную пушку — и знакомят с Псом, ручным роботом Аликс. Неожиданно идиллию обрывает нападение сил Альянса. Гордон выбирается из лаборатории и попадает в Рейвенхольм, шахтёрский городок, переполненный зомби. В нём есть лишь единственный выживший — сумасшедший священник Григорий. Он помогает Гордону выбраться из города, а сам остаётся.

Выбравшись из Рейвенхольма, Гордон попадает на базу Сопротивления; выясняется, что Илая захватили в плен и держат в тюрьме Нова Проспект. Отряд сопротивления выдаёт ему машину, при помощи которой Гордон добирается до маяка. Затем он доходит до ещё одного лагеря Сопротивления, где побеждает мирмидонта и получает фероподы, при помощи которых можно контролировать солдат муравьиных львов. Гордон, не без помощи муравьиных львов, штурмует Нова Проспект и находит Аликс.

Выясняется, что Моссман — предательница. Аликс и Гордон находят Илая, но Моссман обманывает их и телепортируется с Илаем. Гордон и Аликс отправляются вслед за ними, но как только они успевают запустить телепорт и начать переброску, ворвавшиеся в зал солдаты Альянса уничтожают его. В результате, герои попадают в лабораторию Кляйнера через неделю после телепортации, но для них это время показалась одной секундой.

За прошедшую неделю в Сити 17 началось восстание. В ходе боёв Аликс попадает в плен. Гордон находит Барни, и они вместе штурмуют Нексус Патруля и отключают инопланетную установку на крыше. Они пробиваются к Цитадели, где с помощью Пса Гордон попадает внутрь.

Гордон попадает в поле конфискации, где уничтожается всё его оружие, кроме грави-пушки, которая заряжается энергией поля и выводит его из строя. Заряженная грави-пушка излучает синее свечение и взаимодействует с живыми объектами. В ходе путешествия по Цитадели Гордон попадает в плен. Уоллес Брин собирается телепортировать Илая и Аликс в мир Альянса, но вдруг вмешивается Моссман, которая освобождает всех. Брин бежит и собирается телепортироваться в измерение Альянса, но Гордон уничтожает телепорт. Происходит взрыв, время останавливается, и появляется G-Man. Он поздравляет Гордона с выполненной работой и снова отправляет в стазис.</p>
            </div>
            )
            }
            }