import React, {Component} from 'react';

export default class Historytwo extends Component{
    render(){
        return(
            <div>
                    <h1>Сюжет Half life 2 episode two</h1>
                    <p>Сюжет Half-Life 2: Episode Two начинается там, где заканчивается Episode One. После взрыва Цитадели поезд, на котором уезжали Гордон Фримен и Аликс Вэнс, попадает под взрывную волну и терпит крушение. Им приходится добираться до главной базы Сопротивления — комплекса «Белая Роща» — своими силами. Главная цель — доставить в Белую Рощу данные, добытые в Цитадели, где содержатся секретные планы руководства Альянса, а также код частоты сверхпортала, образовавшегося над разрушенным Сити 17. Этот портал должен вновь прочно связать Землю и вселенную Альянса, что грозит человечеству приходом подкрепления инопланетных захватчиков и повторением Семичасовой войны («Если он наберёт полную силу то повторится Семичасовая война. Только на этот раз нам не продержаться и семи минут…» — Илай Вэнс). Однако, используя код частоты волны портала, у повстанцев есть возможность закрыть его при помощи ракеты со спутником, на котором установлен «зен-резонатор», запустив его из Белой Рощи. Но все усугубляется тем, что разведка Альянса обнаружила базу и туда уже направляется ударная армия. Фримен и Аликс вынуждены поторопиться, чтобы успеть доставить данные и предупредить повстанцев о надвигающейся угрозе.</p>
            </div>
            )
        }
    }