import React, {Component} from 'react';
import "./table.css";

export default class Lore2 extends Component{
    render(){
        return(
            <div>
                <img  src="https://www.hl-inside.ru/hl2/walkthrough/images/sol374.jpg" className='img'></img>
                <h1>Глава 1: Точка внедрения</h1>
                <p>Half-Life 2 начинается с непродолжительного монолога G-Manа, который пробуждает Гордона
                     из стазиса, говоря ему что его час вновь пробил, и помещает его на поезд до Сити 17, 
                     города, расположенного где-то в Восточной Европе, где находится центральная база Альянса
                      - Цитадель. События игры разворачиваются примерно через двадцать лет после событий в 
                      Чёрной Мезе. Официальные источники разнятся в оценке длины этого промежутка. Фрагмент
                       истории, написанный Марком Лэйдлоу для команды разработчиков, ставит перерыв в десять
                        лет, в то время как на сайте Half-Life 2: Episode One установлен перерыв в почти два
                         десятилетия с окончания событий Half-Life. В то время как сайт является более ранним 
                         источником, цифра в двадцать лет кажется более точной, так как фотография семьи Вэнсов 
                         из Чёрной Мезы в лаборатории Илая показывает Аликс как маленького ребёнка не старше 
                         пяти лет. Незадолго после помещения Фримена в стазис произошло событие, известное как
                          Семичасовая война. Итогом этой войны стала полная капитуляция всех стран Земли перед
                           новым покровителем - Альянсом.


Доктор Гордон Фримен, не постаревший ни на день после инцидента в Чёрной Мезе благодаря стазису, оказывается в 
поезде, чей путь лежит в Сити-17. Достигнув Вокзала Сити-17, Гордон начинает свой путь. Первое, что слышат все 
горожане по прибытию в город - вещание Уоллеса Брина, который являлся администратором Черной Мезы, через Бринкасты
. Уоллес стал администратором Земли после подписания мирного договора с Альянсом. В своих выступлениях Брин рассказывает
 о перспективах развития человечества, отвечает на вопросы граждан и призывает их к лояльности Альянсу. За порядком в
  городе следят сотрудники Гражданской Обороны, которые, впрочем, нередко поднимают руки на горожан. Пройдя дальше по
   терминалу, Гордон попадает к развилке. Часть граждан пропускают в город, другие же отправляются на допрос, в их 
   числе оказывается и сам Фримен. Один из сотрудников ГО провожает Гордона до комнаты допроса, из которой, после
    захода Фримена, выходит другой ГОшник. После того как дверь закрылась, сотрудник подходит к терминалу, отключает
     камеры и снимает маску. Сотрудником оказывается Барни Калхун, с которым Фримен был знаком ещё со времён работы 
     в Черной Мезе, где тот работал охранником. Барни выходит на прямую связь с ещё одним старым знакомым Гордона
      -Айзеком Кляйнером. Тот очень удивлен появлением Фримена. После непродолжительного разговора принимается решение 
      отправить Гордона в лабораторию Кляйнера, по пути он, в теории, должен встретить Аликс Вэнс, дочь Илая Вэнса,
       ещё одного коллеги Фримена из Черной Мезы, которая должна проводить его до лаборатории. В это время в дверь
        комнаты раздается стук, Барни провожает Гордона в небольшое складское помещение, из которого Гордон, выбравшись
         через окно, попадает на площадь. По пути на выход из вокзала путь ученого блокируется сотрудником ГО, который
          проводит тест на лояльность. Он состоит в том, что гражданин должен поднять банку и выкинуть ее в мусорку, 
          следуя инструкциям ГОшника. Игроку даётся выбор - подчиниться или ослушаться приказа. В любом случае далее 
          Гордон выходит на площадь, где ему открывается вид на величественную Цитадель. Далее Фримен идёт вдоль одной
           из улиц, где впервые видит БТР Альянса, по лестнице перелезает на другую сторону улицы, проходит вдоль домов 
           и заходит в один из них. Там он становится свидетелем облавы одной из квартир сотрудниками ГО. Пройдя через
            жилые помещения он поднимается на этаж выше, как вдруг городские системы обнаруживают отклонение численности,
             из-за чего за силы ГО начинают погоню за Фрименом . Граждане помогают Фримену бежать через крышу дома. Пройдя
              по крышам нескольких домов, Гордон забирается в открытое окно одного из домов, спускается по ломающейся под
               ногами лестнице в небольшой коридор, где его застаёт врасплох отряд ГО. После нескольких ударов дубинкой,
                Гордон теряет сознание. Тем временем вовремя подоспевшая Аликс Вэнс успешно разбирается с полицейскими и 
                приводит Фримена в чувства, они вместе заходят в лифт. Девушка подмечает, что доктор Кляйнер не учел что
                 у Фримена "нет карты" чтобы добраться до лаборатории, а также представляется. Помимо этого она шутливо
                  указывает на отсутствие речи главного героя, говоря что он "не разговорчивый". Выйдя из лифта, Аликс 
                  обращает внимание Гордона на плакат с доктором Брином, говоря о его посту администратора в Черной Мезе
                   и о том что "не следует упоминать его имени при отце". Мисс Вэнс вводит код на панели у стены,
                    благодаря чему открывается тайный проход к лаборатории Айзека Кляйнера.</p>
                    <img src="https://www.hl-inside.ru/gallery/shots/images/hl2_shots_282.jpg" className='img'></img>
                    <h1>Глава 2: "Великий день"</h1>
                    <p>В лаборатории Гордон надевает новый, усовершенствованный энергокостюм пятой модели. 
                        Кляйнер решает, что Гордона лучше отправить в Восточную Чёрную Мезу, базу повстанцев 
                        за городом, на территории старой ГЭС, с помощью сконструированного им телепорта.
                         Но из-за повреждения телепорта ручным питомцем Кляйнера — хедкрабом по 
                          Ламарр, процесс телепортации проходит неудачно. (в частности Гордон телепортируется
                           на несколько секунд в неизвестный водоем, в пустыню, и дважды в кабинет Уоллеса 
                           Брина, который в первый раз удивляется, а во второй раз, общаясь с Советником
                            вспоминает Гордона), и Фримену приходится выбираться из города пешком.</p>
                            <img src="https://itc.ua/wp-content/uploads/2015/03/ss_62c484ade710adabd62d65ba6e5f092cac3a4e88.1920x1080-671x377.jpg" className='img'></img>
                            <h1>Глава 3: Через каналы</h1>
                            <p>Пробираясь через городские каналы пешком и на воздушном катере, преследуемый
                                 солдатами Гражданской Обороны, Гордон находит базы Сопротивления, населённые
                                  беженцами, повстанцами и вортигонтами, ставшими после Семичасовой войны 
                                  союзниками Сопротивления. Выбравшись на окраину города Фримен находит лагерь
                                   повстанцев, где ему дают аэроглиссер, что позволяет пересечь радиоактивные каналы.</p>
                                   <img src="https://www.hl-inside.ru/hl2/walkthrough/images/sol271.jpg" className='img'></img>
                                   <h1>Глава 4: Водная преграда </h1>
                                   <p>В другом переводе название главы - Радиоактивные воды. Аэроглиссер Гордона замечают 
                                    патрули ГО и посылают в погоню боевой вертолёт. Когда Фримен прибывает на промежуточную
                                     базу Сопротивления, вортигонт-механик вмонтирует на катер Гордона импульсный пулемёт,
                                      благодаря которому Фримен избавляется от вертолёта, теряется из вида спецслужб Альянса 
                                      и благополучно добирается до базы.</p>
                                      <img src="https://www.hl-inside.ru/hl2/walkthrough/images/sol413.jpg" className='img'></img>
                                      <h1>Глава 5: Восточная Чёрная Меза</h1>
                                      <p>В начале главы Фримен наконец достигает своей цели. При входе на базу Гордона встречает
                                         Джудит Моссман и отводит его к бывшему учёному Чёрной Мезы и лидеру Сопротивления Илаю
                                          Вэнсу и Аликс. Здесь Аликс знакомит Гордона с новым изобретением Илая - грави-пушкой,
                                           а также "домашним питомцем" Аликс Псом. Так же, как и в главе "Красный день календаря",
                                            повествование сосредотачивается на понимании того, что стало с миром после инцидента
                                             в Чёрной Мезе. В то время, как Гордон играет с Псом на свалке, Аликс замечает в небе
                                             сканнеры, после чего Альянс нападает на Восточную Чёрную Мезу. При попытке присоединиться
                                              к другим Гордон и Пёс оказываются отделены от Аликс, в результате чего Гордон вынужден
                                               направится в рейвенхолмский тоннель, место, о котором ранее Аликс не хотела говорить.</p>
                                               <img src="https://www.hl-inside.ru/hl2/walkthrough/images/sol062.jpg" className='img'></img>
                                               <h1>Глава 6: "Мы не ходим в Рейвенхольм..."</h1>
                                               <p>В этой главе Гордон пробирается через город-призрак Рейвенхольм, в котором благодаря
                                                 стараниям Альянса все жители превратились в зомби. Первоначально это был скрытый 
                                                 шахтёрский городок, свободный от Альянса, но позже город был им обнаружен и обстрелян
                                                  сотнями краб-снарядов. В этой главе также появляются два новых вида хедкрабов - быстрый 
                                                  и ядовитый, и соответствующие им зомби. Убивая зомби и избегая ловушек, Фримен встречает
                                                   единственного выжившего в городе человека - отца Григория, который даёт Фримену дробовик.
                                                    Фримен и Григорий отправляются в заброшенную шахту, которая может снова вывести в Сити 17,
                                                     но по пути Григорий остаётся, чтобы задержать зомби. Глава заканчивается тем, что Фримен
                                                      выходит на поверхность и встречает повстанцев.</p>
                                                      <img src="https://www.hl-inside.ru/hl2/walkthrough/images/sol097.jpg" className='img'></img>
                                                      <h1>Глава 7: Шоссе 17</h1>
                                                      <p>Когда Фримен достигает базы повстанцев, с ним связывается Аликс и сообщает, что Илая
                                                         схватили и отвезли в Нова Проспект, бывшую тюрьму. Фримен вынужден отправиться по 
                                                         Шоссе 17, чтобы по Побережью добраться до Нова Проcпект. Здесь игрок впервые встречается
                                                          с новым видом пришельцев - муравьиными львами. В этой главе Гордон также попадает в
                                                           Новую Малую Одессу, встречает Одессу Каббеджа, который даёт ему РПГ, при помощи которого
                                                            Гордон сбивает Штурмовик Альянса.</p>
                                                            <img src="https://www.hl-inside.ru/hl2/walkthrough/images/sol127.jpg" className='img'></img>
                                                            <h1>Глава 8: Песчаные ловушки</h1>
                                                            <p>Эта глава подробно освещает вторую половину путешествия Гордона Фримена в Нова 
                                                                Проспект. После выхода из тоннеля, заражённого зомби, он без багги пробирается
                                                                 по последней части побережья, пока не сталкивается со стражем муравьиных львов.
                                                                  После победы над врагом Фримен обучается у вортигонта владению фероподами, а
                                                                   затем выходит на заключительную часть побережья, где ему приходится сражаться
                                                                    с множеством охранников Нова Проспект. На этом уровне муравьиные львы становятся
                                                                     союзниками Фримена.</p>
                                                                     <img src="https://www.hl-inside.ru/hl2/walkthrough/images/sol137.jpg" className='img'></img>
                                                                     <h1>Глава 9: Нова Проспект</h1>
                                                                     <p>В этой главе Фримен атакует Нова Проспект, базу Альянса и бывшую тюрьму,
                                                                         и прорывает её оборону при помощи муравьиных львов с целью найти лидера 
                                                                         Сопротивления Илая Вэнса. Это последняя глава, в которой игрок встречает
                                                                          муравьиных львов.</p>
                                                                          <img src="https://www.hl-inside.ru/hl2/walkthrough/images/sol152.jpg" className='img'></img>
                                                                          <h1>Глава 9а: Запутанность </h1>
                                                                          <p>В этой главе Гордон встречается с Аликс в железнодорожном депо Нова Проспект. 
                                                                            Они обнаруживают, что на самом деле Моссман является шпионом Альянса и работает
                                                                             на Брина. Вместе они ищут в тюрьме Моссман и Илая, всё время сражаясь с силами
                                                                              безопасности тюрьмы. Несколько раз они разделяются, но в конце концов снова 
                                                                              встречаются, чтобы отследить Моссман. Однако Моссман удаётся телепортировать 
                                                                              себя вместе с Илаем из объекта в Цитадель, и Гордону с Аликс ничего не остаётся, 
                                                                              как дождавшись зарядки телепорта, одним вернуться в лабораторию Кляйнера.</p>
                                                                              <img src="https://www.hl-inside.ru/hl2/walkthrough/images/sol173.jpg" className='img'></img>
                                                                              <h1>Глава 10: Нарушитель номер один</h1>
                                                                              <p>По прибытии в лабораторию Кляйнера, Гордон и Аликс обнаруживают, что при 
                                                                                телепортации застряли в петле времени на целую неделю. Они узнают, что взрыв
                                                                                 телепорта разрушил Нова Проспект и послужил сигналом к началу Восстания. В
                                                                                  результате, Сити 17 стал местом сплошных боёв. Фримен отправляется в гущу
                                                                                   сражения, чтобы помочь повстанцам, в то время как Аликс остаётся в лаборатории,
                                                                                    чтобы помочь Кляйнеру выбраться из города. Игрок имеет возможность формировать
                                                                                     небольшие отряды, чтобы помочь гражданам добраться до местоположения Барни.
                                                                                      В конце главы Аликс возвращается, чтобы помочь Гордону, но её захватывают 
                                                                                      солдаты Альянса и доставляют в Цитадель.</p>
                                                                                      <img src="https://i.ytimg.com/vi/YvghXJfYYbw/maxresdefault.jpg" className='img'></img>
                                                                                      <h1>Глава 11: «За Фрименом!»</h1>
                                                                                      <p>Гордон Фримен объединяется с Барни, и вместе они ведут бой с целью проникновения
                                                                                         в Нексус Патруля, что в конце концов приводит Гордона к подножию Цитадели.
                                                                                          Эта глава полностью посвящена тяжёлым уличным боям совместно с бойцами 
                                                                                          Сопротивления против солдат Патруля, штурмовиков и страйдеров.</p>
                                                                                          <img src="https://www.hl-inside.ru/hl2/walkthrough/images/sol240.jpg" className='img'></img>
                                                                                          <h1>Глава 12: Наши Покровители</h1>
                                                                                          <p>В этой главе игрок может подробно рассмотреть устройство Цитадели изнутри. 
                                                                                            Также в этой главе Гордону даётся заряженная грави-пушка, с помощью которой
                                                                                             Гордон борется с солдатами Патруля.</p>
                                                                                             <img src="https://i.ytimg.com/vi/lTzwOsxPOkw/maxresdefault.jpg" className='img'></img>
                                                                                             <h1>Глава 13: Тёмная энергия</h1>
                                                                                             <p>В этой финальной главе показана кульминация противостояния Брина и Фримена. 
                                                                                                Моссман в конечном счёте сожалеет, что перешла на сторону Брина, и помогает
                                                                                                 Гордону, Аликс и Илаю освободиться из его плена. Брин пытается бежать из 
                                                                                                 Сити 17 и направляется к реактору на тёмном сплаве, где его уже ждёт телепорт
                                                                                                  в родной мир Альянса. Но Фримену удаётся вывести из строя реактор, а капсула
                                                                                                   с Брином падает с большой высоты. В тот момент, когда реактор только 
                                                                                                   взрывается, готовясь убить Гордона и Аликс, время останавливается, и 
                                                                                                   появляется G-Man и собирается поместить Гордона снова в стазис. На конец
                                                                                                    игры судьба Барни, Аликс и Брина остаётся неизвестной.</p>
        </div>

        )
    }
}