import React, {Component} from 'react';
import "./table.css";

export default class Loretwo extends Component{
    render(){
        return(
            <div >
                <img src="https://www.hl-inside.ru/hl2/walkthrough/images/ep2_outland_010058.jpg" className='img' ></img>
                <h1>Глава 1: В Белую Рощу</h1>
                <p>Глава начинается на том месте, на котором закончилась предыдущая часть. Ядро Цитадели взорвалось, накрыв взрывной волной поезд, в котором спасались из Сити 17 Гордон и Аликс. Гордон оказался в покорёженном поезде, и Аликс использует гравитационную пушку, чтобы освободить его. Пройдя чуть от места аварии, они видят руины Сити 17 и зарождение сверхпортала. Произошедшая портальная буря окончательно уничтожает мост, одновременно освобождая проход в шахты.

Аликс говорит, что они должны добраться до базы в Белой Роще и доставить данные, добытые в Цитадели. Пройдя через кишащий зомби туннель, они добираются до станции связи и связываются с Белой рощей. На связь выходят доктор Кляйнер и Илай Вэнс и с облегчением узнают, что Гордон и Аликс пережили взрыв Цитадели, но их прерывает доктор Магнуссон, глава базы "Белая Роща", невзирая ни на что требующий срочно доставить данные в Белую Рощу. Звук Охотников и патруля Альянса подтверждает, что Комбайны по-прежнему ищут похищенные данные.

Вскоре после этого Охотник тяжело ранит Аликс. Вовремя прибывший вортигонт не даёт ей погибнуть и призывает соплеменников, чтобы помочь ей. Гордон сопровождает вортигонта в безопасное место, но из-за сломанного лифта их пути расходятся, и Гордону приходится пробираться по пещерам логова муравьиных львов, чтобы добраться до базы повстанцев.</p>

<img src="https://www.hl-inside.ru/hl2/walkthrough/images/ep2_outland_030098.jpg" className='img' ></img>
                <h1>Глава 2: Кольцо Ворта</h1>
                <p>Гордон прибывает на небольшую базу Сопротивления, где вортигонт уже старается помочь Аликс. Но Гордон, пробираясь через пещеры, потревожил муравьиных львов, поэтому он вынужден теперь сдерживать их яростные атаки, защищая Аликс и вортигонта. Ситуация осложняется наличием всего двух едва исправных пулемётов, которые выходят из строя через некоторое время. В критический момент на базу прибывает группа вортигонтов и помогает отбить самую сильную атаку. Закончив со львами, они приступают к лечению Аликс, но для этого требуется личиночный экстракт муравьиных львов, поэтому Гордону приходится сопровождать вортигонта в логово львов.

Пробираясь по шахтам они обнаруживают толпы зомби и зомбайнов. Пробираясь вглубь пещер, они сталкиваются со стражем, что говорит о том, что они уже близки к экстракту. Однако стража убивать нельзя, так как иначе экстракт потеряет свою силу, поэтому Гордон вынужден пробираться по пещерам, уклоняясь от стража. Наконец он отрывается от зверя и помогает спустить к себе вортигонта. Вместе они добывают экстракт и спешат к Аликс.

Доставив экстракт вовремя, вортигонты при помощи Гордона исцеляют Аликс. Во время лечения время останавливается, и появляется G-Man. Он сообщает Гордону, что тот должен добраться до "Белой Рощи" и намекает на значимость Аликс для своих планов, а после этого он внушает ей передать отцу послание, заключающееся в том, чтобы он "подготовился к непредвиденным последствиям". G-Man исчезает, и вортигонты завершают исцеление. Придя немного в себя Гордон и Аликс в сопровождении вортигонта поднимаются на поверхность.</p>

<img src="https://images.stopgame.ru/news/2017/08/25/3HGn6Wv1K.jpg" className='img' ></img>
                <h1>Глава 3: Мостостроитель Фримен</h1>

                <p>Выйдя на поверхность, группа видит армию Альянса с Советниками в инкубационных капсулах, двигающуюся на север. Вортигонт говорит, что они объединяют разрозненные отряды. Аликc понимает, что они двигаются к Белой Роще. Ворт сообщает, что неподалёку есть люди, располагающие средствами перемещения. Чтобы добратся до них группе приходится пробиваться через муравьиных львов, а Гордону приходится убить двух стражей. Поднявшись к лагерю, герои обнаруживают, что все, кто там находился, уничтожены. Вместе с тем рядом с трупами повстанцев лежат и трупы Комбайнов, что говорит о том, что они были атакованы зомби. С помощью компьютера Аликc обнаруживает на мосту неподалёку брошенную машину. Для того, чтобы использовать её, Гордону приходится спуститься вниз и, прорываясь с боями мимо зомби на другую сторону, подняться на мост. Расчистив дорогу, он садится в машину и возвращается к Аликс и ворту. Аликс тепло прощается с вортигонтом, тот открывает ворота, и Гордон с Аликс уезжают.</p>
          
                
                <img src="https://www.hl-inside.ru/gallery/episode2/images/hl2.ru_episode2_030.jpg" className='img' ></img>
                <h1>Глава 4: Вооружён и на дороге</h1>
                <p>Получив автомобиль, Гордон и Аликс на полной скорости едут в Белую Рощу. Первый же тоннель оказывается завален, и им приходится искать объездной путь. Обнаружив по пути радиовышку, Аликс решает связаться с учёными в Белой Роще и сообщить о двигающейся на них армии Комбайна. Однако передатчик обесточен, и Гордону приходится найти способ подать на него электричество. Спустившись в подвал одного из сараев, он подключает нужные провода и уже поднимается наверх, как в этот момент замечает Охотника. Аликс и Гордон вынуждены вступить с ним в бой, и тут поспевают ещё два синтента. Разобравшись с ними и выйдя из помещения, они наталкиваются на ещё двух Охотников. Когда все они были уничтожены, Аликс идёт к передатчику и выходит на связь с Белой Рощей, но плохая связь мешает ей сообщить об угрозе. Связь окончательно прерывается, Аликс открывает ворота, и они с Гордоном едут дальше.

На следующей остановке они обнаруживают ещё один сарай. Стоило только им войти внутрь, как начинает происходить что-то непонятное. Войдя в помещение, они обнаруживают инкубационную капсулу с Советником. Гордон выстреливает из грави-пушки в систему жизнеобеспечения Советника и разрушает её. Советник выбирается из кокона и прижимает Гордона и Аликс к стене. Один из разрядов разрушенной системы ранит Советника, и тот в ярости притягивает к себе Гордона, намереваясь разобраться с ним. Но в этот момент ещё один электрический взрыв сильно ранит Советника, и тот вынужден спасаться, попутно позвав помощь. Сразу же появляются солдаты Альянса, и Аликс с Гордоном вынуждены бежать. Выехав на железную дорогу они мчатся по путям с вертолётом на хвосте. По пути они встречают базу Сопротивления, и в этот момент двигатель автомобиля окончательно ломается. Бросив машину, Гордон грави-пушкой забрасывает вертолёт его собственными минами, чем помогает повстанцам избавиться от него. Те, в свою очередь, в благодарность помогают починить машину.</p>
           <img src="https://www.hl-inside.ru/gallery/episode2/images/hl2.ru_episode2_302.jpg" className='img' ></img>
            <h1>Глава 5: На радаре</h1>
            <p>Выясняется, что уехать с базы мешают автоматические пулемёты. Гордону приходится обойти их с тыла и взорвать пункт управления. В то время, пока он разбирался с пулемётами, повстанцы помогли починить машину и сделали подарок в виде бортового радара. Аликс и Гордон отправляются в путь, находя по дороге тайники с оружием.

По дороге они обнаруживают, что один из тоннелей перегорожен Альянсом, поэтому они вынуждены были искать объездной путь. Оказавшись в небольшом селении, они попадают в засаду Комбайнов, и им приходится сдерживать натиск врага. Разобравшись с противником, использовавшем Охотников, Гордон и Аликс ищут способ открыть заграждение, но снова их поджидает враг. Наконец Гордон отключает питание заграждений, и они с Аликс прибывают в Белую Рощу. Тут они наталкиваются на Страйдера, и Пёс спасает их. Когда дорога была расчищена, Аликс предлагает Гордону добраться до базы наперегонки с Псом.</p>
           
           <img src="https://thelastgame.org/uploads/posts/2022-02/half-life-2-episode-two-4.jpg" className='img' ></img>
           <h1>Глава 6: Наш общий недруг</h1>
           <p>Приехав в Белую Рощу, Аликс и Гордон наконец встречаются с Илаем и доктором Кляйнером. Аликс передаёт им украденные из Цитадели данные. Также они знакомятся с Арне Магнуссоном, ещё одним бывшим учёным Чёрной Мезы, эгоистичным, многословным и авторитарным и, кроме того, держащим обиду на Гордона.

Аликс и Гордон узнают, что команда Белой Рощи готовит к запуску спутник, который должен будет действовать со спутником, запущенным в Half-Life, и закрыть портал.

Комбайны внезапно атакуют базу, и Гордону практически в одиночку приходится отражать атаки врага и изолировать ракетную шахту.

После успешного отражения атаки Гордон встречает Аликс, и они оба возвращаются к Илаю и Кляйнеру, просматривающим сообщение Джудит Моссман. Здесь выясняется, что "проект" является ни чем иным, как "Бореем", пропавшим судном Aperture Science с невероятно сильным оружием на борту. Доктор Кляйнер предлагает использовать технологии Борея против Альянса, однако Илай против, говоря, что такую мощь невозможно контролировать и что это может привести к "новой Чёрной Мезе". Илай собирается лететь за Джудит, но Кляйнер и Аликс останавливают его, разумно замечая, что возможность пленения лидера Сопротивления недопустима. Доктор Кляйнер уходит расшифровать послание Джудит. На мониторах комьютера на миг появляется G-Man, и Аликс передаёт его послание отцу. Потрясённый Илай без сил садится в кресло. Аликс уходит сделать ему чай, и Илай, оставшись наедине с Гордоном, говорит ему, что уже однажды G-Man говорил ему это перед инцидентом в Чёрной Мезе, но тогда он его не послушал.

Однако Гордону снова не приходится скучать - силы Альянса на подходе. Доктор Магнуссон обучает Гордона обращению с со своим изобретением - Устройством Магнуссона - и поручает ему защитить свою ракету. Гордон на машине отправляется в Белую Рощу и принимает бой со значительным количеством Страйдеров и Охотников. С огромным трудом победа была одержана и Гордон спешит обратно на базу, где уже почти готовы к запуску ракеты.

</p>
<img src="https://mobimg.b-cdn.net/v2/fetch/aa/aa21ccc891f4bb3a02df83353248a9b0.jpeg" className='img' ></img>
                <h1>Глава 7: T-Минус Один</h1>
                <p>Когда Гордон вернулся на базу, Магнуссон поблагодарил его за спасение своей ракеты. Гордону поручается её запуск, что он с успехом и выполняет. После этого Илай, Гордон и Аликс выходят на улицу наблюдать за ракетой. Оставшись на минуту одни, Илай говорит Гордону, что G-Man имел ввиду именно "Борей", и что он должен быть уничтожен чего бы это не стоило. Илай признаётся, что гордится Гордоном "как гордился собственным сыном". В этот момент Аликс их торопит, они выходят на улицу и наблюдают, как закрывается сверхпортал. Сразу после этого все трое направляются в ангар к вертолёту.

И тут появляются два советника, которые обездвиживают Гордона и Аликс, и хватают Илая. Один из них убивает его, проткнув его голову своим щупальцем. В этот момент появляется Пёс и серьёзно ранит (и, возможно, убивает) одного советника, а другого вынуждает обратиться в бегство. Освободившаяся Аликс добирается до отца и плачет над его безжизненным телом. Это последнее, что мы видим и слышим, когда экран чернеет.</p>
            </div>
            )
        }
    }