import React, {Component} from 'react';
import "./table.css";

export default class Loreone extends Component{
    render(){
        return(
            <div >
                <img src="https://www.hl-inside.ru/hl2/walkthrough/images/ep1_sol002.jpg" className='img'></img>
                    <h1>Глава 1: Чрезвычайная тревога</h1>
                    <p>Глава начинается с показа стоп-кадра Гордона и Аликс во время взрыва телепорта Уоллеса Брина на вершине Цитадели, во время которого появляются пурпурные вортигонты, спасающие Аликс. Затем появляется G-Man, пытающийся сказать что-то Гордону, однако его прерывают вортигонты, вытаскивающие Фримена из-под его контроля.

Гордон Фримен приходит в сознание под обломками близ Цитадели. Пёс находит и вытаскивает Гордона, давая гравитационную пушку и воссоединяя с Аликс. Она связывается с Илаем Вэнсом и Айзеком Кляйнером, сообщая о том, что она с Псом и Гордоном всё ещё у подножья Цитадели. Кляйнер говорит, что радиоактивное ядро Цитадели вот-вот готово взорваться, уничтожив город, и единственный шанс выбраться — стабилизировать его.</p>
           <p>Пёс находит машину для переправки в Цитадель, куда садится пара, а после отправляет её на один из этажей. Под весом машины пол проваливается, отправляя машину на нижние этажи. Проходя по ним, пара встречает сталкеров, не дающих пройти дальше. Гордон убивает их с помощью шаровых мин, взломанных мультиинструментом Аликс, тем самым освобождая проход. Позже пара входит в комнату, в которой советник общался с Уоллесом Брином о его телепортации в мир Альянса. Прослушав запись, Аликс замечает капсулу неизвестного советника, которая подготавливается для эвакуации в безопасное место. Аликс и Гордон начинают осматривать капсулу и в этот момент cоветник применяет мощную телепатическую атаку, заставляя их уйти из комнаты.

Позже Гордон и Аликс находят рабочее конфискационное поле, заряжая гравитационную пушку, что помогает им в сражении с солдатами, которые ещё остались в Цитадели. Они находят лифт, спускаясь прямо к ядру.</p>
           
           
<img src="https://www.hl-inside.ru/hl2/walkthrough/images/ep1_sol142.jpg" className='img'></img>
           <h1>Глава 2: Прямое вмешательство</h1>
           <p>Аликс и Гордон находят ядро Цитадели; девушка замечает, что солдаты специально пытались спровоцировать взрыв. Из-за высокой радиоактивности близ ядра, замедлить реакцию спускается только Гордон, ибо у него есть HEV костюм. Сражаясь с солдатами, Гордон активирует все установки стабилизации и замедляет взрыв Цитадели, выигрывая время. Когда Гордон возвращается к Аликс, она уже взломала сеть Альянса, скопировав данные, которые Альянс пытался передать в свой родной мир посредством взрыва Цитадели. Среди данных было видео Джудит Моссман, в котором она, в Арктике вместе с другими членами Сопротивления, говорит о некоем «проекте», однако внезапно врывается отряд Альянса, прерывая запись.

Дуэт спускается на лифте к перрону, откуда уезжают на поезде-бритве, перевозящем спящих сталкеров в капсулах. Аликс говорит, что уже через пару часов она и Гордон будут за радиусом взрыва, однако поезд внезапно терпит крушение, пробуждая спящих сталкеров, а Гордон теряет сознание.</p>
  
<img src="https://www.hl-inside.ru/hl2/walkthrough/images/ep1_sol339.jpg" className='img'></img>
                <h1>Глава 3: Обездоленные</h1>
                <p>Гордон приходит в сознание под вопли одного из сталкеров, капсула которого зажала Аликс. Гордон с помощью грави-пушки отодвигает капсулу, освобождая подругу. Выйдя из поезда, пара попадает в заброшенные подземелья. Эти места уже давно находятся не под контролем Альянсом, о чём говорят зомби, хедкрабы и муравьиные львы. Именно здесь встречается новый тип зомби — зомбайн — заражённый обыкновенным хедкрабом солдат Патруля Альянса, имеющий при себе гранату, которую может достать для подрыва себя и противника. Аликс и Гордон двигаются по подземельям, сражаясь с муравьиными львами, зомби и хедкрабами, пока в конце-концов не выходят в комнату с лифтом, ведущим на поверхность. Они сражаются с кучей зомби, пока не прибывает лифт, позволяя подняться на поверхность.</p>
  
                <img src="https://m.media-amazon.com/images/M/MV5BM2QyNmEzYzUtZWFkOC00NDRlLWFkMzUtYWVhMGMzYjhiMDUyXkEyXkFqcGdeQXVyMTEzMjE5NDg4._V1_.jpg" className='img'></img>

                <h1>Глава 4: Побег из города</h1>

                <p>Дуэт выходит на поверхность, наблюдая за Цитаделью и руинами города. Айзек Кляйнер смог захватить бринкасты города, на которых теперь транслирует записи, призывающие выживших бежать из города, также вскользь упоминая о отключении подавляющего поля, которое препятствовало размножению людей. Продвигаясь по городу, Аликс и Гордону приходится вступить в бои с солдатами Патруля, муравьиными львами и зомби.</p>

                <p>В конце-концов пара приходит к одному из убежищ Сопротивления, где встречают Барни Калхуна. Он им объясняет, что Альянс всеми силами старается задержать выживших, не давая эвакуироваться. Он и его группа планируют взять штурмом железнодорожный вокзал «Техника» для эвакуации, на что Аликс предлагает вместе с Гордоном отвлечь Альянс, давая возможность спокойно пройти группе к поездам. Перед расставанием Барни вручает Гордону монтировку. Пара попадает по крышам в госпиталь, в котором сражаются солдаты Патруля и зомби. Попав на чердак, Гордону приходится с помощью РПГ одолеть штурмовика, а после выйти из госпиталя.</p>
            
                <img src="https://www.hl-inside.ru/hl2/walkthrough/images/ep1_sol1116.jpg" className='img'></img>
                <h1>Глава 5: Выход-17</h1>
                <p>После выхода из госпиталя дуэт встречает Барни, уже готового выводить граждан на эвакуацию.</p>

                <p>Гордон и Аликс помогают вывести всех граждан, избавившись от солдат Патруля. После отправки последнего вагона, где также находился и Барни, пара решает сама уехать из города, однако внезапно появляется страйдер, мешающий им. Гордон уничтожает страйдера, а Аликс перепрограммирует командную панель, отправляя один из поездов. В конце пара наблюдает за взрывом Цитадели и вылетающими из неё спасательными капсулами советников. Внезапно взрывная волна догоняет поезд, в последний момент Аликс шепчет имя Гордона.</p>
            
            </div>
            )
        }
    }