import React, {Component} from 'react';
import "./style.css"


export default class Barni1 extends Component{
    render(){
        return(
            <div className='h'>
                <h1>Барни Калхун</h1>
                              <p>Барни Калхаун (англ. Barney Calhoun) — один из главных героев серии Half-Life, бывший охранник
                                 «Черной Мезы», друг Гордона Фримена, главный герой игры Half-Life: Blue Shift. Один из лидеров
                                  Сопротивления.</p>

                                  <p>
                                    Барни можно увидеть в самом начале игры, во время поездки на монорельсе: это охранник, стоящий на 
                                    помосте в туннеле и стучащийся в заклинившую дверь. В Half-Life: Blue Shift, играя за Барни, игрок 
                                    соответственно видит проезжающего мимо Гордона Фримена.
                                    </p>
                                  <h3>Биография</h3>
                                  <p>Не закончив образование в Колледже Мартинсон, Барни устроился на работу офицером охраны среднего
                                     уровня в Черной Мезе с уровнем доступа 3, разместившись в 8 уровне Внешних жилых секторов.
                                      Ещё в то время он приходился большим другом Айзеку Кляйнеру и Гордону Фримену, сотрудникам Чёрной Мезы.

                                    Как охраннику Чёрной Мезы, ему поручена охрана секторов и помощь научной группе по мере необходимости.
                                     В случае ЧС его задачей становится охрана Чёрной Мезы и оборудования, а также обеспечение безопасноcти 
                                     персонала, в то время как его собственная безопасность не слишком важна.

                                    9 мая 200- года Барни получил письмо от Л.М. о переводе его 15 мая на Синюю смену.

                                    До 12 мая Барни выполняет сканирование сетчатки глаза, и его зарплата вырастает. Планируется двухдневная тренировка.

                                    12 и 13 мая Барни проходит двухдневные тренировочные курсы под руководством голографического инструктора.

                                    15 мая Барни переходит на Синюю смену. Его смена длится до 15 августа.</p>
                                    
            </div>
            )
            }
            }
            