import React, {Component} from 'react';
import "./style.css"

export default class Gman1 extends Component{
    render(){
        return(
            <div className='h'>
            
            
            <h1>G-Man</h1>
                    <p>G-Man («Джи-мэн») — ключевой, но таинственный персонаж серии Half-Life. Называемый «зловещим межпространственным
                         бюрократом», он имеет особенности поведения и возможности, стоящие за пределом человеческих. Его личность
                          и мотивы остаются по-прежнему неизвестными. Он играет роль надсмотрщика и, в конечном счёте, работодателя,
                           наблюдая за Гордоном Фрименом и другими персонажами по мере развития серии. В первой части серии и аддонах
                            носил с собой портфель с логотипом Черной Мезы желтого цвета.</p>
                            
   </div>
   )
   }
   }
                            