import React, {Component} from 'react';
import "./style.css"

export default class IlayVance1 extends Component{
    render(){
        return(
            <div className='h'>
                <h1>Илай Вэнс</h1>   
                      <p>Илай Вэнс (англ. Eli Vance) — персонаж игр Half-Life и Half-Life 2, а также Episode One и Episode Two.
                         В прошлом — учёный, физик и исследователь, сотрудник Чёрной Мезы, а после Семичасовой войны — лидер 
                         Сопротивления. Он — отец Аликс Вэнс и муж Азиан Вэнс.</p>   
                         <p>В 2000- году Вэнс работает в Лаборатории аномальных материалов Сектора C исследовательского комплекса 
                            «Чёрная Меза». Являясь полноправным работником Чёрной Мезы, проживает в самом исследовательском 
                            комплексе со своей женой Азиан и дочерью Аликс.

                        Хотя его имя за игру не было произнесено ни разу, и он не был представлен как полноценный персонаж, 
                        Илай дважды появляется в Half-Life как один из чернокожих учёных (о том, что это именно он, можно 
                        догадаться со слов самого Вэнса в Half-Life 2: «Так-так, последний раз я отправил тебя за помощью 
                        после каскадного резонанса.»). В первый раз — когда Гордон Фримен направляется в тестовую 
                        камеру: доктор Вэнс и другой учёный озвучивают своё беспокойство по поводу неисправности компьютерного
                         оборудования, которое было повреждено в ходе утреннего эксперимента (как раз в этот момент взрывается
                          суперкомпьютер, рядом с которым они стояли). Во второй раз — когда Гордон поднимается из тестовой
                           камеры на лифте после каскадного резонанса, он вновь сталкивается с Вэнсом и его расстроенным коллегой
                            у того же самого компьютера. Илай сообщает Гордону, что телекоммуникации нарушены, и отправляет его
                             на поверхность, за помощью. Его последнее действие в Half-Life — взаимодействие со сканером сетчатки
                              для открытия двери, за которой следует долгий и сложный путь Гордона через комплекс.</p>
                              <p>После помощи Гордону Илай покинул комплекс вместе с Аликс, в то время как Азиан погибла во время Инцидента.
                                 Аликс, семейная фотография и обручальное кольцо, которое он носит до сих пор — всё, что он смог спасти из Чёрной Мезы.

После побега, Илай переместился в Восточную Чёрную Мезу, где он поучаствовал в основании местного отделения Сопротивления и возглавил комплекс. В 
этот период он также потерял ногу в схватке с буллсквидом, помогая Кляйнеру перебраться через барьер в Сити 17.

Во время своей работы в Восточной Чёрной Мезе, Илай растил дочь и сконструировал робота Пса для того, чтобы тот защищал маленькую Аликс.
 Также он сконструировал гравитационную пушку, работал над телепортацией с Кляйнером и Джудит Моссман и доработал со своей дочерью багги
  для нужд аванпостов Сопротивления, расположенных вдоль Побережья, на котором также разместил тау-пушку.

По словам вортигонтов, Илай стал первым человеком, установившим мирный контакт с ними, быстро убедив чужую расу примкнуть к человечеству
 в борьбе с вторжением Альянса. Более того, вортигонты утверждают, что Илай полностью заслужил их доверие, необходим для освобождения и
  сочетает в себе лучшие качества человека.</p>
  
            </div>

            
   )
   }
   }
           