import React, {Component} from 'react';
import "./style.css"

export default class Security1 extends Component{
    render(){
        return(
            <div className='h'>
                 <h1>Служба безопасности Чёрной Мезы</h1>
                                         <p>Служба безопасности Чёрной Мезы — основной состав сотрудников в Чёрной Мезе. Вместе с 
                                          
                                          
                                            персоналом научной команды, они являются одними из ключевых сотрудников.</p>

                                <p>Охранники комплекса — мужчины, одетые в единообразную униформу, состоящую из голубой рубашки, чёрного галстука, тёмно-синих брюк, солдатских ботинок, шлема и бронежилета с бейджем и набедренной кобуры. Стандартным оружием для них является пистолет Glock, однако, помимо него, используется тяжёлый пистолет Desert Eagle (только у «Отисов» в Opposing Force), а также револьверы Colt Python, дробовики, автоматы и некоторые другие виды вооружения, что, впрочем, не показано в самих играх (за исключением игрока в Blue Shift, другое оружие, кроме пистолета, можно обнаружить только у трупов или на постах).

Сотрудники Службы безопасности встречаются во всех секторах Чёрной Мезы. Их задача — надзор в области безопасности в комплексе. Они работают в семь смен, соответствующих службе в различных секторах комплекса: Красную, Оранжевую (сектор А), Желтую, Зелёную (сектор B), Голубую, Синюю (сектор C) и Фиолетовую (предположительно, сектор F «Комплекс Лямбда»). Чаще всего сотрудники службы безопасности стоят возле входов в помещения, требующих определённого уровня доступа. Они могут не пустить желающего пройти, если у него нет допуска или он не надел защитный костюм. Также охранники служат на контрольно-пропускных пунктах Транспортной системы Чёрной Мезы.</p>
            
            
            </div>
            )
        }
    }