import React, {Component} from 'react';
import "./style.css"

export default class Since1 extends Component{
    render(){
        return(
            <div className='h'>
                <h1>Научная команда Чёрной Мезы</h1>
                                    <p>Научная команда Чёрной Мезы — основной состав сотрудников в Чёрной Мезе. Вместе с персоналом службы
                                         безопасности, они являются одними из ключевых сотрудников Чёрной Мезы.</p>
           
           <p>В играх серии Half-Life мы можем встретить 3 типа учёных:<br/>

Обычные учёные. Их можно встретить на всей территории Чёрной Мезы. Они наблюдают за состоянием аппаратуры, проводят эксперименты или просто бесцельно ходят по комплексу.<br/>
Учёные, работающие в опасных условиях. Те же учёные, но с другими задачами. Они работают в опасных условиях (например, в Зене). Все они должны носить специальный костюм HEV, защищающий от неблагоприятных условий. Также они проходят специальный курс тренировки, где их учат взаимодействовать с костюмом и обращаться с оружием.<br/>
Учёные, работающие с опасными материалами. Те же учёные, но работающие с радиоактивными или опасными материалами. Одеты в специальный резиновый защищающий костюм.</p>
           <h2>Должности</h2>
           <p>Исследователи и разработчики — класс, к которому относится большая часть учёных. Они проводят эксперименты и создают новые технологии. Область исследований простирается от молекулярной физики и биологии до полётов в космос. Многие из этого класса имеют некоторые познания в области первой помощи и могут лечить игрока.<br></br>
Научные сотрудники — как правило, работают вместе с исследователями, но имеют более низкий статус в служебной иерархии. От них требуется проводить не очень сложные действия, типа перевозки тележки с кристаллом или нажатия на кнопку запуска. К этому классу относятся Гордон Фримен и Колетт Грин.<br></br>
Инспекторы по опасным средам — также участвуют в экспериментах, но основная их задача в поддержании безопасных рабочих условий. Джина Кросс работала инспектором.<br></br>
Инструктора — учёные, взявшие на себя дополнительную работу по обучению других сотрудников в секторе A. Они могут делать это сами или использовать свои голографические копии. К этому классу также относится Джина Кросс, появляющаяся как голографический инструктор в Half-Life.<br></br>
Исследовательская команда — наиболее опасная должность. Это люди, телепортируемые в пограничный мир Зен для сбора образцов и проведения экспериментов. Они хорошо обучены владению оружием и носят бронекостюмы. Многие исследователи нашли в Зене свою смерть.</p>
           
            </div>
            )
        }
    }