import React, {Component} from 'react';
import "./style.css"

export default class Alyx extends Component{
    render(){
        return(
        <div className='h'>





<h1>Аликс Вэнс</h1>
                                                 <p>Аликс Вэнс (англ. Alyx Vance) — один из наиболее значимых персонажей Half-Life 2 и его эпизодов.</p>
                                                 <h3>Биография</h3>
                                                 <p>Будучи маленьким ребёнком, Аликс жила в общежитии на территории Научно-исследовательского комплекса 
                                                    Чёрная Меза вместе со своим отцом Илаем и матерью Азиан, пока Илай работал в Тестовых лабораториях
                                                     сектора С. Когда произошёл инцидент в Чёрной Мезе, Илаю удалось бежать вместе с Аликс и семейной 
                                                     фотографией, а Азиан погибла во время инцидента. Во время этих событий G-Man сыграл важную
                                                      роль в спасении Аликс, несмотря на возражения неназванных скептиков. Аликс была слишком мала, 
                                                      чтобы помнить это, и хотя Илай помнил эти события, он никогда не рассказывал ей о них.

Аликс была воспитана Илаем в мире, контролируемом Альянсом, скорее всего, большую часть времени в Восточной Чёрной Мезе. Всё это время
 она была в очень хороших отношениях с доктором Кляйнером, называя его «Дядя Кляйнер» на нежном портрете, однажды подаренным ему.
  Когда Аликс была ещё ребёнком, Илай, используя металлолом, создал Пса, функционирующего робота, предназначенного для её защиты 
  и развлечения, что делало его физически сильным, умным и со встроенным шестым чувством, чтобы он всегда мог знать, где Аликс.
   Хотя первая модель была высотой не более метра, позже Аликс стала добавлять новые части, в результате чего к моменту Half-Life 2 
   Пёс вырос до 2,5 метров.

Когда Аликс достигла совершеннолетия, она стала активно работать на Сопротивление, став одним из основных его членов. В первую 
очередь она помогла Кляйнеру и Барни в оказании помощи гражданским покинуть город и добраться до Восточной Чёрной Мезы по старым
 каналам. Также она помогала Кляйнеру, Илаю и Джудит Моссман установить связь между телепортами Восточной Чёрной Мезы и лаборатории
  Кляйнера, в основном выполняя инсталляцию деталей, но не проводя математических вычислений, по настоянию Джудит к вящему негодованию Аликс.</p>
                                                 <h3>Half-Life 2</h3>   
                                                 <p>В Half-Life 2 Аликс около 24 лет. Она уже взрослая девушка, которая работает на Сопротивление 
                                                    и делает всё возможное, чтобы свергнуть правительство Альянса на Земле. Аликс, возможно,
                                                     самый важный персонаж в Half-Life 2, так как она помогает Гордону больше, чем любой другой
                                                      человек. Её первое появление происходит в первой главе, Точка Внедрения, когда безоружного 
                                                      Гордона окружили бойцы Гражданской обороны. Аликс бросается в комнату и одна снимает всех
                                                       ГОшников (хотя мы этого не видим). Затем она сопровождает Гордона в лабораторию доктора
                                                        Кляйнера, там они встречаются с Кляйнером и Барни. После того, как Гордон надевает 
                                                        свой костюм H.E.V, они входят в комнату телепорта, чтобы перебраться в лабораторию 
                                                        Илая в Восточной Чёрной Мезе. Однако, из-за произошедшей аварии Гордон и Аликс расстаются,
                                                         в результате чего Гордону приходится в одиночку выбираться из Сити 17.</p>
                                                         <p>Когда Гордон добирается до Восточной Чёрной Мезы, он встречает там Аликс и её отца.
                                                             Позже она даёт Гордону грави-пушку и обучает его обращению с ней. Также на базе
                                                              видна оправданная, как позже оказывается, враждебность Аликс по отношению к Джудит
                                                               Моссман. Вскоре базу атакуют войска Альянса, берут в плен Илая Вэнса и Джудит 
                                                               Моссман и увозят их в Нова Проспект. Аликс и Гордон разными путями проникают
                                                                туда и узнают, что Моссман работала на Альянс и выдала местонахождение Илая. 
                                                                Найдя Илая, Аликс требует от Джудит запустить телепорт Альянса и переправить
                                                                 его в лабораторию Кляйнера, однако во время перестрелки с солдатами Моссман
                                                                  телепортируется вместе с Илаем в Цитадель Альянса.

Воспользовавшись телепортом, Аликс и Гордон возвращаются в Сити 17. Аликс помогает доктору Кляйнеру безопасно выбраться из города, после чего 
вместе с Фрименом прорывается к Цитадели, чтобы вызволить отца. По дороге Аликс пленяют солдаты Альянса. Когда Гордон проникает в Цитадель, где
 председатель Уоллес Брин пытается заставить Илая работать на Альянс, шантажируя его жизнью Аликс, Джудит Моссман переходит на сторону Сопротивления
  и освобождает Аликс, Илая и Гордона. Брин пытается сбежать через главный телепорт Альянса в другой мир, но Аликс и Гордон останавливают его и 
  уничтожают реактор тёмной энергии. Аликс оказывается в нескольких метрах от взрыва реактора, когда Гордона забирает в стазис G-Man и на этом 
  моменте игра заканчивается.</p>

                                                         <h3>Half-Life 2: Episode One</h3>
                                                         <p>В начале Episode One группа вортигонтов перемещается на вершину Цитадели и спасает 
                                                            Аликс от гибели, после чего уводят Гордона Фримена из-под контроля G-Man’а. Позже 
                                                            Аликс и Пёс вытаскивают Фримена из-под завала. Аликс выходит на связь с отцом, 
                                                            успевшим выбраться из Сити 17 и узнаёт, что Цитадель вскоре должна взорваться и 
                                                            уничтожить весь город. Аликс вместе с Гордоном вновь возвращается в Цитадель, 
                                                            чтобы отсрочить неминуемый взрыв. Там Аликс проникает в базу данных Альянса и 
                                                            находит некое важное сообщение, которые Альянс планировал переправить в свой мир;
                                                             также Аликс копирует на запоминающее устройство сообщение от Джудит Моссман, 
                                                             улетевшей в Арктику.

Совместными усилиями Аликс и Гордон выбираются из Сити 17 на поезде. Цитадель взрывается, и их поезд накрывает взрывная волна.</p>
                                                            <h3>Half-Life 2: Episode Two</h3>
                                                            <p>После уничтожения Сити 17 Аликс и Гордон оказываются в лесной местности за городом.
                                                                 На месте Цитадели возникает формирование сверхпортала, через который ослабленный 
                                                                 Альянс готовится получить новое подкрепление. Аликс помогает Гордону выбраться из 
                                                                 сошедшего с моста поезда и вместе они начинают путешествие к базе Сопротивления 
                                                                 «Белая Роща», чтобы передать захваченные в Цитадели данные, которые помогут закрыть портал.

В начале пути на Аликс нападает синтет-охотник Альянса и серьёзно ранит девушку, вонзая лезвия в её спину. Подоспевший на помощь вортигонт не даёт ей 
умереть, поддерживая жизненные силы в ней, и вместе с Фрименом отправляется в гнездо муравьиных львов на поиски личиночного экстракта. С помощью экстракта 
вортигонты излечивают находящуюся при смерти Аликс (говоря при этом: «Потеряв её, мы потеряем всё!»). После излечения на спине у Аликс остаются следы огромных ран.

Во время процесса исцеления появляется G-Man. Он говорит Фримену, что, в отличие от своих неизвестных нанимателей, считает жизнь Аликс ещё более значимой, 
чем когда он спас её из Чёрной Мезы. G-Man велит Фримену защищать девушку на пути к Белой Роще, а самой Аликс внушает передать её отцу послание «Будь готов
 к непредвиденным последствиям», что она и делает по прибытии на базу, впав на несколько секунд в транс. Илая Вэнса сильно шокируют эти слова; он рассказывает
  Гордону наедине, что G-Man уже говорил их ему много лет назад перед злосчастным экспериментом в Чёрной Мезе. Илай так же упоминает, что G-Man спас тогда его
   дочь «из-за каких-то чёртовых личных соображений».</p>
                                                                <p>После расшифровки послания, которое Аликс похитила из Цитадели, выясняется, что Джудит
                                                                     Моссман обнаружила в Арктике потерянный ледокол «Борей», содержащий на борту опасную 
                                                                     технологию, которую желает заполучить Альянс. В конце игры Аликс вместе с Гордоном
                                                                      собирается отправится на спасение доктора Моссман и поиски Борея. Когда Илай 
                                                                      отправляется провожать их, в ангар врываются Советники Альянса и убивают его.</p></div>
        )
    }
    }