import React, {Component} from 'react';
import "./style.css"

export default class Barni extends Component{
    render(){
        return(
            <div className='h'>
                <h1>Барни Калхун</h1>
                              <p>Барни Калхаун (англ. Barney Calhoun) — один из главных героев серии Half-Life, бывший охранник
                                 «Черной Мезы», друг Гордона Фримена, главный герой игры Half-Life: Blue Shift. Один из лидеров
                                  Сопротивления.</p>

                                  <p>
                                    Барни можно увидеть в самом начале игры, во время поездки на монорельсе: это охранник, стоящий на 
                                    помосте в туннеле и стучащийся в заклинившую дверь. В Half-Life: Blue Shift, играя за Барни, игрок 
                                    соответственно видит проезжающего мимо Гордона Фримена.
                                    </p>
                                  <h3>Биография</h3>
                                  <p>Не закончив образование в Колледже Мартинсон, Барни устроился на работу офицером охраны среднего
                                     уровня в Черной Мезе с уровнем доступа 3, разместившись в 8 уровне Внешних жилых секторов.
                                      Ещё в то время он приходился большим другом Айзеку Кляйнеру и Гордону Фримену, сотрудникам Чёрной Мезы.

                                    Как охраннику Чёрной Мезы, ему поручена охрана секторов и помощь научной группе по мере необходимости.
                                     В случае ЧС его задачей становится охрана Чёрной Мезы и оборудования, а также обеспечение безопасноcти 
                                     персонала, в то время как его собственная безопасность не слишком важна.

                                    9 мая 200- года Барни получил письмо от Л.М. о переводе его 15 мая на Синюю смену.

                                    До 12 мая Барни выполняет сканирование сетчатки глаза, и его зарплата вырастает. Планируется двухдневная тренировка.

                                    12 и 13 мая Барни проходит двухдневные тренировочные курсы под руководством голографического инструктора.

                                    15 мая Барни переходит на Синюю смену. Его смена длится до 15 августа.</p>
                                    <h3>Half-Life 2</h3>
                                    <p>О судьбе Барни сразу после спасения из «Черной Мезы» ничего не известно; о 
                                        Розенберге, Симмонсе и Уолтере в игре вообще не упоминается. Через полтора 
                                        десятка лет Калхун входит в состав Сопротивления в Сити-17 и заодно работает
                                         под прикрытием в Гражданской Обороне. Он также следит за безопасностью доктора Кляйнера.</p>
                                         <p>В начале игры Барни спасает прибывшего в Сити 17 Гордона Фримена, который едва не садится
                                             на поезд до тюрьмы Нова Проспект. Связавшись с Кляйнером, он поспешно направляет Гордона
                                              в его лабораторию. Чуть позже Барни присоединяется там к Гордону и Аликс, чтобы помочь
                                               им телепортироваться в «Восточную Чёрную Мезу». Телепортация Фримена нарушается; он
                                                вынужден добираться своим ходом, и Барни даёт ему знаменитую монтировку.

Спустя два дня разрушительные действия Фримена в Нова Проспект побуждают повстанцев начать войну с Альянсом. Когда Фримен и 
Аликс из-за странного эффекта телепортируются в лабораторию Кляйнера за неделю, Барни уже стал главнокомандующим Сопротивления 
и подступает к подножию Цитадели. Вместе с Фрименом он захватывает Нексус Патруля. Через некоторое время Гордон проникает в
 Цитадель, а Барни говорит ему на прощанье: «Если увидишь доктора Брина, передай ему, чтобы шёл нахрен».</p>
                                        <h3>Half-Life 2: Episode One</h3>
                                        <p>Аликс и Гордон встречают Барни в главе «Побег из города», в укрытии повстанцев. 
                                            Приятно удивлённый тем, что они сумели выжить, Барни объясняет им план эвакуации
                                             из города на поездах. Он вручает Гордону свою последнюю монтировку и договаривается
                                              о встрече у вокзала.

По прибытии на вокзал, Барни, Аликс и Гордон проводят несколько групп людей к поездам, отбиваясь от Комбайнов. В конце Барни
 с повстанцами покидает город, в то время когда Аликс с Гордоном отвлекают войска Альянса и уезжают на втором поезде следом.</p>
                                            <h3>Half-Life 2: Episode Two</h3>
                                            <p>О дальнейшей судьбе Барни ничего не известно. По крайней мере, он успел покинуть
                                                 город до взрыва Цитадели, но его имя не упоминается на протяжении всего Half-Life 2: Episode Two.</p>
            </div>
            )
            }
            }
            