import React, {Component} from 'react';
import "./style.css"

export default class Clainer extends Component{
    render(){
        return(
        <div className='h'>
            <h1>Айзек Кляйнер</h1>
                                                                                                           <p>Доктор Айзек Кляйнер (англ. Isaac Kleiner) — один из главных персонажей Half-Life 2
                                                                                                             и эпизодов. Архетипичный «рассеянный гениальный учёный», хотя и менее выраженный,
                                                                                                              Кляйнер является автором ряда работ по телепортации и межпространственному 
                                                                                                              путешествию и одним из немногих оставшихся в живых после инцидента в Чёрной 
                                                                                                              Мезе. Позже он становится одним из ключевых (хотя и несколько застенчивым) 
                                                                                                              лидеров Сопротивления и привилегированным членом научной группы Сопротивления.</p>
                                                                                                              <h3>Биография</h3>
                                                                                                              <p>Вначале Кляйнер работал в качестве профессора в Массачусетском технологическом 
                                                                                                                университете, где он был одним из наставников Гордона Фримена. Похоже, что они 
                                                                                                                начали дружить уже тогда, и Кляйнер быстро впечатлился Фрименом. Позже Кляйнер 
                                                                                                                устроился на работу в тестовые лаборатории сектора C научно-исследовательского 
                                                                                                                комплекса Чёрная Меза, где он работал с Илаем Вэнсом и охранником Барни Калхуном.

За это время Кляйнер, похоже, стал общепризнанным учёным, о чём говорит его фотография на обложке журнала «Популярный учёный», видимо, в статье под названием «Следующий уровень квантовой физики»,
 а также как минимум одна написанная им книга, «Оттуда сюда меньше чем за мгновение» (англ. From Here to There in Under a Second), посвящённая телепортации. На задней обложке присутствует цитата из
  «Популярного учёного» и информация о том, что Кляйнер прославился как пионер в области квантовой телепортации.

Когда Фримен проявил интерес к работе в Чёрной Мезе, Кляйнер рекомендовал его в Гражданском отделе кадров, что в сочетании с опытом Фримена в Институте экспериментальной физики в Инсбруке, Австрия, 
позволило ему получить должность вместо конкурентки Джудит Моссман. В Чёрной Мезе Кляйнер также конкурировал с Арне Магнуссоном за денежный грант.</p>
                                                                                                                    <p>Похоже, что Кляйнер занимает административную должность в секторе «C» до инцидента.
                                                                                                                         Так, он получает копии нескольких писем Л.М. другим сотрудникам, например Барни 
                                                                                                                         Калхуну о его переводе на синюю смену, посланное 9 мая 200- года, или Колетт
                                                                                                                          Грин касательно замены кристалла для эксперимента, который позже приведёт к 
                                                                                                                          Научная команда Чёрной Мезы" Кляйнер находится со всеми в хороших отношениях, 
                                                                                                                          в частности, с Гордоном, Илаем и Барни, хотя Ричард Келлер упоминает в начале 
                                                                                                                          Decay, что он не понимает, что Кляйнер находит в Фримене.</p>
                                                                                                                          <p>После каскадного резонанса, приведшему ко вторжению пришельцев, Кляйнеру
                                                                                                                             удалось выжить и сбежать из Чёрной Мезы, хотя как именно неизвестно. Через
                                                                                                                              какое-то время он перебрался в Сити 17, где сформировал ядро местного 
                                                                                                                              Сопротивления вместе с Илаем Вэнсом, Джудит Моссман и Барни Калхуном. 
                                                                                                                              Илай и Айзек сумели пробраться в город, однако первый потерял ногу из-за
                                                                                                                               буллсквида, помогая Кляйнеру перелезть через забор. В городе Кляйнер 
                                                                                                                               создал небольшую лабораторию под заброшенным зданием Northern Petrol 
                                                                                                                               неподалёку от железнодорожного вокзала, где начал работу над телепортацией 
                                                                                                                               и другими исследованиями, продолжая при этом общаться с Илаем Вэнсом,
                                                                                                                                который работал в Восточной Чёрной Мезе, а также с Джудит Моссман и 
                                                                                                                                дочерью Илая, Аликс Вэнс.

Барни Калхун в это время становится двойным агентом, работая в гражданской обороне, но при этом являясь тайным членом Сопротивления, заботящемся о безопасности Кляйнера и его лаборатории. 
В определённый момент Кляйнер завершил свой телепорт и испытал его на кошке, что, вероятно, привело к её гибели, из-за чего Кляйнеру пришлось продолжить работу. Кляйнер также имеет хедкраба по кличке Ламарр, жало которой 
он удалил. Она вызывает неприязнь со стороны Барни. Когда Аликс стала старше, Кляйнер стал вместе с ней и Барни спасать от Альянса граждан, помогая им бежать по железной дороге из Сити 17 в 
Восточную Чёрную Мезу. К началу событий Half-Life 2 Кляйнер завершает работу над рабочим телепортом.</p>
                                                                                                                   <h3>Half-Life 2</h3> 
                                                                                                                   <p>Вместе со своими коллегами Аликс Вэнс, Барни Калхуном и Илаем Вэнсом он составляет ядро
                                                                                                                     Сопротивления против Альянса. Доктор Кляйнер устроил лабораторию на старом заброшенном
                                                                                                                      складе в Сити 17. Телепортационная система, созданная Кляйнером и Вэнсом, позволяет 
                                                                                                                      почти мгновенно перемещаться между Восточной Чёрной Мезой и лабораторией Кляйнера,
                                                                                                                       находящихся на расстоянии нескольких миль. У Кляйнера есть питомец, хедкраб по кличке 
                                                                                                                       Ламарр. Когда Барни сообщает ему о появлении Гордона Фримена, тот просит его послать 
                                                                                                                       Фримена к нему в лабораторию, забывая при этом, что Гордон не знает, как до неё добраться.
                                                                                                                        В результате на выручку Фримену приходит Аликс. Она отводит его в лабораторию.</p> 
                                                                                                                        <p>Кляйнер отдаёт Гордону улучшенный им защитный костюм HEV и отправляет вместе с 
                                                                                                                            Аликс в Восточную Чёрную Мезу. К сожалению, в процесс телепортации вмешивается
                                                                                                                             Ламарр, и Фримена начинает переносить с места на место, пока он наконец не 
                                                                                                                             оказывается за окном позади Кляйнера. Ему приходится идти в Восточную Чёрную
                                                                                                                              Мезу пешком.

Когда начинается восстание, Пёс, робот Аликс, находит приют в лаборатории Кляйнера. Во время восстания большую часть времени Айзек проводит в одиночестве, если не считать Ламарр, так как Барни руководит
 действиями повстанцев. На случай опасности он защищается дробовиком. Когда Аликс и Гордон телепортируются из Нова Проспект к нему в лабораторию через неделю после начала восстания, Айзек сохраняет оптимизм,
  высоко оценивая шансы повстанцев. После этого Аликс остаётся на какое-то время с ним, стараясь убедить его покинуть город, что он делает только после того, как находит Ламарр.</p>    
                                                                                                                                    <p>В лаборатории Кляйнера можно найти обложку журнала Популярный учёный
                                                                                                                                         (пародия на Популярную науку), на которой изображено лицо молодого Айзека.
                                                                                                                                          В молодости у него есть волосы на голове и бакенбарды. Судя по всему,
                                                                                                                                           фотография была сделана в середине или конце 1990-х. На той же доске 
                                                                                                                                           закреплён рисунок маленькой Аликс, подписанный «Дядя Кляйнер». В Восточной
                                                                                                                                            Чёрной Мезе и укрытии Аликс можно обнаружить книгу Айзека Кляйнера «Отсюда 
                                                                                                                                            до туда меньше чем за секунду».</p>           
                                                                                                                                            <h3>Half-Life 2: Episode One</h3>
                                                                                                                                            <p>В Episode One Кляйнер не предстаёт вживую и прямое общение с ним происходит
                                                                                                                                                 лишь единожды за игру, в начале, когда Аликс связывается со своим отцом.
                                                                                                                                                  Однако позже его неоднократно можно увидеть на всевозможных экранах, 
                                                                                                                                                  предназначенных прежде для Бринкаста. Он специально записал повторяющееся
                                                                                                                                                   сообщение, в котором призывает жителей города направляться к ближайшей
                                                                                                                                                    железнодорожной станции и эвакуироваться. Кляйнер также сообщает об 
                                                                                                                                                    отключении подавляющего поля и призывает людей восстановлять популяцию.
                                                                                                                                                     Сообщение также призвано объединить людей перед всеобщей фактом того,
                                                                                                                                                      что восстание только начинается и ситуация может со временем ухудшиться.
                                                                                                                                                       Скорее всего, сообщения отправляются из Белой Рощи.</p>
                                                                                                                                                       <h3>Half-Life 2: Episode Two</h3>
                                                                                                                                                       <p>Впервые Кляйнер появляется на экране вместе с Арне Магнуссоном и Илаем Вэнсом,
                                                                                                                                                         когда с ними связывается Аликс и Гордон. Во второй раз он появляется во время 
                                                                                                                                                         монолога G-Man'а. Во плоти он появляется в Белой Роще, где с доктором Магнуссоном
                                                                                                                                                          работает над ракетой. Перед запуском Кляйнер отмечает, что ракета весит на восемь
                                                                                                                                                           с половиной фунтов тяжелее, чем запланировано, однако Магнуссон отметает его 
                                                                                                                                                           сомнения, и ракету всё равно запускают. К сожалению для Кляйнера, лишним грузом
                                                                                                                                                            является Ламарр, которая залезла в ракету через оставленный открытым носовой люк.

Когда Кляйнер узнаёт, что Джудит Моссман обнаружила Борей, он с энтузиазмом предлагает использовать нечто, содержащееся на корабле, против Альянса, но Илай не соглашается с ним, высказывая опасения касательно того, что оно может попасть
 не в те руки и стать причиной новой катастрофы. После запуска ракеты Кляйнер остаётся помочь Магнуссону уничтожить суперпортал, в то время как Аликс, Илай, Гордон и Пёс выходят наружу, чтобы понаблюдать закрытие портала своими глазами.</p>
        </div>
        )
    }
}