import React, {Component} from 'react';
import "./style.css"

export default class Dog extends Component{
    render(){
        return(
        <div className='h'>
                <h1>Пёс</h1>
                                                                                                                                    <p>Пёс (англ. Dog, стилизовано как DØg) — «домашний» робот Аликс Вэнс, спроектированный и 
                                                                                                                                        собранный её отцом Илаем Вэнсом для её защиты, когда она была ещё ребёнком.</p>
                                                                                                                                        <h3>Биография</h3>
                                                                                                                                        <p>Пёс был создан Илаем Вэнсом более чем двадцать лет назад одновременно как подарок и 
                                                                                                                                            защитник его дочери Аликс Вэнс. Он запрограммирован на игривость, а также на непоколебимую 
                                                                                                                                            верность Аликс, играя роль и питомца, и телохранителя. Как и Барни Калхун, он нередко 
                                                                                                                                            становится источником комичных ситуаций в игре, чему способствуют его причуды и множество
                                                                                                                                             странных, непонятных решений.

Будучи спровоцирован, он становится чрезвычайно опасным для своих врагов. Используя свою огромную силу и массу, он разрывает их на части и размазывает по земле. Схватки с его участием зачастую до смешного преувеличены, он 
всегда бросается вперёд, не заботясь о себе и последствиях, и при этом не получает значительного урона. Это делает его основной силой любой битвы, он может с лёгкостью уничтожать страйдеров, а также поднимать и метать в противников тяжёлые объекты.</p>
                                                                                                                                        <p>Аликс относится к Псу как к любимому питомцу, часто зовёт его «мальчик» и использует соответствующий 
                                                                                                                                            язык тела и голос, будто бы обращаясь к обыкновенной собаке. Она хлопает по ногам, зовя Пса в Восточной 
                                                                                                                                            Чёрной Мезе, и подаёт ему команду «принеси», когда Гордон бросает шаровую мину. Их отношения в общем 
                                                                                                                                            напоминают отношения хозяина и питомца: они обладают взаимным доверием и дружбой, которые за годы
                                                                                                                                             выросли настолько, что Аликс прислушивается к мнениям и чутью Пса, даже если они выглядят безумными.
                                                                                                                                              Она также привыкла к его хаотичному поведению, например, когда он без предупреждения убегает, чтобы
                                                                                                                                               через несколько мгновений вернуться обратно. Их отношения отличаются от традиционных отношений 
                                                                                                                                               собаки и хозяина в том плане, что Пёс гораздо умнее обычной собаки и намного больше и сильнее,
                                                                                                                                                чем любой человек. Однако, эти различия редко встают между ними, отчего их дружба выглядит 
                                                                                                                                                чрезвычайно крепкой. Пёс, кажется, обладает «шестым чувством», он способен определять, где
                                                                                                                                                 находится хозяйка, вне зависимости от ситуации. Когда Аликс оказывается в Цитадели, он
                                                                                                                                                  поднимает стену, чтобы отправить Гордона ей на помощь.

Тело Пса собрано из металлических пластин, гидравлики и тросов. На его лице есть нечто, похожее на камеру, используемое в качестве глаза, и три детали сканера вокруг него. Он четвероногий, но ходит с опорой на передние конечности как горилла.
 Сложно в точности передать его язык тела из-за размеров и массы. Для выражения эмоций он может использовать глаз, встроенная диафрагма проявлять показывать эмоции схожим с человеческим глазом образом. Части лица из сканеров также выражают его настроение.

Первая модель была около метра ростом, но когда Аликс выросла, она сама стала делать улучшения и новые детали для Пса, отчего к моменту событий Half-Life 2 его высота составляет приблизительно 2,5 метра.


Пёс имеет манипулятор нулевого уровня подобный грави-пушке. Он встроен в его руку и используется им для поднятия и метания различных объектов. Пёс обладает невероятной силой, что оказывается весьма полезным в ходе игры, так как он способен
 бросать во врагов крупные объекты вроде автомобилей и помогать Фримену проникать туда, куда бы он не смог попасть самостоятельно. Пёс выдерживает огромный урон, ни пули, ни огонь, ни взрывчатка не способны его остановить.</p>
                                                                                                                    <h3>Half-Life 2</h3>
                                                                                                                    <p>Гордон Фримен впервые знакомится с Псом на свалке Восточной Чёрной Мезы. Как часть обучения использованию
                                                                                                                         грави-пушки, Аликс организовывает игру в «принеси» между Гордоном и Псом, в которой деактивированная 
                                                                                                                         шаровая мина Альянса используется в качестве мячика. Игра прерывается нападением Альянса на базу. В 
                                                                                                                         ходе отступления Пёс, по просьбе Аликс, открывает Гордону дверь в неиспользуемый тоннель, ведущий в
                                                                                                                          Рейвенхольм, чтобы тот, будучи отрезанным от Аликс, смог уйти. Когда Гордон уходит, Пёс остаётся,
                                                                                                                           чтобы помочь Аликс и повстанцам защитить лабораторию.

Гордон вновь встречает Пса после телепортации из Нова Проспект в лабораторию Кляйнера в конце главы «Запутанность». Команда опять разделается, когда Гордон с Псом отправляется на поиски Барни Калхуна, а Аликс остаётся с 
доктором Кляйнером, отказывается уходить без своей питомицы хедкраба Ламарр. Вскоре после начала главы «Нарушитель номер один», Пёс, оказавшись за лабораторией, в одиночку бросает в ближайший отряд Альянса автомобиль, 
после чего сражается с Бронетранспортёром, который он впоследствии также метает в солдат Альянса. После этого он силой открывает ворота и пропускает Гордона внутрь. Вместо того, чтобы следовать за ним, он, увидев транспортёр,
 хватается за него, и те улетают в неизвестном направлении.

В конце концов Псу удаётся найти Барни, и все трое вместе с Гордоном встречаются в конце главы «За кулисами», в сцене, во время которой Пёс в пылу сражения сбивает колонну со статуей всадника. Пока Барни разговаривает с 
Фрименом, Пёс, по-видимому понимая, что Аликс находится в Цитадели и желая вызволить её, поднимает часть заградительного барьера, под которым находится канализация. Это последний раз в Half-Life 2, когда Гордон видит Пса, 
открывающего ему путь внутрь.</p>

                                                                                                                                            <h3>Half-Life 2: Episode One</h3>
                                                                                                                                            <p>Episode One начинается с того, что Гордон лежит в темноте. До него доходят звуки
                                                                                                                                                 Аликс и Пса, после чего один из булыжников поднимается и через образовавшуюся
                                                                                                                                                  щель появляется «морда» Пса. Он выглядит ликующим и быстро раскапывает завал,
                                                                                                                                                   доставая Гордона наружу.

После мгновения радости, Пёс помогает Аликс связаться с отцом, используя своё металлическое тело в качестве антенны и изгибая лапу, чтобы улучшить сигнал. После долгих раздумий Аликс и Гордон решают отправиться в Цитадель, 
однако путь им преграждает гигантское ущелье. Пёс ненадолго убегает и возвращается с остовом автомобиля. Вымерив ширину броском камня, он уговаривает Аликс и Гордона сесть в машины, чтобы он смог их перебросить. Наконец,
 перед тем как залезть внутрь, Аликс просит Пса найти её отца. После этого Гордон и Аликс садятся в машину, и Пёс перебрасывает их. Больше он в Episode One не появляется.</p>
                                                                                                                                                    <h3>Half-Life 2: Episode Two</h3>
                                                                                                                                                    <p>В Episode Two, Пёс появляется ближе к концу игры в запределье, когда Гордон и
                                                                                                                                                         Аликс находятся вблизи Белой Рощи. Продвижению их машины мешают ворота. Когда 
                                                                                                                                                         они перебираются на другую сторону, страйдер, прежде лежавший на земле, поднимается.
                                                                                                                                                          К счастью, появляется Пёс и вступает с синтетом в эпическую схватку, не страшась за
                                                                                                                                                           себя ни капли. Он уворачивается от выстрела и нескольких попыток раздавить его и
                                                                                                                                                            вырывает «мозг» страйдера.

После этого Пёс вместе с Гордоном отправляются к базе наперегонки. Если Гордон побеждает, Аликс подкалывает Пса: «В следующий раз повезёт, копуша». Однако, если победит Пёс, он совершит триумфальный танец. Затем Пёс остаётся снаружи
 помогать ИТГС патрулировать территорию, в то время как Гордон и Аликс идут внутрь на встречу с Илаем и Кляйнером.

Ближе к концу игры, прямо перед закрытием суперпортала, Пёс появляется вновь. Он приветствует Аликс, но затем отвлекается на что-то и убегает, к разочарованию девушки. Пока Пса нет, Аликс, Гордон и Илай заходят в ангар с вертолётом, 
где на них нападают советники, которые убивают Илая. Прежде чем они успевают сделать то же самое с Аликс, появляется Пёс и спасает хозяйку, серьёзно раня одного из советников, благодаря чему заставляет их отступить. Аликс прижимает 
к себе тело отца, а Пёс смотрит на это с горечью и смятением.</p>
        </div>
        )
    }
}