import React, {Component} from 'react';
import "./style.css"

export default class Gman extends Component{
    render(){
        return(
            <div className='h'>
            
            
            <h1>G-Man</h1>
                    <p>G-Man («Джи-мэн») — ключевой, но таинственный персонаж серии Half-Life. Называемый «зловещим межпространственным
                         бюрократом», он имеет особенности поведения и возможности, стоящие за пределом человеческих. Его личность
                          и мотивы остаются по-прежнему неизвестными. Он играет роль надсмотрщика и, в конечном счёте, работодателя,
                           наблюдая за Гордоном Фрименом и другими персонажами по мере развития серии. В первой части серии и аддонах
                            носил с собой портфель с логотипом Черной Мезы желтого цвета.</p>
                            <h3>Half-Life 2 и эпизоды</h3>
                            <p>Во второй части G-Man периодически появляется, как бы наблюдая за Фрименом, идёт ли он верной дорогой.
                                 В частности, его можно увидеть, разговаривающим с Одессой Кэббэджом на их базе, в главе Шоссе-17, 
                                 посмотрев в бинокль на аванпосту Альянса.

В конце игры он забирает Фримена в стазис, но вортигонты вытаскивают его оттуда, показывая своё недоброжелательное отношение к G-Man'у.
 В Half-Life 2: Episode One он больше не появляется, теряя на некоторое время контроль над Гордоном. В Half-Life 2: Episode Two G-Man
  приказывает Гордону доставить Аликс в Белую Рощу, чтобы та передала своему отцу фразу: «Будь готов к непредвиденным последствиям!»,
   что впоследствии и происходит.</p>
   </div>
   )
   }
   }
                            