import React, {Component} from 'react';
import "./style.css"

export default class GordonFreeman extends Component{
    render(){
        return(
           
            <div className="h">
                 
            <h1>Гордон Фримен</h1>
                <p >Го́рдон Фри́мен (англ. Gordon Freeman) — один из главных героев серии игр Half-Life. 
                    Он — физик-теоретик в научно-исследовательском комплексе Чёрная Меза, вынужденный 
                    защищать себя и человечество от враждебных существ из другого мира и иных врагов 
                    после неудачного эксперимента. В процессе он превращается в легендарного героя Сопротивления,
                     став одним из лидеров борьбы с инопланетными захватчиками.</p>
                     <h2>Биография</h2>
                     <h3>Ранняя жизнь и учёба в MIT</h3>
                     <p>Уроженец Сиэтла, Фримен уже в раннем возрасте проявил интерес и способности к областям 
                        квантовой физики и относительности. Его кумирами в детстве были Альберт Эйнштейн, Стивен 
                        Хокинг и Ричард Фейнман. В возрасте шести лет он собрал теннисную пушку, работавшую на бутане.

В конце 90-х годов, будучи приглашённым студентом в Инсбрукском университете, Гордон присутствовал на ранних экспериментах
 по телепортации, проводимых Институтом экспериментальной физики. С тех пор практическое применение телепортации становится
  страстью молодого физика. Он поступил в Массачусетский технологический институт, где его наставником стал доктор Кляйнер. 
  В 1999 году Фримену была присвоена учёная степень доктора наук (PhD) от Массачусетского технологического института (MIT)
   за работу, названную «Наблюдение запутанности Эйнштейна-Подольского-Розена на супраквантовых структурах с помощью индукции
    через нелинейные трансурановые кристаллы импульсом сверхдлинноволнового (СДВ) диапазона от источника с синхронизированными
     модами».</p>
                    <h3>Работа в Чёрной Мезе</h3>
                    <p>Принимая участие в академических исследованиях Инсбрукского университета, Гордон был разочарован их
                         медленными темпами и недостаточным финансированием. Охваченный своей мечтой, учёный начал искать 
                         работу вне образовательных учреждений, и фортуна улыбнулась ему. Бывший наставник Фримена в MIT, 
                         доктор Айзек Кляйнер, взялся за секретный проект в Исследовательском центре «Чёрная Меза» и стал
                          искать талантливых помощников. Его выбор сразу же пал на Гордона Фримена, что позволило ему обойти 
                          Джудит Моссман в гонке за эту должность. Учитывая источники и размеры финансирования, Фримен подозревал,
                           что в центре ведутся разработки новых вооружений. Но, несмотря на опасения, учёный принял предложение
                            работы, надеясь, что мирное применение технологиям также будет найдено.

                        На момент инцидента в Чёрной Мезе, 16 мая 200- года, Гордону 27 лет и он не содержит иждивенцев.
                         Он работает в секторе C Научного комплекса «Чёрная Меза» и имеет 3 уровень доступа, будучи научным сотрудником
                          в лаборатории аномальных материалов. Он живёт в одиночку в общежитии в Южном крыле Чёрной Мезы в 
                          комнате 309. Хотя для самого Гордона личность его спонсора остаётся в тайне, более поздние источники
                           указывают, что это G-Man.

                Отдел, в котором работает Гордон Фримен, занимается ядерными, субатомными и квантовыми исследованиями.
                 Несмотря на докторскую степень, полученную в престижном институте, Фримен под управлением игрока занимается 
                 низкоквалифицированной работой, не требующей серьёзной интеллектуальной работы. В начале Half-Life 2 Барни
                  использует этот факт, чтобы подшутить над ним, когда Гордон предоставляет свою помощь доктору Кляйнеру.


                </p>
                
                </div>
        )
    }
}