import React, {Component} from 'react';
import "./style.css"

export default class Grigoriy extends Component{
    render(){
        return(
        <div className='h'>
                <h1>Отец Григорий</h1>
                                                                                                                                                            <p>Отец Григо́рий (англ. Father Grigori) — единственный известный выживший житель
                                                                                                                                                                 Рейвенхольма во время событий Half-Life 2. Он кажется слегка психически 
                                                                                                                                                                 неуравновешенным, однако достаточно дружелюбным. В Half-Life 2 он помогает 
                                                                                                                                                                 Гордону пройти через Рейвенхольм, разрешив ему использовать свои ловушки,
                                                                                                                                                                  расставленные по всему городу, дав ему дробовик и сопроводив к шахтам на
                                                                                                                                                                   другом конце города.</p>
                                                                                                                                                                   <h3>Биография</h3>
                                                                                                                                                                   <p>Хотя мало что раскрывается о прежней жизни отца Григория, точно известно, 
                                                                                                                                                                    что он родился и вырос не в Рейвенхольме, однако именно здесь он решил стать
                                                                                                                                                                     священником во время Оккупации Земли Альянсом. Когда город обстреляли 
                                                                                                                                                                     снарядами с хедкрабами, из-за чего большая часть населения превратилась
                                                                                                                                                                      в зомби, а Григорий начал сходить с ума. Он решил остаться и установить
                                                                                                                                                                       ряд смертоносных ловушек, чтобы «освободить» свою паству из состояния, в
                                                                                                                                                                        котором она оказалась, через смерть. Он называет зомби своей паствой и 
                                                                                                                                                                        детьми, поскольку эти люди были его знакомыми и прихожанами до обращения.</p>
                                                                                                                                                                        <h3>Half-Life 2</h3>
                                                                                                                                                                        <p>Впервые о своём присутствии Григорий даёт знать, когда Фримен достигает 
                                                                                                                                                                            первой ловушки с лезвиями. Можно услышать, как он на отдалении произносит
                                                                                                                                                                             речь, содержащую множество библейских фраз. Гордон и Григорий впервые
                                                                                                                                                                              видят друг друга во время схватки с несколькими зомби. Появившийся из-за 
                                                                                                                                                                              двери, отец Григорий встаёт над охваченной пламенем кучей трупов и, 
                                                                                                                                                                              поприветствовав учёного в HEV, обещает «приглядеть за ним».

В следующий раз Григорий появляется через дыру в крыше здания напротив того, на котором стоит Гордон. Он хвалит его за упорство в борьбе с ордами зомби и предлагает использовать свои ловушки, однако предупреждает об опасности самому стать их жертвой.
 После этого он стреляет в быстрого хедкраба, собирающегося прыгнуть сзади на Гордона, и призывает героя быть бдительным в Рейвенхольме.

Когда Гордон поднимается на строительные леса при помощи ловушки с автомобилем, Григорий появляется на крыше и представляется, добавляя «Ты уже встречал мою паству!» Позже Григорий стреляет в хедкраба перед окном здания, в котором находится Гордон,
 отчего стекло пролетает прямо перед Фрименом. Григорий извиняется, но напоминает, что пули — меньшая из его проблем.</p>
                                                                                                        <p>Впоследствии Григорий бросает Фримену свой дробовик, советуя целиться в голову, и направляет к церкви. После нескольких схваток с зомби Гордон опять встречает святого отца, который напоминает ему о том, чтобы тот шёл к церкви, после чего в качестве помощи расстреливает из винтовки нескольких зомби. Когда Гордон появляется на крыше здания напротив церкви, отец Григорий отправляет к нему платформу, пока герой отбивается от быстрых зомби. После этого Фримен переправляется за забор и наконец воссоединяется со священником.

При личной встрече Григорий предлагает Гордону помочь добраться до шахты, через которую он сможет выбраться из города. При этом он подчёркивает, что не намерен сам покидать город, предпочитая «заботиться о пастве». Вместе они проходят по кладбищу, где Григорий открывает ворота, ведущие в шахту, после чего прощается с Фрименом и остаётся уничтожать зомби.

Дальнейшая судьба Отца Григория остаётся неизвестной — в игре он более не встречается и не упоминается. Возможно, взрыв Цитадели в Half-Life 2: Episode One, уничтоживший Сити 17, задел Рейвенхольм, и отца Григория не осталось в живых, если он не успел до этого момента погибнуть в сражениях с зомби, хотя в Half-Life 2: Episode Two показано, что леса за пределами Сити 17 не пострадали, поэтому возможно, что шахтёрский город остался не тронут. В книге Half-Life 2: Raising the Bar разработчики заявляют, что намеренно решили оставить его судьбу на суд игроков и никакого дальнейшего появления Григория в последующих частях не запланировали.</p>

        </div>
        )
    }
}