import React, {Component} from 'react';
import "./style.css"

export default class IlayVance extends Component{
    render(){
        return(
            <div className='h'>
                <h1>Илай Вэнс</h1>   
                      <p>Илай Вэнс (англ. Eli Vance) — персонаж игр Half-Life и Half-Life 2, а также Episode One и Episode Two.
                         В прошлом — учёный, физик и исследователь, сотрудник Чёрной Мезы, а после Семичасовой войны — лидер 
                         Сопротивления. Он — отец Аликс Вэнс и муж Азиан Вэнс.</p>   
                         <p>В 2000- году Вэнс работает в Лаборатории аномальных материалов Сектора C исследовательского комплекса 
                            «Чёрная Меза». Являясь полноправным работником Чёрной Мезы, проживает в самом исследовательском 
                            комплексе со своей женой Азиан и дочерью Аликс.

                        Хотя его имя за игру не было произнесено ни разу, и он не был представлен как полноценный персонаж, 
                        Илай дважды появляется в Half-Life как один из чернокожих учёных (о том, что это именно он, можно 
                        догадаться со слов самого Вэнса в Half-Life 2: «Так-так, последний раз я отправил тебя за помощью 
                        после каскадного резонанса.»). В первый раз — когда Гордон Фримен направляется в тестовую 
                        камеру: доктор Вэнс и другой учёный озвучивают своё беспокойство по поводу неисправности компьютерного
                         оборудования, которое было повреждено в ходе утреннего эксперимента (как раз в этот момент взрывается
                          суперкомпьютер, рядом с которым они стояли). Во второй раз — когда Гордон поднимается из тестовой
                           камеры на лифте после каскадного резонанса, он вновь сталкивается с Вэнсом и его расстроенным коллегой
                            у того же самого компьютера. Илай сообщает Гордону, что телекоммуникации нарушены, и отправляет его
                             на поверхность, за помощью. Его последнее действие в Half-Life — взаимодействие со сканером сетчатки
                              для открытия двери, за которой следует долгий и сложный путь Гордона через комплекс.</p>
                              <p>После помощи Гордону Илай покинул комплекс вместе с Аликс, в то время как Азиан погибла во время Инцидента.
                                 Аликс, семейная фотография и обручальное кольцо, которое он носит до сих пор — всё, что он смог спасти из Чёрной Мезы.

После побега, Илай переместился в Восточную Чёрную Мезу, где он поучаствовал в основании местного отделения Сопротивления и возглавил комплекс. В 
этот период он также потерял ногу в схватке с буллсквидом, помогая Кляйнеру перебраться через барьер в Сити 17.

Во время своей работы в Восточной Чёрной Мезе, Илай растил дочь и сконструировал робота Пса для того, чтобы тот защищал маленькую Аликс.
 Также он сконструировал гравитационную пушку, работал над телепортацией с Кляйнером и Джудит Моссман и доработал со своей дочерью багги
  для нужд аванпостов Сопротивления, расположенных вдоль Побережья, на котором также разместил тау-пушку.

По словам вортигонтов, Илай стал первым человеком, установившим мирный контакт с ними, быстро убедив чужую расу примкнуть к человечеству
 в борьбе с вторжением Альянса. Более того, вортигонты утверждают, что Илай полностью заслужил их доверие, необходим для освобождения и
  сочетает в себе лучшие качества человека.</p>
  <h3>Half-Life 2</h3>
  <p>Как выжившие после Инцидента, Илай, Аликс, Айзек Кляйнер и Барни Калхун сформировали ядро Сопротивления, пытавшегося сломить
     Альянс, который захватил Землю после Семичасовой войны. Вэнсы создали импровизированную лабораторию, Восточную Чёрную Мезу,
      на окраине Сити 17. Здесь д-р Джудит Моссман помогала им в их продолжительных исследованиях в сфере телепортации.

Когда Гордон Фримен вышел из стазиса, он объединился с бывшими коллегами и связался с Илаем, находившимся в своей лаборатории.
 Кляйнер и Вэнс быстро установили работающую связку телепортов между своими лабораториями, однако, система потерпела крах на 
 второй попытке из-за вмешательства Ламарр, вынудив Гордона отправиться в Восточную Чёрную Мезу на своих двоих.

Прибытие Фримена в лабораторию Илая провоцирует вторжение сил Альянса, которые преследовали Фримена на протяжении всего пути,
 в Восточную Чёрную Мезу. Солдаты Альянса берут в плен Илая и транспортируют его в тюрьму Нова Проспект.

Позже, Гордон и Аликс берут штурмом Нова Проспект с целью освободить Илая. Однако после того, как 
они обнаруживают пленённых Илая Вэнс и Джудит Моссман, во время перестрелки в зале телепортации, 
Моссман, вместе с Илаем Вэнсом, телепортируется в Цитадель.

При попытке пробраться в Цитадель, Аликс и Гордон Фримен также попадают в плен; встреча с Илаем
 и доктором Моссман происходит в кабинете Уоллеса Брина, который пытается убедить Вэнса покончить
  с сопротивлением. Илай отказывается, после чего Брин решает избавиться от него. Этому препятствует 
  Джудит Моссман, освобождающая пленников. Брин, после неудачной попытки воспользоваться перегруженным 
  манипулятором энергетического поля нулевого уровня, провоцирует взрыв и сбегает. Оглушённый Илай 
  остаётся в кабинете под присмотром Моссман, в то время как его дочь вместе с Гордоном преследуют
   Брина. Восстановив силы, Илай вместе с Джудит используют одну из спасательных капсул Брина,
    чтобы покинуть Цитадель и добраться до лагеря вортигонтов, предположительно находящегося в 
    Пустошах, далеко за пределами города. Вскоре после этого Гордон Фримен уничтожает реактор Тёмной энергии Цитадели.</p>
    <h3>Half-Life 2: Episode One</h3>
    <p>В Episode One Илай появляется в начале игры на мониторе в видеопередаче, инициированной Аликс.
         Илай советует Аликс и Гордону выбираться из Сити 17 до взрыва Ядра Цитадели. Судя по всему,
          сам Илай находится в безопасности. Доктор Моссман в передаче не присутствует, из чего можно
           заключить, что на этот момент она либо готовится к отлёту на север, либо уже в пути.</p>
           <h3>Half-Life 2: Episode Two</h3>
           <p>В Episode Two, Илай работает с Кляйнером и Арне Магнуссоном над ракетой в Белой Роще,
             которая должна нейтрализовать портальный шторм и предотвратить появление подкреплений
              Альянса из бездействующего на данный момент суперпортала. По прибытии Аликс и Гордона
               в Белую Рощу, они получают запись передачи Джудит Моссман о Борее, которая так и не
                достигла Белой Рощи. Илай заметно напуган той опасностью, которой подвергается Моссман,
                 и единственное, что уберегает его от самостоятельного путешествия за ней — доводы Аликс
                  и Кляйнера. Когда в передаче появляется Борей, Илай незамедлительно высказывает желание
                   уничтожить его, во избежание повторения событий в Чёрной Мезе. Затем Аликс бессознательно 
                   передает отцу сообщение, посланное через её подсознание G-Man'ом: «Будь готов к 
                   непредвиденным последствиям». Шокированный, Илай отправляет Аликс в соседнюю комнату
                    под предлогом сделать ему чашку чая.

Как только Аликс уходит, Илай говорит, что тоже знает о существовании G-Man'а (он единственный персонаж во вселенной
 Half-Life, который открыто об этом говорит). Он указывает Гордону, что кристалл Зена, который положил началу событиям,
  произошедшим в Чёрной Мезе, был доставлен G-Man'ом, и что Аликс выжила в Чёрной Мезе благодаря его вмешательству. 
  Секундой позже Гордон вошёл в тестовую камеру, и G-Man сказал Илаю ту же самую фразу о непредвиденных последствиях.
   Илай также ясно даёт понять, что знает о связи Гордона с G-Man'ом, называя последнего «нашим общим другом» (возможно,
    Илай даже знает или по крайней мере подозревает о годах Гордона, проведенных в стазисе). Он убеждён, что недавно
     прозвучавшее предупреждение относится к Борею, и похоже, воспринял его всерьёз, несмотря на то негодование,
      которое он проявил к способу, которым оно было доставлено. Илай хочет еще много обсудить с Гордоном о G-Man'е,
       но перед тем, как он успевает сказать что-либо ещё, в комнату возвращается Аликс и прерывает разговор.</p>
                        <p>После успешного запуска ракеты Илай благодарит Гордона за всё, и говорит, что не мог
                             бы гордиться им больше, даже если бы Гордон был его собственным сыном. Он также 
                             повторяет, что ему есть о чём поговорить с Гордоном, но планирует вернуться к 
                             этому после его возвращения из экспедиции за доктором Моссман. Затем Илай с 
                             Аликс, а также Гордон и Пёс наблюдают за закрытием суперпортала, после чего
                              спукаются в ангар с вертолётом, подготовленным к полету для поиска Джудит. 
                              Стоя у лифта, Илай с дочерью нежно обнимают друг друга. Несколькими секундами 
                              позже в ангар врываются Советники и один из них убивает Илая, в то время как
                               Гордону и Аликс не остаётся ничего иного, кроме как беспомощно наблюдать.
                                Перед смертью Илай Вэнс напоминает Гордону о необходимости любой ценой 
                                уничтожить Борей.</p>
            </div>

            
   )
   }
   }
           