import React, {Component} from 'react';
import "./style.css"

export default class Mosman extends Component{
    render(){
        return(
        <div className='h'>
                <h1>Джудит Моссман</h1>
                                                                      <p>Доктор Джудит Моссман — учёная, играющая важную роль в Half-Life 2 и эпизодах.
                                                                         Она хитрый и манипулятивный двойной агент, помогающий обеим сторонам во время 
                                                                         Восстания и в конце концов вставший на сторону Сопротивления. Позже она обнаружила 
                                                                         секретный и мощный проект на пропавшем корабле Борее, который мог быть использован
                                                                          против Альянса. Она выглядит как женщина европеоидной расы сорока с небольшим лет.</p>
                                                                          <h3>Биография</h3>
                                                                          <p>До инцидента в Чёрной Мезе доктор Моссман была многообещающим научным сотрудником.
                                                                             Она подавала заявление на тот же пост, что и Гордон Фримен в Чёрной Мезе, но проиграла
                                                                              ему из-за его огромного опыта в Инсбруке (по словам Илая Вэнса в Восточной Чёрной Мезе)
                                                                               и личной рекомендации Айзека Кляйнера.

Через несколько лет после вторжения Альянса Джудит стала важным членом Сопротивления на Восточной Чёрной Мезе, где она сотрудничала с Илаем Вэнсом в создании 
научных достижений, призванных помочь Сопротивлению в войне. Без ведома даже Аликс Вэнс, которая не любила её, Джудит также шпионила на Альянс и подчинялась 
непосредственно Уоллесу Брину. Как и когда она взяла на себя эту роль, неизвестно, но нетерпение Брина и его замечание о том, что Альянс «мог бы взять Илая 
практически в любое время в течение последних нескольких лет» предполагает, что она действовала в качестве двойного агента задолго до появления Фримена. Она
 также выкрала для Альянса данные по одномерной телепортации — технологии, которой им ранее не хватало.</p>
                                                                            <h3>Half-Life 2</h3>
                                                                            <p>По прибытии Гордона Фримена в Восточную Чёрную Мезу Моссман отводит его вниз,
                                                                                 в лабораторию Илая. Она также была намерена доставить Нежелательное лицо 
                                                                                 непосредственно Брину, но силы Альянса начали атаку значительно раньше, в 
                                                                                 результате чего Фримена захватить не удалось, однако Альянсу достался Илай. 
                                                                                 Похоже, что Моссман была недовольна «лечением» Илая, так как Брин обещал не
                                                                                  вредить ему, однако в отсутствие Фримена Брин не чувствует себя связанным 
                                                                                  этим соглашением.</p>
                                                                                  <p>Во время вторжения в Нова Проспект Гордон и Аликс обнаруживают передачу
                                                                                     разговора Моссман и Брина, чем раскрывают её предательство. Они успешно
                                                                                      блокируют Моссман в её инженерной лаборатории, после чего сообщают ей 
                                                                                      о раскрытии предательства. Однако Моссман не спешит раскаиваться, заявляя,
                                                                                       что она так поступает ради Илая, так как именно сотрудничество с Альянсом
                                                                                        может спасти ему жизнь и позволит спокойно работать дальше. Во время 
                                                                                        побега из Нова Проспект с использованием прототипа телепорта Альянса 
                                                                                        Моссман отвлекает Аликс введением ошибки в систему и в это время перенаправляет
                                                                                         телепортацию, сбежав с Илаем в Цитадель, заявив, что это «единственный путь».
                                                                                          В результате Фримен и Аликс остаются в беде, так как телепорт имеет очень 
                                                                                          долгое время зарядки для повторного использования, а в это время уже поспевают
                                                                                           войска Альянса. Наконец, после долгой перестрелки Гордон и Аликс получают
                                                                                            возможность снова запустить телепорт, чтобы бежать в лабораторию доктора
                                                                                             Кляйнера, первоначальную цель.</p>
                                                                                             <p>Моссман присутствует, когда Фримен наконец достигает кабинета Брина в 
                                                                                                верхней части Цитадели, попав туда в транспортировочной корзине Альянса. 
                                                                                                К сожалению, она говорит Фримену немногое: «Не сопротивляйся, бесполезно.
                                                                                                 Ты ничего не сможешь сделать, пока не окажешься там, где он хочет... Мне очень жаль,
                                                                                                  Гордон». После того, как доктор Брин объявил о своем намерении отправить захваченных
                                                                                                   Илая и Аликс в родной мир Альянса, Моссман одумывается и останавливает Брина,
                                                                                                    блокировав входные двери. Вернувшись на сторону Аликс и Гордона, она пытается 
                                                                                                    освободить Фримена, но у неё ничего не получается. И в это время Брин выстреливает
                                                                                                     из устройства контр-резонансной сингулярности, чем помогает Гордону выбраться, 
                                                                                                     и сбегает в реактор Цитадели. После этого Моссман остаётся с Илаем, а Гордон
                                                                                                      и Аликс бегут преследовать Брина.

В то время, как перед самым взрывом реактора Гордона спасает G-Man, а Аликс вортигонты, Джудит и Илай используют одну из спасательных капсул Брина, чтобы добраться до Белой Рощи.</p>
                                                                                             <h3>Half-Life 2: Episode One</h3>
                                                                                             <p>Джудит наконец достигает с Илаем Белой Рощи и сразу же после прибытия устремляется 
                                                                                                на вертолёте на север[4] в связи с заданием Арне Магнуссона разузнать код портала 
                                                                                                Альянса, необходимый для закрытия предстоящего сверхпортала. Она достигает успехов
                                                                                                 в своём деле и передаёт код в зашифрованном виде в видео, которое перехватили 
                                                                                                 агенты Альянса. Во время попытки стабилизации ядра Цитадели Гордон и Аликс
                                                                                                  обнаруживают и забирают видео, где обнаруживают, что Моссман находится в Арктике
                                                                                                   и сообщает о таинственном проекте, однако внезапно трансляцию прерывает атака
                                                                                                    солдат Альянса и охотника.</p>
                                                                                                    <h3>Half-Life 2: Episode Two</h3>
                                                                                                    <p>В Episode Two Магнуссон, Кляйнер и Илай получают от Джудит через Аликс и Гордона
                                                                                                         код портала, необходимый, чтобы закрыть суперпортал. Проигрывая сообщение, они 
                                                                                                         обнаруживают, что «проект» связан с таинственным Бореем, содержащим, как считается,
                                                                                                          такие мощные технологии, что может повториться семичасовая война. В конце эпизода
                                                                                                           Аликс и Гордон, считая, что Моссман еще жива, готовят вертолёт с намерением лететь 
                                                                                                           на север за ней.</p>
        </div>
        )
    }
}