import React, {Component} from 'react';
import "./style.css"

export default class Resistance extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Сопротивление</h1>
                                                                                                                                                                                    <p>Сопротивление — освободительная повстанческая организация людей и вортигонтов с общей целью — свержение власти
                                                                                                                                                                                       Альянса и восстановление свободы.</p>
                                                                                                                                                                                       <p>Сопротивление не имеет централизованного командования, но имеет ряд ключевых фигур. Илай Вэнс, Барни Калхун,
                                                                                                                                                                                         Арне Магнуссон, Аликс Вэнс, Рассел и Гордон Фримен являются наиболее деятельными лидерами Сопротивления.
                                                                                                                                                                                          Сопротивление специализируется в двух направлениях: тактика ведения боя и исследования. Ученые, такие 
                                                                                                                                                                                          как Илай Вэнс, возглавляют исследовательскую группу Сопротивления, тогда как лидеры вроде Барни Калхуна
                                                                                                                                                                                           и Гордона Фримена возглавляют боевые подразделения. Гордон Фримен имеет высокую репутацию среди членов 
                                                                                                                                                                                           Сопротивления, которые считают его героем, который не только выжил во время Инцидента в Чёрной Мезе,
                                                                                                                                                                                            но и способен положить конец результатам этого инцидента.

Ядро армии Сопротивления составляют: регулярные войска, полноправные члены Сопротивления, оснащенные бронежилетами и расходными материалами (так, многие из них оснащены аптечками, и т.д.); гражданские вооруженные формирования, состоящие из гражданских, способных держать в руках оружие,
 беженцы, которые помогают гражданским в побеге и сражении с бойцами ГО, и вортигонты, разумные обитатели Зена, которые искусно владеют боем, а также используют свой коллективный разум, с целью выявления активности комбайнов. Сопротивление также помогает гражданским, доставляя им продукты
  питания, оружие, амуницию и медикаменты.

В мире, контролируемом Альянсом, человечество охотно использует его технологии. Кроме оружия и брони, Сопротивление активно использует перепрограммированные прыгающие мины, турели, вибрирующие устройства, шаровые мины, и общественную адресную систему доктора Брина, и т.д. Для того,
 чтобы отличить преобразованные технологии Альянса, их как правило отмечают оранжевой лямбдой, а турели помечают акульими зубами на носах, которыми во времена Второй Мировой войны украшали носы самолётов. Люди также используют такие технологии, как радиоприёмники и радиопередатчики,
  ТВ-экраны, камеры, компьютеры, автомобили, корабли и другие структуры, созданные своими руками. Научные группы Сопротивления разрабатывают оружие, такое как устройство Магнуссона и гравитационная пушка, а также телепорты, более эффективные, чем те, что использует Альянс.

Самым важным активом Сопротивления являются Вортигонты благодаря своим великолепным боевым навыкам и коллективному разуму, с помощью которого они способны мгновенно связываться друг с другом (что позволяет им шпионить за Комбайнами даже в таких местах, как Нова Проспект).
 Электрические разряды, производимые Вортигонтами, используются не только в бою, но и для снабжения энергией приборов — от телевизоров и генераторов до защитного костюма HEV Фримена. Однако вортигонты могут использовать свои внутренние резервы не только для создания 
 электрических разрядов, но и для передачи другому живому существу. В Half-Life 2: Episode Two было показано, как вортигонты поддерживают жизнь в смертельно раненной Аликс Вэнс, и более того, реанимируют её после потери пульса и остановки сердцебиения.

В Сити 17, где большинство действий должны быть скрытными, Сопротивление организовало подполье. Агенты Сопротивления, такие как Барни Калхун, внедряются в ряды Гражданской Обороны с целью держать лабораторию доктора Кляйнера и другие аванпосты Сопротивления 
под защитой, помогать гражданским в побеге из города, и, возможно, предупреждать гражданских о инспекциях и рейдах. Вне города Сопротивление имеет возможность совершать атаки на Комбайнов и обеспечивать себе достаточную защиту. Сопротивление захватило основную 
часть побережья, создав для себя крупные аванпосты, такие как Новая Малая Одесса. Однако, малое количество повcтанцев в этой зоне говорит о том, что Сопротивление здесь очень часто подвергается атакам Комбайнов, и они изо всех сил пытаются сохранить побережье за собой.

Сопротивление действует как многие подпольные организации, террористические и повстанческие группировки в современном мире; они не способны сокрушить Империю Альянса лобовыми атаками, а поэтому стараются подорвать их положение, проводя диверсионные операции.
 Сопротивление имело хорошо укреплённые позиции как в самом Сити 17 (Лаборатория Кляйнера), так и вне города (Восточная Чёрная Меза) до их уничтожения Комбайнами. Ранее одним из опорных пунктов Сопротивления за чертой города был Рейвенхольм, прежде чем он был 
 подвергнут бомбардировке снарядами с хедкрабами, в результате которой погибло почти всё население (кроме одного человека).</p>
                </div>
                )
            }
        }