import React, {Component} from 'react';
import "./style.css"

export default class Vort extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Вортигонт-одиночка</h1>
                                                                                                                                                                                            <p>Одинокий вортигонт (англ. Lone Vort) — персонаж Half-Life 2: Episode Two.</p>
                                                                                                                                                                                            <p>После разрушения Цитадели в конце Half-Life 2 этот вортигонт, наряду со своими собратьями,
                                                                                                                                                                                               был освобождён и укрылся в лесах рядом с Белой Рощей. Во время событий Half-Life 2: Episode
                                                                                                                                                                                                Two он вместе с другими вортигонтами охотился на советников недалеко от Шахты Победы. Как 
                                                                                                                                                                                                раз во время охоты он и нашёл раненую Аликс и Гордона, лежащего под завалом. Он на время 
                                                                                                                                                                                                отозвал охоту, созвав своих сородичей для того, чтобы вылечить Аликс.

На некоторое время Гордон и вортигонт разделились из-за того, что лифт, на котором оказался Гордон был неисправен и упал в шахту. Вортигонт принёс Аликс в центр Шахты Победы, контролируемый Сопротивлением. Вскоре туда же прибыл Гордон, а затем и другие вортигонты. Они сказали, 
что для излечения Аликс требуется экстракт. На его поиски отправляются вортигонт и Гордон.

После того как Аликс приходит в себя, вортигонт помогает героям добраться до моста, где можно найти рабочую машину. В следующей главе он не участвует, но в её конце он прощается с Аликс и Гордоном. Аликс целует его на прощание. Его дальнейшая судьба неизвестна. Скорее всего, он вернулся к охоте на советников.</p>
                </div>
        )
    }
}