import React, {Component} from 'react';
import "./style.css"

export default class Ant extends Component{
    render(){
        return(
                <div className='h'> 
                    <h1>Муравьиный лев  </h1>
                <p>Муравьиные львы — прожорливые насекомоподобные существа, своей иерархией напоминающие обычных муравьев.</p>
                <h3>Обзор</h3>
                <p>Муравьиные львы — социальные существа, живущие в больших подземных колониях. Они слепы и для обнаружения других живых существ используют феромоны или звуки вибраций. Имеются несколько типов существ относящихся к ним : <br/>

Солдат муравьиных львов — наиболее встречающийся вид.<br/>
Рабочий муравьиных львов — работают, строят гнёзда и защищают личинок.<br/>
Личинка муравьиных львов — начальная стадия развития муравьиных львов.<br/>
Страж муравьиных львов (или мирмидонт) — наиболее опасный вид муравьиных львов.<br/>
Страж гнезда муравьиных львов — основатель колонии и гнезда муравьиных львов.</p>
<h3>Поведение и навыки</h3>
<p>Солдаты муравьиных львов наиболее встречающийся вид муравьиных львов, яростно охраняющие свои гнезда.
     Достоверно не известно, как размножаются муравьиные львы, однако можно услышать, как один повстанец
      в начале главы «Шоссе 17» говорит, что у муравьиных львов начался период «нереста» и поэтому не 
      известно имеют ли они одну репродуктивную самку(королеву) или спариваются друг с другом. Экстракт
       личинок муравьиных львов очень ценится вортигонтами, так как после применения придает им новые 
       способности и увеличивает силу. После употребления данного экстракта, вортигонт начинает светиться
        фиолетовым светом. Через некоторое время личинки вырастают и все время находятся под защитой рабочих
         муравьиных львов и стража гнезда муравьиных львов. Возможно муравьиные львы являются и охотниками-сборщиками.
          Так как в пещерах гнезда, можно найти множество останков различных существ, которые являются пищей для личинок.</p>
                      
                </div>
        )
    }
}