import React, {Component} from 'react';
import "./style.css"

export default class Barnakl extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Барнакл</h1>
              <p>Существо колонновидной формы с ротовым отверстием на верхней части тела, всегда обращённой вниз.
                 Тело тёмно-красного или коричневатого цвета, состоит из большого количества мышц. Рот барнакла 
                 окружен продолговатыми щупальцами с крепкими клыками, вниз из отверстия спускается длинное липкое 
                 щупальце светлого оттенка с реакцией на касания. Ротовое отверстие продолжается недлинной пластичной
                  глоткой со множеством хитиновых зубцов. Из-за образа жизни и охоты существо часто встречается в
                   тёмных и влажных местах. Ведёт пассивную охоту: свисая с потолка, вытягивает до самого низа чувствительное щупальце.
                    Поймав добычу, барнакл тянет её к себе и сжимает своими мощными челюстями, убивая жертву парой сильных укусов, после 
                    чего переваривает проглоченное.

Барнакл не имеет рецепторов для определения природы прилипающих веществ на чувствительном щупальце, поэтому постарается всё притянуть
 и пожевать. При попытке съесть всякий мусор барнакл выплюнет его. Если же он притягивает какую-либо живую добычу — он абсолютно всеяден,
  может съесть и переварить любое существо, иногда даже более крупное, чем он сам.

Барнаклы прикрепляются к потолкам или нижней стороне выступающих стен. Место, где барнаклы прикрепляются к поверхности, вымазано каким-то 
веществом, похожим на слизь. Возможно, они передвигаются очень медленно, подобно брюхоногим моллюскам (улитки, слизни).

Барнаклы являются слабыми врагами — погибают от 5 выстрелов из пистолета. Барнаклы уязвимы к лому, который во всех играх убивает их 
за один удар. Зачастую, если нет возможности обойти щупальце существа, проще дать ему себя притянуть, а затем, приблизившись к нему,
 убить ударом лома — это экономит боеприпасы. Правда, при этом можно повредиться при падении вниз.

Когда барнакл погибает, его рот раскрывается, и непереваренные части пищи (в основном, кости) вываливаются из желудка. При этом, 
глотка выворачивается наружу, и становятся видны многочисленные зубы.</p>
                </div>
                )
            }
        }