import React, {Component} from 'react';
import "./style.css"

export default class Btr extends Component{
    render(){
        return(
                <div className='h'>
                        <h1>Бронетранспортёр</h1>
                                                                                                             <p>Бронетранспортёр (БТР) — бронированная техника Альянса. Впервые появляется в игре Half-Life 2 (глава «Точка внедрения») и
                                                                                                                 впервые можно увидеть технику в действии в Каналах.</p>                    
                                                                                                                 <p>Хотя бронированными единицами Альянса чаще являются синтеты, БТР разработан по концепции земных машин с внедрением
                                                                                                                     инопланетных технологий. Сразу заметно, что детали корпуса произведены из серо-синего металла (т. н. тёмного сплава),
                                                                                                                      типичного для всех сооружений Альянса. Сами детали – крупные, литые и угловатые, скруглённых элементов на них почти 
                                                                                                                      нет. Что касается колёс, до конца не ясно состоят ли они целиком из металла, или всё же обёрнуты в цельную резину.</p>
                                                                                                                      <p>БТР может перевозить несколько солдат, которые располагаются в задней части машины. Сзади расположены дверцы с 
                                                                                                                        небольшим окошком и ещё одна на левой части корпуса. Также сверху можно заметить застеклённый люк, а на правой 
                                                                                                                        задней части – крытую бойницу для ручного оружия.</p>
                                                                                                                        <p>Альянс предоставляет полную возможность бронетранспортёру вступать в бой после высадки войск. Данная
                                                                                                                             единица оснащена импульсным пулемётом, управляемым изнутри.</p>
                                                                                                                             <p>Пулемёт расположен на крыше и способен вести огонь в любом направлении. Скорее всего, он противопехотный,
                                                                                                                                 так как несколько меньше пушки вертолёта-охотника.</p>
                                                                                                                                 <p>При чрезвычайном положении применяется реактивный гранатомёт с самонаводящимися на цель ракетами
                                                                                                                                     (напр. в главе «Водная преграда»). Из-за того, что он выпускает одним залпом не менее пяти ракет,
                                                                                                                                      у жертвы практически нет шансов на выживание. Странно то, что хоть сама пушка и находится спереди,
                                                                                                                                       ракеты вылетают откуда-то сверху. Скорее всего, разработчики просто этого не учли. Можно предположить,
                                                                                                                                        что такие же ракеты использует РПГ повстанцев, однако урон от ракет БТР несколько ниже.</p>
                                                                                                                                        <p>Иногда можно наблюдать БТР в движении в главах «Через каналы», «Нарушитель номер один» и во главе
                                                                                                                                             «Выход 17» из Episode One. Несмотря на прочное бронирование, ездит он так же быстро, как и обычный
                                                                                                                                              грузовик. Как было сказано ранее, в конструкции используется инопланетный сплав, соотношение
                                                                                                                                               плотность-масса которого может отличаться от такового у привычных земных металлов. Этим можно 
                                                                                                                                               объяснить столь высокую скорость при таких размерах бронированной машины. Примечательно, что 
                                                                                                                                               БТР также может пойти на таран. Например, в начале главы «Нарушитель номер один» он пытается
                                                                                                                                                задавить Пса.</p>
                </div>
                )
            }
        }