import React, {Component} from 'react';
import "./style.css"

export default class Chapper extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Вертолёт-охотник</h1>    
                                                                                                                                                                       <p>Вертолёт-охотник (англ. Hunter-Chopper) — основной боевой вертолёт Патруля Альянса. Как и БТР,
                                                                                                                                                                         вертолёт сочетает в себе черты инженерной мысли человечества и пришельцев.</p>                 
                                                                                                                                                                         <p>Является быстрой и маневренной машиной в сине-серой раскраске с необычным футуристичным видом.
                                                                                                                                                                             В конструкции предусмотрены три ротора — один несущий винт с четырьмя лопастями с выгнутой
                                                                                                                                                                              конфигурацией («крыло чайки»), один продольный размером чуть меньше в фенестроне, расположенный
                                                                                                                                                                               под кабиной пилотов, по-видимому, для улучшения маневрирования, и один хвостовой, также 
                                                                                                                                                                               заключенный в фенестрон. Имеются два небольших крыла, у которых есть по 6 узлов подвески вооружения,
                                                                                                                                                                                также на краях обоих крыльев имеется одноколесное шасси. Экипаж состоит из двух солдат Альянса — 
                                                                                                                                                                                пилота и стрелка. На борту имеется прибор теплового слежения (тепловизор) и средства связи с антеннами на корпусе.

Основное вооружение — скорострельная носовая импульсная пушка, которая, хоть и неточна, но позволяет вертолёту атаковать и поражать несколько целей одновременно. Импульсная пушка имеет по меньшей мере 3 или 4 варианта ведения огня (два из них могут быть одинаковыми): требуется зарядка
 и 3-секундная очередь; требуется зарядка и 6-7-секундная очередь; не требуется зарядка и стрельба очень длинной очередью; и ещё один вариант (используется Гордоном в сторожевой башне и на воздушном катере) - скоростная стрельба длинной очередью (100 патронов) с быстрой перезарядкой 
 для моментального огня и с долгой - для полного восстановления боезапаса.

Вертолёт-охотник также может сбрасывать сферические контактные мины, которые взрываются либо по таймеру, либо при контакте с целью. Кроме того, вертолёт может использовать ракеты для более точного и мощного удара по стационарным целям, но увидеть это можно только один раз, и против игрока они не применяются.

Вертолёт-охотник использует мины в качестве наступательного вооружения, бросая их непосредственно перед движущимися целями и на вершины слабых конструкций. Мины могут плавать, что делает их эффективными против водных судов. Мины могут выбрасываться либо по одной, либо ковровым бомбометанием.

На корпусе можно увидеть код «V952», размещаемый также на других изделиях Альянса.</p>
                </div>
                )
            }
        }