import React, {Component} from 'react';
import "./style.css"

export default class Crabsint extends Component{
    render(){
        return(
                <div className='h'>
                        
                        <h1>Краб-синтет</h1>
                                                                                                                                                                                     <p>Краб-синтет — наземный синтет Альянса, которого можно мельком увидеть на конвейере в Цитадели в конце
                                                                                                                                                                                         Half-Life 2. Совместно с мортирой-синтет составляют костяк «армии будущего Альянса».</p>
                                                                                                                                                                                         <p>Краб-синтет представляет собой синтет насекомоподобной формы со множеством выступов и шипов.
                                                                                                                                                                                             Если посмотреть анимации в ресурсах игры, то его удары схожи с ударами стража муравьиных 
                                                                                                                                                                                             львов, однако помимо шипов, у него так же имеется импульсный пулемёт, установленный в 
                                                                                                                                                                                             носовой части. Пулемёт он использует только тогда, когда передвигается, что можно увидеть
                                                                                                                                                                                              в анимациях игры, в стоячем положении он складывается в специальный отсек.

В отличие от мортиры-синтет, краб-синтет может быть ранен и даже убит после создания. При стрельбе из него выбрызгивается красная кровь, как из ихтиозавра, так как они оба являются не законченными.</p>
                </div>
                )
            }
        }