import React, {Component} from 'react';
import "./style.css"

export default class Elitsoldier extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Элитный солдат Патруля Альянса</h1>
                                                                                                                                          <p>Элитный солдат Патруля Альянса — специализированный высокопоставленный солдат Патруля Альянса. Отличающиеся белым мундиром и 
                                                                                                                                            шлемом с одним красным окуляром, являются самыми опасными трансчеловеческими боевыми единицами Альянса.</p>
                                                                                                                                            <p>Элитные солдаты одеты в улучшенные бронежилеты, у которых, судя по всему, имеются дополнительные бронепластины в областях 
                                                                                                                                                шеи и живота. Также их шлемы сильно отличаются от шлемов обычных солдат, имея всего один окуляр. Стоит обратить внимание,
                                                                                                                                                 что для ушей появились специальные приспособления, которые улучшают слуховые качества. Помимо этого их шлемы снабжены 
                                                                                                                                                 противогазом, рацией, ПНВ и тепловизором.

Элитные солдаты стреляют намного точнее из своего оружия и способны нанести гораздо больше вреда, нежели обычные солдаты Альянса. Вооружаются они, как правило, только импульсными винтовками Патруля. Также они могут использовать альтернативный огонь оружия – энергетический шар.

Обычно элитные солдаты встречаются группами из нескольких человек, но иногда один такой солдат выступает в качестве командира отряда обычных. Также они могут быть задействованы в охране высокопоставленных персон Альянса. Например, элитных солдат можно заметить в
 качестве охранников офиса Уоллеса Брина в Цитадели.</p>
                                                                                                                                                   <p>В Half-Life 2 элитных солдат впервые можно увидеть в главе «Нова Проспект» на экране одной из камер.
                                                                                                                                                     В Half-Life 2: Episode One впервые встречаются в главе «Прямое вмешательство». В Half-Life 2: Episode 
                                                                                                                                                     Two впервые появляются в главе «Кольцо Ворта», проходя по мосту.</p>  
                </div>
                )
            }
        }