import React, {Component} from 'react';
import "./style.css"

export default class Fastzombie extends Component{
    render(){
        return(
                <div className='h'>
                         <h1>Быстрый зомби</h1>
                                                                       <p>Быстрый зомби — разновидность зомби. Отличается от обыкновенного зомби более высокой скоростью, но меньшей живучестью.</p>
                                                                       <p>Быстрый зомби впервые появляется в главе «Мы не ходим в Рейвенхольм...» в игре Half-Life 2. В отличие от обыкновенного 
                                                                        зомби, имеет большую выносливость и скорость. Получил такое качество благодаря быстрому хедкрабу. Тело этого зомби 
                                                                        представляет из себя мышцы, натянутые на кости, что обуславливается тем, что быстрый хедкраб намного более требователен 
                                                                        к телу своей жертвы, чем обыкновенный хедкраб. Быстрые зомби довольно проворны, в некоторых эпизодах они показывают 
                                                                        умение лазать по трубам. Они также могут перепрыгивать расстояния в 5-7 метров (например, с крыши на крышу). Эти зомби 
                                                                        слабее, чем обыкновенные, в следствие чего не могут кидать во врага предметы. Эти зомби издают звуки, вроде завываний 
                                                                        и рёва. Если убить зомби, не повредив хедкраба, то тот спрыгнет с тела и продолжит жить дальше. В Half-Life 2: Episode
                                                                         Two впервые появляются быстрые зомби в спящем состоянии.</p>
                </div>
                )
            }
        }