import React, {Component} from 'react';
import "./style.css"

export default class Fasthedcrab extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Быстрый хедкраб</h1>
                                                                <p>Быстрый хедкраб — вид хедкраба, отличающийся от обыкновенного более высокой скоростью передвижения.</p>
                                                                <p>Тело быстрого хедкраба чуть меньше обыкновенного. Его клешни более тонкие и длинные, что делает его
                                                                     немного похожим на паука. Благодаря своим клешням, он может висеть на потолке и стенах. Издаёт звуки,
                                                                      похожие на свист. Жертва быстрого хедкраба становится быстрым зомби. Неизвестно, являются ли эти
                                                                       хедкрабы естественным видом или же выведенным Альянсом.</p>
                </div>
                )
            }
        }