import React, {Component} from 'react';
import "./style.css"

export default class Fightscaner extends Component{
    render(){
        return(
                <div className='h'>
                        <h1>Боевой сканер</h1>
                                                                                                                                                                <p>Боевой сканер, также известный как Сканер типа II — боевой аналог обычного городского сканера, появляющийся 
                                                                                                                                                                    в Half-Life 2 и Half-Life 2: Episode One.</p>
                                                                                                                                                                    <p>Боевой сканер используется силами Альянса для транспортировки мин хопперов в районы боевых действий.
                                                                                                                                                                         Транспортировка осуществляется при помощи специального приспособления — захвата, расположенного
                                                                                                                                                                          внутри корпуса. Как правило, эти мины используется для задержки или ограничения передвижения сил
                                                                                                                                                                           противника, например в переулках улиц и других узких пространствах.

Помимо данной задачи, боевые сканеры также используется для разведывательных целей совместно с городскими. Иногда используются в качестве наводчиков для страйдеров, сообщая им местонахождение целей в укрытиях и других недоступных местах. Боевой сканер также обладает 
возможностью делать фотографии различных объектов. В качестве питания используется одна батарея, которые можно использовать для подзарядки костюма HEV.</p>
                </div>
                )
            }
        }