import React, {Component} from 'react';
import "./style.css"

export default class Go extends Component{
    render(){
        return(
                <div className='h'>
<h1>Гражданская оборона</h1>
                                                                                                                                            <p>Гражданская Оборона (англ. Civil Protection) — по замыслу Альянса, "полиция мыслей" во всех городских
                                                                                                                                                 районах Земли, в том числе, в Сити 17. Их сотрудники называются "Метро Копы", в то время как используется
                                                                                                                                                  и слитное написание "Метрокопы"". "ГОшники" чаще всего используется гражданскими и членами Сопротивления.

Подразделения Гражданской обороны выполняют функции надсмотрщиков за гражданским населением, а также функции полицейских в плане поимки нарушителей и выявления участников Сопротивления.

Будучи частью Патруля Альянса, Гражданская оборона состоит из обычных людей-коллаборационистов, которые присоединились к силовым структурам Альянса, в основном, чтобы получить поощрение, лучшие места проживания, дополнительные пищевые рационы,
 вещевые единицы и просто лучшую жизнь. Об этом свидетельствуют определённые радиопереговоры. В любом случае, в отличие от других частей Патруля, они не были биомодифицированы Альянсом. Так например, Барни Калхун работал в ГО под прикрытием на Сопротивление.</p>
                                                                                                                                        <p>Сотрудники ГО носят белые железные шлем-маски, полностью скрывающие их лица, которые напоминают советские
                                                                                                                                             противогазы ПМГ и современные ПДФ. Каждый такой шлем-маска оснащён встроенным вокодером, позволяющим
                                                                                                                                              скрывать голос, рацией и противогазом.

Помимо этого в экипировку любого сотрудника ГО входят лёгкий бронежилет, чёрный тактический свитер-куртка, зелёные брюки, перчатки и чёрные кожаные берцы. На предплечье надета повязка с надписью "C17:i4". Также надпись "C17" находится сзади
 воротника. Первая часть в надписи "C17:i4" обозначает Сити 17, а вторая, вероятно, относится к одной из отраслей Альянса, использующего кодовые имена для многих вещей, что можно слышать из голосовых сообщений Патруля Альянса. Однако, любая 
 модель ГО-шников имеет одинаковый номер, видимо, в силу ограничений игры.</p>
                                                                                                                                <p>Обычно сотрудники ГО вооружены 9-мм пистолетами и электрическими дубинками, а также ракетницами для вызова 
                                                                                                                                    подкреплений. В более критичных ситуациях им будут выдаваться пистолеты-пулемёты MP7, станковые пулемёты,
                                                                                                                                     а также оказываться огневая поддержка бронетранспортёрами и вертолётами-охотниками. Некоторые офицеры могут 
                                                                                                                                     быть вооружены мэнхэками. ГОшники, как известно, бьют безоружных гражданских электрическими дубинками по
                                                                                                                                      малейшему поводу. Барни упоминает "норму избиений", однако не совсем ясно, было ли это на самом деле, или,
                                                                                                                                       что более вероятно, это его шутка.

Солдаты ГО активно переговариваются с диспетчером Патруля Альянса по их радиопередатчикам; таким образом они постоянно получают информацию о целях, наградах, напоминаниях и направляются для реагирования на определённые инциденты (например
 расположение уничтоженных подразделений или другие преступные действия). Солдаты ГО почти всегда действуют в составе отрядов или групп и будут использовать очень простую тактику, такую как прикрытие друг друга или бег к раненному или
 перезаряжающемуся для прикрытия. ГО обычно атакует в агрессивной манере. По сообщениям диспетчера Патруля Альянса можно предположить, что у каждой группы есть лидер.</p>
                                                                                                                                            <p>При смерти патрульного его радио издаёт протяжный писк — сигнал системы контроля жизнедеятельности 
                                                                                                                                                и прерывания связи с пользователем. После смерти солдата диспетчер Патруля сообщает по радио 
                                                                                                                                                последнее известное местоположение объекта и приказывает выйти на связь ближайшим группам. По 
                                                                                                                                                факту, постоянные переговоры по радио выдают солдат ГО раньше, чем они становятся видны, что 
                                                                                                                                                говорит о более слабой подготовке офицеров ГО, чем их сослуживцев из Патруля Альянса. ГО, как 
                                                                                                                                                правило, действует отдельно от воинских частей Альянса, таких как солдаты Патруля Альянса или
                                                                                                                                                 синтеты, и пребывают в роли городской полиции. Они передвигаются в бронетранспортёрах или на 
                                                                                                                                                 транспортёрах и часто сопровождаются сканерами и мэнхэками</p>
                                                                                                                                                 <p>Иногда ГОшники находятся на сторожевых башнях Альянса. Оттуда они могут стрелять сигнальными
                                                                                                                                                     ракетами, чтобы предупредить находящиеся поблизости отряды.

Некоторые передачи по радио Гражданской Обороны предполагают, что сотрудники будут вознаграждены, по словам голоса Патруля Альянса, "не механической репродуктивной симуляцией", для хорошей производительности на работе. Пока неизвестно, 
что это означает, но вполне возможно, что это означает разрешение на близость с женщиной. Или скорее всего симуляцией полового акта при помощи стимуляции нервных окончаний и системы, для получения идентичных удовольствий схожих с процессом 
совокупления. Другой наградой, озвученной голосом Патруля, является "сохранение" "сплочённости семьи", предполагая, что провал миссии может вызвать проблемы в семье метрокопа. Из других наград предполагается "паёк против усталости", что-то 
вроде психотропного препарата для большего бодрствования. В качестве наказания за провал миссии, неподчинение или т. п. возможен перевод в солдаты Патруля или элитные солдаты Патруля.

Боевые жилеты, носимые Сопротивлением — фактически бронежилеты ГО, снятые с трупов метрокопов или просто украденные.</p>
                </div>
                )
            }
        }