import React, {Component} from 'react';
import "./style.css"

export default class Hedcrab extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Обыкновенный хедкраб</h1>
                                <p>Небольшое мешкообразное существо с четырьмя конечностями. Самый многочисленный вид, но при
                                     этом самый слабый. Медлителен, но в нескольких метрах от жертвы может сократить расстояние
                                      прыжком. При прыжке целится в голову, чтобы сразу начать зомбирование при помощи своего жала,
                                       которым он связывается со спинным и головным мозгом жертвы. Жертва обыкновенного хедкраба
                                        становится зомби.

Хедкрабов зачастую можно встретить в тёмных углах и в вентиляционных шахтах, а также в тёмных или заброшенных помещениях. Хедкрабы
 всеядны: в природе они обычно едят мясо, но записка в лаборатории Кляйнера говорит о том, что Ламарр любит арбузы. Также хедкрабы
  любят зарываться в песок или грунт. Хотя хедкраб и хищник, он часто сам становится объектом охоты — например, буллсквидов.

Хедкрабы — бесполые существа. Известно, что детёнышей может рождать гонарх, но неизвестно, могут ли хедкрабы размножаться сами.</p>
                </div>
                )
            }
        }