import React, {Component} from 'react';
import "./style.css"

export default class Hopper extends Component{
    render(){
        return(
                <div className='h'>
                         <h1>Хоппер</h1>
                                                                                                                                                        <p>Хоппер — противопехотная мина близкого действия, подлетающая в воздух перед взрывом подобно S-минам. 
                                                                                                                                                            Эти мины доставляются и разворачиваются на месте военными сканерами. Их корпус слегка куполообразной
                                                                                                                                                             формы с тремя "ножками". Когда мина приземляется, она использует эти ножки, чтобы подпрыгнуть, пока
                                                                                                                                                              она не окажется лицом вверх. Этими ножками мина прикрепляется к поверхности.</p>
                                                                                                                                                              <p>Когда враг подходит близко к мине, её лампочка загорается красным, и она издаёт предупреждающее
                                                                                                                                                                 "чириканье". Если противник подошёл слишком близко, то мина взлетает в воздух на высоту до двух
                                                                                                                                                                  метров в сторону угрозы и взрывается при первом контакте с первой попавшейся поверхностью. Также
                                                                                                                                                                   мины взрываются при сильном ударе о твёрдую поверхность. Вместе с тем они совершенно неуязвимы 
                                                                                                                                                                   от огня любого огнестрельного оружия, за исключением грави-пушки.

Из-за их опасности, неподвижности и экстремальной прочности мины недоступны для большинства врагов для их отключения или разрядки, поэтому они используются Альянсом для сдерживания атаки врагов и создания временных, но, зачастую, непроходимых барьеров в считанные
 секунды. Они используются как в помещениях, так и на открытом воздухе, в основном на важных точках, а иногда и скрыто в качестве ловушек.</p>
                </div>
                )
            }
        }