import React, {Component} from 'react';
import "./style.css"

export default class Hunter extends Component{
    render(){
        return(
                <div className='h'>
                            <h1>Охотник</h1>
                                                                                                                                                                        <p>Охотник (англ. Hunter), первоначально известный как министрайдер (англ. Ministrider) — 
                                                                                                                                                                            быстрый и эффективный синтет, используемый войсками Альянса для разведки местности,
                                                                                                                                                                             зачистки и в некоторых случаях прикрытия страйдеров.</p>
                                                                                                                                                                             <p>Тело охотника несколько округлой формы с блестящим сине-зелёным экзоскелетом, 
                                                                                                                                                                                охватывающим его, и посаженное на три ноги, похожих на лошадиные. По центру
                                                                                                                                                                                 расположены два голубых глаза. У него имеются два цепных устройства под глазами, 
                                                                                                                                                                                 которыми он может проткнуть когтями на конечностях, что можно заметить, когда он
                                                                                                                                                                                  протыкает ими Аликс Вэнс. На ногах расположены когти, которыми синтет с лёгкостью 
                                                                                                                                                                                  может порезать противника.

Как и страж муравьиных львов, охотник сильно бронирован, что снижает получаемый от огнестрельного оружия урон.

Как и все синтеты, охотники издают характерные пронзительные звуки. При ранении из них выливается белая жидкость.</p>
                </div>
                )
            }
        }