import React, {Component} from 'react';
import "./style.css"

export default class Manheck extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Мэнхэк</h1>  
                                                                                                                                                                            <p>Мэнхэк (англ. Manhack, образовано от слияние слов «man» (рус. человек) и «hack» (рус. рубить, кромсать),
                                                                                                                                                                                 в терминологии Альянса — потрошитель (англ. Viscerator), иногда именуемый повстанцами как хэк (англ. Hack)
                                                                                                                                                                                  — небольшой робот, используемый Альянсом для сканирования и зачистки территории.</p>              
                                                                                                                                                                                  <p>Мэнхэк представляет из себя механического робота, оснащённого гироскопом, помогающим ему стойко
                                                                                                                                                                                     держаться в воздухе[1]; тремя острыми лезвиями, которые постоянно вращаются с большой скоростью, 
                                                                                                                                                                                     также являясь несущим пропеллером робота; маленьким моторчиком сзади, позволяющим ему набирать 
                                                                                                                                                                                     скорость; помимо этого он водонепроницаем. Хэк атакует, разгоняясь и врезаясь в противника своими
                                                                                                                                                                                      лезвиями, что способно нанести большой урон. Мэнхэки используются для зачистки недоступных территорий 
                                                                                                                                                                                      либо как дополнительная помощь в уничтожении врага. Чаще всего мэнхэки встречаются группами минимум
                                                                                                                                                                                       от 2-ух роботов, но иногда бывают случаи, когда хэк встречается и в одиночку.

В Half-Life 2 и эпизодах мэнхэки изредка выдаются сотрудникам ГО и солдатам Патруля Альянса. Один раз, в гараже БТР можно увидеть, как из раздатчиков Альянса вылетают хэки. В Half-Life: Alyx появляется офицер, способный выпускать мэнхэков.</p>
                </div>
                )
            }
        }