import React, {Component} from 'react';
import "./style.css"

export default class Mine extends Component{
    render(){
        return(
                <div className='h'> 
                    <h1>Шаровая мина</h1>
                                                                                                                                                                <p>Шаровая мина (англ. Rollermine) — шарообразный электрошокер, используемый Альянсом.</p>
                                                                                                                                                                <p>Шаровая мина — самодвижущийся электрошокер сферической формы, оснащённый программируемым
                                                                                                                                                                     датчиком целей, её фасеточный корпус состоит из 12-ти призм высоковольтных электрических 
                                                                                                                                                                     разрядников с контактами электродов, выдвигающимися при переходе мины в режим атаки.

Снабжена датчиком движения и способна идентифицировать цель. При идентификации цели как «Враг», она немедленно устремляется к нему, атакуя высоковольтными электрическими разрядами при касании с целью. Также, используя электромагниты, эта мина может прикрепляться 
к транспортным средствам, существенно затрудняя движение и нанося экипажу урон своими разрядами.

Мина хорошо бронирована, так что пули могут лишь задержать её, немного отбросив назад. Эффективно избавиться от неё можно лишь с помощью окунания в воду, электромагнитного воздействия или взрывчатки.

Шаровые мины, как было показано в Half-Life 2: Episode One, производятся в Цитадели, где доставляются по трубкам.

Мультиинструмент Аликс Вэнс может перенастроить электрическую схему мины, что было продемонстрировано в Half-Life 2: Episode One. Тогда она становится союзником на короткий период. Синее свечение исчезает и появляется жёлто-оранжевое.
 В это время мина — неприятность для врагов. Но через недолгий промежуток времени она меняет цвет на красно-малиновый и вскоре происходит самоуничтожение.</p>
                </div>
                )
            }
        }