import React, {Component} from 'react';
import "./style.css"

export default class Mortsint extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Мортира-синтет</h1>
                                                                                                                                                                            <p>Мортира-синтет — воздушный синтет Альянса, которого можно мельком увидеть на конвейере 
                                                                                                                                                                                в Цитадели ближе к концу Half-Life 2. Совместно с крабом-синтетом составляют костяк «армии будущего Альянса».</p>
                                                                                                                                                                                <p>Тело мортиры-синтета треугольной формы с двумя удлинёнными щупальцами и пусковой установкой сзади. Спереди
                                                                                                                                                                                     расположено множество изогнутых шиповидных выступов и различные светящиеся синие части.</p>
                </div>
                )
            }
        }