import React, {Component} from 'react';
import "./style.css"

export default class Phedcrab extends Component{
    render(){
        return(
                <div className='h'>
                     <h1>Ядовитый хедкраб</h1>
                                                                         <p>Ядовитый хедкраб — один из видов хедкрабов. Как и другие хедкрабы, ядовитый хедкраб может заражать и мутировать людей в зомби.</p>
                                                                            <p>Данный вид хедкраба, скорее всего, является результатом генетических экспериментов Альянса над обыкновенными хедкрабами,
                                                                                 которых помещают в снаряды с хедкрабами в качестве оружия. Сам по себе ядовитый хедкраб не опасен, но когда рядом 
                                                                                 толпа других хедкрабов или зомби, его укус представляет чрезвычайную опасность. Больше всего ядовитые хедкрабы похожи
                                                                                  на паука. Они имеют чёрный окрас, из-за чего их не всегда можно разглядеть в тёмных помещениях. Передвигаются даже
                                                                                   медленнее чем обыкновенные хедкрабы, но если их ранить, когда они этого не ждут, то они несколько секунд будут убегать
                                                                                    от противника.</p>
                </div>
                )
            }
        }