import React, {Component} from 'react';
import "./style.css"

export default class Pzombie extends Component{
    render(){
        return(
                <div className='h'>
                        <h1>Ядовитый зомби</h1>
                                                                                    <p>Ядовитый зомби (англ. Poison Zombie) — вид зомби, который покрыт ядовитыми хедкрабами. Он обладает большим 
                                                                                        запасом здоровья, чем обычный зомби, и способен кидаться ядовитыми хедкрабами. Если убить ядовитого зомби,
                                                                                         то ядовитые хедкрабы спрыгнут с тела и начнут самостоятельно двигаться.</p>
                                                                                         <p>Зомби данного вида очень медлительны, но скорость уравновешивается их живучестью. От воздействия яда 
                                                                                            хедкрабов, тело ядовитого зомби разбухает, из-за этого люди, зомбированные ядовитым хедкрабом кажутся
                                                                                             толстыми. Ядовитый зомби носит на себе 3-4 ядовитых хедкрабов, один из них контролирует жертву, другие
                                                                                              сидят на его сгорбленной спине. Ядовитые зомби тяжело и громко дышат, что позволяет слышать их издалека
                                                                                               и отличать от других видов зомби.

Ядовитые зомби опасны тем, что могут метать сидящих на теле хедкрабов, а в паре с другими видами зомби они становятся невероятно коварными. Если же на ядовитом зомби остаётся всего один ядовитый 
хедкраб, то он начинает бить когтями.</p>
                </div>
                )
            }
        }