import React, {Component} from 'react';
import "./style.css"

export default class Scaner extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Городской сканер</h1>
                                                                                                                                                <p>Городской сканер, также известный как Сканер типа I — легкобронированный аппарат
                                                                                                                                                     снабженный камерой для фото-видео съемки. Используется Альянсом для контроля над 
                                                                                                                                                     городом Сити 17. Имеется боевой аналог, известный как боевой сканер типа II.</p>
                                                                                                                                                     <p>Сканеры — специальные легкобронированные летательные аппараты снабженные прожекторами и камерами,
                                                                                                                                                         используемыми для фото-видео съемки. При использовании камеры происходит очень яркая вспышка, 
                                                                                                                                                         способная ослепить человека, даже если он не смотрит прямо в объектив. Имеется также прожектор,
                                                                                                                                                          установленный в верхней части, используемый для подсветки объектов в темное время суток или
                                                                                                                                                           затемненных местах.

В качестве питания для сканера используется одна батарея Альянса, которую также можно использовать для подзарядки костюма HEV. Так как сканеры являются легкобронированными, то они могут быть уничтожены прямым попаданием нескольких пуль или же в 
результате столкновения с каким-либо твердым предметом. При критическом повреждении сканер начинает издавать характерный звук и неконтролируемо движется в прямом направлении до взрыва.

Городские сканеры используется как правило в городах и редко встречаются в других областях. Они патрулируют улицы и каналы города Сити 17 в поисках различных беженцев или других разыскиваемых лиц. Другой задачей сканеров является разведка
 заданной территории для оповещения близлежащих сил Альянса. Во время чрезвычайных ситуаций, сканеры развертываются в очень большом количестве из Цитадели. Примером такой ситуации является поиск Гордона Фримена в городе Сити 17.

Часть сканера также используется в качестве модуля съемки на Псе.</p>
                </div>
                )
            }
            }