import React, {Component} from 'react';
import "./style.css"

export default class Sniper extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Снайпер Альянса</h1>
                                                                                                                                                     <p>Снайпер Патруля Альянса — обычный солдат, прошедший обучение по использованию снайперской 
                                                                                                                                                        винтовки Патруля. Снайперы встречаются в высоких недоступных местах, где они имеют хорошую 
                                                                                                                                                        зону обстрела. Снайпера нельзя увидеть, но достаточно легко заметить по синему ЛЦУ снайперской
                                                                                                                                                         винтовки. Являются таким же опасными противниками, как и снайперы HECU, хотя и демаскируют себя ЛЦУ.</p>
                                                                                                                                                         <p>Снайперы, как правило, являются очень точными противниками и будут стрелять по всему движущемуся.
                                                                                                                                                             Однако снайпера можно и запутать. Когда игрок бежит, снайпер наводит на него прицел, в этот момент
                                                                                                                                                              нужно резко повернуть в другую сторону и так до тех пор пока не достигнете снайпера. Даже на легком 
                                                                                                                                                              уровне сложности, снайпер способен убить игрока без брони с 2-3 выстрелов. Они также будут стрелять
                                                                                                                                                               по всем предметам, чтобы уменьшить число укрытий которыми можно воспользоваться.

Стреляют снайперы по всему живому (за исключением союзных солдат), от хедкрабов и зомби до голубей и ворон.</p>
                </div>
                )
            }
        }