import React, {Component} from 'react';
import "./style.css"

export default class Soldier extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Солдат Альянса</h1>
                                                                                                                                                                                        <p>Солдат Патруля Альянса — основная пехотная единица армии Альянса на Земле. 
                                                                                                                                                                                            В отличие от Гражданской обороны, в обязанности которых входит слежение
                                                                                                                                                                                             за порядком в населённых пунктах, солдатам Патруля ставятся более 
                                                                                                                                                                                             серьёзные задачи: от патрулирования окраин города до подавления сопротивления
                                                                                                                                                                                              в нужных точках.

Как военнослужащие, в отличие от правоохранительных органов, солдаты Альянса получают доступ к военному оборудованию и военной тактической подготовке, что делает их более опасными противниками, чем сотрудники Гражданской обороны.</p>
                                                                                                                                                                                           <p>Солдаты одеты в тёмную форму с тяжёлым бронежилетом и дополнительными накладными пластинами, которые защищают их торс, пах, руки и бёдра. Также их шлемы являются более совершенной моделью, чем у патрульных Гражданской обороны. Солдаты имеют знак отличия, размещённый на правом плече. Как правило, к месту назначения солдаты добираются на транспортниках. Вооружение солдат включает в себя: пистолет-пулемёт MP7, импульсную винтовку AR2, дробовик SPAS-12 и гранаты MK3A2 Grenade. Солдаты часто встречаются в Сити 17, на побережье за городом и во внешних зонах, где они занимаются патрулированием местности. Помимо этого солдаты охраняют особо важные объекты.

Солдаты — люди, которые были подвержены расширенной модификации, включающей хирургические вмешательства и имплантацию различных кибернетических устройств в тело. Данные процедуры проводятся в лабораториях Альянса на Земле, в Нова Проспект и Цитадели.</p>
<p>Несмотря на подобные изменения, солдаты испытывают многие человеческие чувства — для примера, они стонут при ранении и ругаются, если в них бросают гранаты. Солдаты также используют рации, но, в отличие от патрульных, они редко переговариваются с диспетчером, хотя и регулярно докладывают о ситуации в Центр Управления.</p>
                                                                                                                                 <h3>Солдат Нова Проспект</h3>       
                                                                                                                                 <p>Солдаты Нова Проспект или тюремщики — солдаты, которые охраняют тюрьму строгого режима Нова Проспект. 
                                                                                                                                    Тюремщики точно такие же как и обычные солдаты, вооружены тем же оружием и различаются только цветом
                                                                                                                                     бронежилета. Они облачены в бронежилет тёмно-синего цвета с надписью "Nova Prospekt" на спине и правом
                                                                                                                                      плече, а окуляры на шлеме жёлтого цвета, а не голубого. Когда тюремщики переговариваются по рации можно 
                                                                                                                                      заметить, что их голос значительно ниже, чем у обычных солдат. Это говорит о том, что в Нова Проспект
                                                                                                                                       они подверглись дальнейшей модернизации.</p>                            
                                                                                                                                       <h3>Солдат с дробовиком</h3>
                                                                                                                                       <p>Данный солдат всегда вооружён дробовиком SPAS-12. Таких солдат достаточно легко отличить от 
                                                                                                                                        обычных по их особой униформе и оранжевым окулярам. Если присмотреться, то их шлем немного 
                                                                                                                                        темнее, чем у других солдат. На их левой руке можно заметить значок элиты. Возможно, что 
                                                                                                                                        такие солдаты относятся к командирам отрядов или имеют звание выше остальных. В Нова Проспект
                                                                                                                                         данные солдаты облачены в обычный тёмно-синий бронежилет тюремщиков, однако, вместо жёлтых 
                                                                                                                                         окуляров у них красные. Так как они вооружены дробовиком, то всегда будут стараться подбежать
                                                                                                                                          как можно ближе и вести бой на близкой дистанции.</p>
                </div>
                )
            }
        }