import React, {Component} from 'react';
import "./style.css"

export default class Sovet extends Component{
    render(){
        return(
                <div className='h'>
                        <h1>Советник Альянса</h1>
                                                                                                                        <p>Советники Альянса или (на языке вортигонтов) Шу’улатои — верховные представители власти Альянса на Земле и,
                                                                                                                             вероятнее всего, покровители всей организации. Служат главными антагонистами Half-Life 2 и последующих игр серии.</p>   
                                                                                                                                                                      <p>Советники по своему внешнему виду напоминают больших бледных личинок,
                                                                                                                                                                         оборудованных различными технологическими имплантами. Они не обладают 
                                                                                                                                                                         какими-либо отличительными чертами между собой: у них нет видимых глаз
                                                                                                                                                                          или, например, ушей. На лицевой стороне имеется специальный кибернетический
                                                                                                                                                                           окуляр. Каждый Советник снабжён специальным обтягивающим костюмом-оболочкой,
                                                                                                                                                                            который охватывает все участки тела, кроме головы. В некоторых местах имеются
                                                                                                                                                                             металлические воротники с неизвестными золотыми символами. Также Советники 
                                                                                                                                                                             снабжены механическими конечностями, используемыми для захвата каких-либо
                                                                                                                                                                              предметов или существ. В Half-Life 2: Episode Two можно наблюдать сцену,
                                                                                                                                                                               как Советник хватает человека и протыкает языком голову, чтобы считать 
                                                                                                                                                                               информацию.

Хотя их психические и умственные способности и разрушительны, они кажутся довольно уязвимыми физически, по крайней мере в их «личиночных» формах. Помимо двух механических рук и язычкового придатка, у них нет никаких средств физического взаимодействия 
с окружающей средой и каких-либо опасностей, с которыми они сталкиваются. Их костюмы, похоже, не обеспечивают никакой брони. Советник с легкостью был оттолкнут Псом в ​​физическом бою, а другой ранен обычным оружием. Исходя из этого, они скорее наблюдают, чем напрямую вмешиваются во время своих появлений.

В нормальных условиях Советники находятся в капсулах жизнеобеспечения в Цитадели, передавая команды Брину и управляя Альянсом через него. Скорее всего, ни один из граждан Сити 17 не знает об их существовании. Однако вортигонты, похоже, в курсе о них и даже боятся.

Во время событий Half-Life 2 можно наблюдать сцену, как Брин просит Советников, чтобы те эвакуировали его, аргументируя, что он еще нужен им. После смерти Брина Советники непосредственно перешли к управлению Альянсом на Земле. В Half-Life 2: Episode One они начинают эвакуацию из Цитадели, оставляя там солдат Альянса, чтобы те уничтожили реактор тёмной энергии. После эвакуации Советники перестали пользоваться жизнеобеспечением и, по словам вортигонтов, начали «вылупляться». В Episode Two, Аликс и Гордон попытались уничтожить одного Советника путем отключения его от системы жизнеобеспечения. Но процесс адаптации уже завершился, и отключение никак не повлияло на самого Советника. В процессе продвижения в игре Советников часто можно видеть на различных мониторах. Это связано с тем, что Аликс украла важные данные из Цитадели, и они хотят вернуть их обратно.

Во время событий Half-Life: Alyx, Аликс и Расселу удается остановить поезд-бритву, заставив его свернуть в тупик. В поисках Илая Вэнса, внутри вагона они сталкиваются с тремя мертвыми Советниками. Их вид удивляет Рассела, поскольку он никогда не видел ничего подобного. Аликс быстро покидает вагон, чтобы продолжить поиски, так что у Рассела было мало времени, чтобы разглядеть их.

Ближе к концу Half-Life: Alyx можно увидеть сцену, где неизвестная женщина спорит с Советником о переправке G-Man'а в другое место, пока до него не добралась Аликс. Это может значить, что для властей Альянса отдельные представители человечества имеют очень важную ценность, и они готовы соглашаться с их мнением.</p>

                </div>
                )
            }
        }