import React, {Component} from 'react';
import "./style.css"

export default class Stalker extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Сталкер</h1>
                                                                                                                                                            <p>Сталкер — кардинально изменённый физически и умственно человек, продукт крайне жестокой
                                                                                                                                                                 техно-биологической инженерии Альянса.</p>
                                                                                                                                                                 <p>Процесс трансформации в сталкеров проводится в Нова Проспект, где учёные Альянса удаляют высшие
                                                                                                                                                                     функции мозга, а потом проводят с лоботомированной жертвой «ужасные и извращённые» эксперименты
                                                                                                                                                                      и вживляют в кожу наноустройства, «медленно наблюдая, как жертва теряет всю человечность». Как
                                                                                                                                                                       результат, внешность и поведение сильно отличаются от человеческих.

У сталкера серое, гладкое, истощённое тело практически без мышц и жира. Предплечья и голени ампутированы и заменены на металлические протезы для снижения подвижности. Половые органы, уши и нос также ампутируются. С целью максимальной зависимости от Альянса
 желудочно-кишечный тракт сталкеров удаляется, в результате чего они выживают лишь благодаря питательным растворам, поставляемым Альянсом, о чём говорят специальные питательные порты по бокам. Сталкеры не могут говорить, но могут хрипеть и кричать, что указывает
  на отсутствие у них гортани. Судя по всему, они имеют высокую сопротивляемость радиации, так как работают даже рядом с радиоактивным ядром Цитадели.

Сталкеры передвигаются, сгорбившись, медленно, во время ходьбы их руки покачиваются перед ними. Во время работы они бездумно концентрируются на своей задаче. Они имеют небольшие пластины на шарнирах рядом с "глазами", которые могут закрываться на период
 бездействия сталкера. Так, Half-Life 2: Episode One во время поездки в поезде у них эти пластины закрыты, пока сталкеры находятся в транспортировочных контейнерах. После аварии поезда пластины открываются, активируя сталкера. На голове у них установлен 
 лазер, который они способны применять для починки техники Альянса и для самообороны. Лазер способен уничтожить энергетический шар.

По-видимому, повстанцы полностью понимают, кто такие сталкеры, а также как и где их производят. Аликс Вэнс очевидно расстроена их судьбой и убивает их с неохотой, в Episode One она объясняет Гордону их происхождение. Она говорит о Нова Проспект:
 «Когда-то это была тюрьма строгого режима... Сейчас кое-что похуже». Барни рассказывает Кляйнеру об их с Фрименом встрече: «Он чуть не сел на экспресс до Нова Проспект». Помимо этого можно услышать, как повстанцы говорят: «Из меня сталкера не сделать!»</p>
                </div>
                )
            }
        }