import React, {Component} from 'react';
import "./style.css"

export default class Strazh extends Component{
    render(){
        return(
                <div className='h'>
                            <h1>Страж муравьиных львов</h1>
          <p>Страж муравьиных львов — наиболее большой и сильный вид муравьиных львов, являющийся очень грозным противником.
             В колонии муравьиных львов, стражи охраняют входы в гнёзда, а также защищают прилегающие территории на поверхности.
              Вортигонты также могут собирать с убитых стражей приманки.</p>
                </div>
                )
            }
        }