import React, {Component} from 'react';
import "./style.css"

export default class Strider extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Страйдер</h1>    
                                                                                                                                                                         <p>Страйдер (англ. Strider) — тяжелобронированный боевой синтет, впервые появившийся в Half-Life 2 
                                                                                                                                                                            и часто выступающий в роли мини-босса.</p>           
                                                                                                                                                                            <p>Тело страйдера — коричневого цвета, похоже на туловище жука и смонтировано на трёх сочленённых ногах.
                                                                                                                                                                                 На "носу" у него установлена вращающаяся импульсная турель, а непосредственно под телом подвешено
                                                                                                                                                                                  большое орудие. Страйдер является основной тяжело бронированной штурмовой единицей Альянса.

Пулемётная импульсная турель страйдера, как правило, служит для уничтожения пехоты, в то время, как аннигилятор пространства применяется против более крупных объектов. В игре главный калибр используется только в соответствии со скриптами, однако в любом случае убивает и 
дезинтегрирует любые цели, в том числе и игрока с одного выстрела. Три длинных ноги страйдера увенчаны внизу острыми шипами, служащими для пронзания близких целей и очистки дороги от мусора. При нанизывании членов сопротивления на шипы, синтеты через некоторое время стряхивают
 их с ног, проявляя при этом некоторую брезгливость. Это даёт основание полагать, что страйдеры наделены полноценным разумом, хотя официально это никак не подтверждено. Любые незакреплённые препятствия, например остовы машин, страйдерами на пути даже не замечаются, поскольку откидываются ногами никак не влияя на скорость боевой единицы.

Во время прогулки или атаки, страйдеры громко топают и издают множество характерных для синтетов электронных звуков – рычание, стоны, вопли, а когда их убивают, они издают печальный стон. Кроме того, при повреждении верхних бронепластин из страйдера будет вытекать жёлто-коричневая 
субстанция. Также, у страйдеров имеется мозговой блок, очень похожий на синий человеческий мозг со светящимися точками. Однако, не смотря на всю схожесть, орган может быть подобран Грави-Пушкой. Это указывает на преобладание, если не полное использование неорганической материи в управляющем блоке.</p>
                </div>
                )
            }
        }