import React, {Component} from 'react';
import "./style.css"

export default class Transport extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Транспортёр Альянса</h1>
                                                                                                                                                            <p>Транспортёр, именуемый повстанцами как транспортник — многоцелевой тяжелобронированный 
                                                                                                                                                                синтет, транспорт вертикального взлёта и посадки с отделяемым грузопассажирским контейнером,
                                                                                                                                                                 предназначенный для быстрой переброски сил Альянса в горячие точки.</p>
                                                                                                                                                                 <p>Передние и две задних пары "ног" содержат двигатели, которые поднимают транспортёр и приводят
                                                                                                                                                                     его в движение. Передние две ноги также содержат выдвижные крылья для маневрирования. Средние
                                                                                                                                                                      четыре ноги заканчиваются присосками для удержания различных грузов.

Сами по себе транспортёры не имеют оружия и, как следствие, не нападают на игрока. Тем не менее, транспортировочные контейнеры, перевозимые транспортёрами, вооружаются спереди импульсной турелью, предназначенной для подавления любого сопротивления в зоне высадки.</p>
                </div>
                )
            }
        }