import React, {Component} from 'react';
import "./style.css"

export default class Trooper extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Штурмовик Альянса</h1>
                                                                                                                                        <p>Штурмовик — воздушный синтет Альянса, имеющий свойства боевого вертолёта и все его воздушные качества.</p>
                                                                                                                                        <p>Штурмовик по своей конструкции напоминает насекомое и ракообразное, состоящее из трех разных по размеру 
                                                                                                                                            и обособленных сегментов. Летает с помощью двойных разнонаправленных реактивных двигателей и ротора с 
                                                                                                                                            5 прозрачными и сетчатыми, как у стрекозы, крыльями, который заключен в округлую раму (фенестрон) в 
                                                                                                                                            задней части синтета. Ластообразные приспособления, вероятнее всего, служат для планирования и поворотов.
                                                                                                                                             Судя по всему, имеет две пары сине-фиолетовых фасеточных глаз — одни большие по бокам по центру и маленькие
                                                                                                                                              в передней части второго сегмента тела. Вооружение включает в себя носовую скорострельную импульсную пушку,
                                                                                                                                               и аннигилятор, который находится снизу синтета перед реактивными двигателями (но в игре это оружие ни разу
                                                                                                                                                не используется. По идее, действовать аннигилятор должен был, как световой луч транспорта пришельцев из
                                                                                                                                                 предыдущих частей). Как и все тяжело бронированные синтеты Альянса, штурмовик неуязвим для обычного
                                                                                                                                                  стрелкового оружия и может быть уничтожен только разрывным снарядом, например ракетой РПГ.

Несмотря на то, что штурмовик не имеет ракет и бомб, которые сбрасывает вертолёт-охотник, он превосходит его по манёвренности и точности ведения огня.</p>
                </div>
                )
            }
        }