import React, {Component} from 'react';
import "./style.css"

export default class Worm extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Пиявка</h1>       
                                                                                                             <p>Пиявки выглядят как маленькие, похожие на рыб существа, основанные на земных медицинских пиявках. Обычно они белого цвета.

Во время каскадного резонанса пиявки телепортировались на Землю и заселили океаны. Они стали причиной вымирания большого числа морской фауны Земли. В самом деле это единственные морские существа, которых можно встретить в море, однако,
 видимо, существует небольшое количество крабов. Некоторые земные существа обитают во внутренних водоёмах, в таких местах можно услышать насекомых и лягушек. В то время как пиявок можно заметить в пресноводных водоёмах, ихтиозавры по-видимому также обитают в пресной воде.</p> 
                </div>
                )
            }
        }