import React, {Component} from 'react';
import "./style.css"


export default class Zombien extends Component{
    render(){
        return(
                <div className='h'>
                        <h1>Зомбайн</h1>  
                                                                                                                <p>Зомбайн (словослияние, придуманное Аликс Вэнс и образованное двумя словами — «Комбайн» и «зомби»)
                                                                                                                     — результат влияния обыкновенного хедкраба на солдата Патруля Альянса.

Появление зомбайнов лишний раз доказывает, что Альянс потерял контроль над ситуацией в Сити 17, после того как Фримен частично успокаивает ядро Цитадели. До восстания, хедкрабов можно было заметить лишь в 
пришедших в негодность частях города, однако, с использованием Альянсом крабснарядов против укрытий мятежников, хедкрабы поразили значительные территории, особенно подземелья.

Первый раз зомбайн встречается в Half-Life 2: Episode One в главе «Обездоленные», когда Гордон Фримен и Аликс Вэнс наткнулись на потерпевший аварию военный состав в подземельях Сити 17.</p>   
                                                                                                      <p>Обычно, встречается вместе с другими зомби. Зомбайн медленнее средних зомби, но способен совершать рывок, который позволяет ему быстро навалиться на добычу.

Как и обычный зомби, зомбайн будет пытаться атаковать когтями, но, при необходимости, он сможет достать гранату и начать атаку в стиле камикадзе, пока не взорвётся граната, убивая зомби и нанося ощутимый урон игроку. Однако, игроки с хорошей реакцией могут отхватить его гранату с помощью гравитационной пушки и использовать её против него же.

Вполне вероятно, что хедкраб осознано выбрал солдата Патруля как носителя, благодаря его высокой стойкости и гранатам про запас, по сравнению с обычными людьми. Здоровье зомбайна больше обычного зомби из-за относительно нетронутого бронежилета, вдобавок к способности хедкрабов повышать стойкость их носителя. Также стоит отметить, что бронежилет зомбайна окрашен иначе, чем у солдата Патруля (см. раздел «Интересные факты»), и отсутствуют некоторые части одежды, однако это можно объяснить мутацией после присоединения хедкраба и размазанной кровью.

Стоны зомбайна фильтруются через вокодер солдата. Его речь состоит не только из рычания зомби, но и из отчётов Солдата Патруля, такие как "Necrotics inbound" (Прибывают мертвецы) или "Sector is not secure" (Сектор опасен). Также зомбайн может сказать такие фразы, как "Contact" (Контакт), "Biotic over-run" (Биотическое превышение) и "Infestation" (Заражение). Это может быть признаком того, что солдат осознаёт все признаки заражения и в силу подавленного чувства боли может говорить и пытается предупредить ближайших солдат об угрозе (в пользу этого суждения также выступает то, что использовав гранату, зомбайн также убивает хедкраба у себя на голове), или это всё, что он успел сказать, подвергнувшись атаке хедкраба.

Стоит заметить, что, если оторвать хедкраба с головы зомбайна, то у второго от головы останется только нижняя челюсть и небольшая нижняя часть черепа. Это объясняется тем, что хедкрабы прилагают больше усилий для пробития шлема солдата, и, соответственно, сильнее вгрызаются в шею, повреждая её. При отделении хедкраба также отрывается и голова (однако, в игре модели головы зомбайна нет).

Ещё одним интересным фактом о зомбайнах является то, что их можно разрезать пополам, в то время как обычного солдата — нет. Это может быть связано с мутацией мышечных тканей (которые не были заменены Альянсом), что привело к их деградации.

Зомбайны состоят только из одного вида, от обычного хедкраба. Вполне возможно, что быстрые или ядовитые хедкрабы не могут слиться с Солдатами Патруля по биологическим причинам, или они просто не были запланированы в этом плане.</p> 
                </div>
                )
            }
        }