import React, {Component} from 'react';
import "./style.css"

export default class Zombie extends Component{
    render(){
        return(
                <div className='h'>
                     <h1>Обыкновенный зомби</h1> 
                                                    <p>Это самый распространённый вид зомби, встречающийся во всех играх серии, но при этом 
                                                        самый слабый. У заражённых разорвана грудная клетка и брюшная полость. Этот разрыв
                                                         образует нечто похожее на рот, через который зомби может питаться: в Half-Life можно
                                                          встретить зомби, которые поедают трупы, используя рёбра для пережёвывания плоти.

На теле этого зомби, в отличие от других видов, хорошо сохранилась одежда: это объясняется тем, что обыкновенный хедкраб не слишком требователен
 к своему телу. Заражённый хедкрабом человек перемещается довольно медленно и очень неуклюже, постоянно издавая множество разнообразных звуков:
  от хрипов до криков. Очень часто этих зомби можно найти спящими в разных укромных местах; таким образом хедкраб медленно разъедает зомби, при
   этом сохраняя его дольше.

Единственная атака обыкновенного зомби — это удар когтями, он не имеет каких-либо способностей. Если убить зомби, не повредив при этом хедкраба,
 то тот может спрыгнуть с тела и жить дальше. Зомби достаточно глупы: например, в Half-Life 2 они легко попадаются в ловушки отца Григория. 
 Однако, они могут различать такие препятствия, как бочки и ящики, и даже швырять их в игрока (если нет препятствий и если игрок не увернулся,
  зомби легко могут попасть в него).</p>       
                </div>
                )
            }
        }