import React, {Component} from 'react';
import "./table.css";
import Page11 from "./C2a4e_lobby.jpg";
import Page12 from "./Cliffs_HECU.jpg";
import Page13 from "./C3a1b_cannon.jpg";
import Page14 from "./LambdaTeleportationSystem.jpg";
import Page15 from "./Xen_(Half-Life).jpg";
import Page16 from "./Gonarch_first.jpg";
import Page17 from "./Alien_grunt_factory_first.jpg";
import Page18 from "./C4a3_nihilanth01.jpg";
import Page19 from "./Gman.jpg"

export default class Lore extends Component{
    render(){
        return(
            <div>
              <img src="https://cdn.mos.cms.futurecdn.net/pgxdwFHGpjeLrhDga6WNLV.jpg" className='img'></img>
            <h1>Глава 1: Прибытие в Черную Мезу</h1>
                                    <p>
                                    В 8:47 Гордон Фримен едет на поезде к подземным лабораториям; возможно, он осознает, что окружающая обстановка - затишье перед бурей. Система объявлений рассказывает последние новости, оставляя ироничные комментарии об опасных веществах, в то время как поезд проходит над бассейнами с радиоактивной жидкостью. Из окон поезда Гордон видит готовые к транспортировке до места запуска ракеты. Проезжая мимо поста охраны, Гордон видит Барни Калхуна, который не может попасть внутрь.

Во время поездки Гордон впервые видит в вагоне соседнего монорельса человека в синем костюме. Наконец, поезд достигает пункта назначения, Гордона встречает охранник и пропускает его в испытательный комплекс.
                                    </p>
                                    <img src="https://gamingda.files.wordpress.com/2011/07/hl1.jpg?w=584" className='img'></img>
                                    <h1>Глава 2: Аномальные материалы</h1>
                                    <p>Прибыв в сектор С, Гордон сразу же узнаёт о проблемах с оборудованием, однако никто
                                         не обращает на это особого внимания. Фримен следует в раздевалку, где последним 
                                         облачается в свой костюм HEV (Джина Кросс и Колетт Грин уже забрали свои костюмы
                                          со стенда), после чего Гордон спускается вниз, в лаборатории, на встречу с группой 
                                          ученых, проводящих эксперимент. Они сообщают, что имеют в наличии уникальный крупный
                                           образец, однако на этот раз требуется аппаратура с большим разрешением. Спустившись
                                            на уровень ниже, Фримен попадает в помещение, примыкающее к тестовой камере. Двое
                                             учёных, ожидающих Гордона, говорят, что этот образец самый чистый и, потенциально,
                                              самый нестабильный. Убедив друг друга, что всё будет хорошо, они впускают Фримена внутрь.

                                            Следуя стандартной процедуре, Гордон Фримен поднимается по лестнице на 
                                            балкон и включает роторы Анти-масс спектрометра, и учёные разгоняют
                                             его до запланированного уровня. Обнаруживается, что конденсаторы перегружены
                                              на пять процентов, но на это закрывают глаза, считая это нормой. К
                                               этому времени в камеру прибывает образец, и Гордон вводит его в луч
                                                Анти-масс спектрометра.

                                            В этот момент происходит
                                             непредвиденный Каскадный резонанс.
                                              Из масс-спектрометра в стены камеры 
                                              начинают бить зелёные лучи, раздаются
                                               звуки взрывов и крики учёных. Перед
                                                глазами Гордона мелькают чёрные и 
                                                зелёные вспышки. На мгновение он снова оказывается
                                                 в камере, после чего его два раза переносит в какое-то неизвестное место,
                                                  населённое необычными формами жизни. Затем Гордон снова оказывается в тестовой 
                                                  
                                                  камере, где в результате опыта обрушивается потолок.</p>
                                                  <img src="https://cdn.cloudflare.steamstatic.com/half-life.com/images/halflife/halflife_3.jpg" className='img'></img>
                                                  <h1>Глава 3: Непредвиденные последствия</h1>
                                                  <p>Выбравшись из камеры, Гордон понимает, что его проблемы только начинаются.
                                                     Помещения Чёрной Мезы разваливаются на глазах, неизвестные существа телепортируются
                                                      прямо из воздуха, связь не работает. Подобрав с пола монтировку, Гордон начинает
                                                       выбираться из комплекса.

                                                    Он встречает двоих учёных, у которых ранее взорвался компьютер, и один из них отправляет
                                                     его на поверхность за помощью. Чёрная Меза получила серьёзные повреждения, но, что ещё
                                                      хуже, множество пришельцев из Зена, пограничного мира, начинают массово телепортироваться 
                                                      в научно-исследовательский комплекс. Все они быстро адаптируются к окружающим условиям и 
                                                      ведут себя агрессивно.

                                                    Шлюзовую дверь к монорельсу заклинило, но Фримен может открыть ее, разбив монтировкой панель 
                                                    доступа. При попытке подойти к учёному, который стоит на мостике, ведущему к монорельсу, все 
                                                    рушится, и обломки падают вниз вместе с учёным. Поскольку транспортная система повреждена,
                                                     Гордону приходится пройти через центр хранения охладителей, чтобы найти выход.

                                                    Кроме того, как ни странно, за Фрименом начинает наблюдать странный человек в костюме, всегда 
                                                    находящийся вне зоны досягаемости и исчезающий прежде, чем до него можно добраться. В этой 
                                                    главе он появляется в комнате с хаундаями, наблюдая за Фрименом с высокого мостика вдоль 
                                                    стены. Когда Гордон прибывает на то же место, оказывается, что человек бесследно исчез из
                                                     глухого тупика, в конце которого зомби поедает мёртвого учёного.</p>
                                                     <img src="https://i.ytimg.com/vi/Fy0T2cTkGgs/maxresdefault.jpg" className='img'></img>
                                                     <h1>Глава 4: Офисный комплекс</h1>
                                                     <p>Вскоре Гордон прибывает в офисный комплекс, где несколько выживших учёных забаррикадировались
                                                        в своих кабинетах, защищаясь от появляющихся из ниоткуда пришельцев. От них Фримен узнаёт,
                                                         что по слухам в Чёрную Мезу прибыли военные для спасения учёных и персонала.

                                                    И снова здесь появляется загадочный человек в синем костюме. Он некоторое время смотрит на
                                                     Фримена через стекло запертой двери, затем поправляет галстук и уходит.</p>
                                                     <img src="https://www.iphones.ru/wp-content/uploads/2013/01/hl-steam-3.jpg" className='img'></img>
                                                     <h1>Глава 5: «У нас враги» </h1>
                                                     <p>В этой главе Гордон достигает значительного прогресса в поиске выхода на поверхность,
                                                         проходя через различные помещения и ловушки. Он узнаёт, что военный спасательный отряд
                                                          уже прибыл, но когда пытается выйти с ними на контакт, становится свидетелем убийства
                                                           учёного морпехом. Так Фримен осознаёт, что задачей военных является уничтожение не 
                                                           только пришельцев, но и всех следов эксперимента и всех лиц, причастных к проекту,
                                                            включая свидетелей. Человек в синем костюме тоже здесь, но создаётся такое впечатление,
                                                             что военные его не замечают или вообще не знают о его существовании.

                                                        Фримен выбирается на поверхность, но обнаруживает, что территория находится полностью под 
                                                        контролем военных. Высадка десанта и начавшаяся бомбардировка вынуждает его искать другой
                                                         путь, в недрах комплекса. Встреченный Гордоном учёный сообщает ему, что выжившие учёные 
                                                         комплекса «Лямбда» в состоянии закрыть межпространственные порталы. Транспортная система 
                                                         не работает, однако можно попробовать добраться туда по старой монорельсовой дороге. Фримену
                                                          предстоит долгое путешествие через недра Чёрной Мезы.</p>
                                      <img src="https://i.ytimg.com/vi/M1x-fFf6Y9M/maxresdefault.jpg" className='img'>
                                        </img>                    
                                        <h1>Глава 6: Ракетная шахта</h1>
                                                          <p>Гордон Фримен попадает в заброшенную часть Чёрной Мезы, ранее использующуюся для испытания
                                                             ракетных двигателей, а сейчас - для хранения радиоактивных отходов. Здесь Фримен сталкивается
                                                              с новым смертельным врагом, Тентаклом. Чтобы его уничтожить, Гордону приходится восстановить
                                                               подачу электричества и топлива в ракетный двигатель, расположенный под потолком тестовой 
                                                               камеры, чтобы направленным потоком пламени выжечь существо. Через яму, прорытую тентаклом,
                                                                оказывается возможным пробраться в тоннели для слива радиоактивных отходов.</p>
                                                                
                                                                <img src="https://i.ytimg.com/vi/9rP9kTi5Nk4/mqdefault.jpg" className='img'></img>
                                                                <h1>Глава 7: Включить энергию</h1>
                                                                <p>Пытаясь снова выбраться на поверхность, Фримен становится свидетелем сражения между 
                                                                    солдатами HECU и Гаргантюа в секторе Е. Ещё одним свидетелем является человек в синем костюме,
                                                                     наблюдающий за происходящим из окна диспетчерской.

                                                                Воспользовавшись суматохой, Гордон пересекает главный зал и достигает диспетчерской, которая
                                                                 оказывается заколочена снаружи. Внутри он находит раненного охранника, который сообщает, что
                                                                  для включения монорельса необходимо подать на него электричество. Фримен вынужден спуститься
                                                                   в подземелья, кишащие хаундаями, и восстановить работу генератора. Прежде чем начать путь по
                                                                    монорельсу, Гордон заманивает Гаргантюа в ловушку между огромными разрядниками.

                                                                    Что характерно, охранник в диспетчерской не делает абсолютно никаких упоминаний о 
                                                                    человеке в синем костюме.</p>
                                                                    <img src="https://i.ytimg.com/vi/kdoRrRC3kSc/maxresdefault.jpg" className='img'></img>
                                                                    <h1>Глава 8: По рельсам</h1>
                                                                    <p>Гордон Фримен едет по монорельсу грузотранспортной системы Чёрной Мезы. Встреченный 
                                                                        охранник передает Гордону послание от одного из учёных: в пусковых шахтах Высотного
                                                                         центра запуска находится спутник, который поможет команде "Лямбда" ликвидировать 
                                                                         последствия каскадного резонанса. Гордону необходимо добраться до пусковых шахт
                                                                          и запустить этот спутник. Углубляясь в подземелья транспортной системы, Фримен
                                                                           обнаруживает настоящую ненависть солдат HECU к нему, а также множество укреплений
                                                                            из мешков с песком, снайперских позиций и бункеров со скорострельными пулемётами
                                                                             и даже ракетными установками. Переключаясь между ветками монорельса, он вскоре 
                                                                             выбирается на поверхность, где уже наступила ночь. На стартовой площадке он 
                                                                             запускает спутник, после чего Фримену снова приходится уйти под землю.</p>
                                                                            <img src="https://i.ytimg.com/vi/gGzYF9lBlsU/mqdefault.jpg" className='img'></img>
                                                                             <h1>Глава 9: Мрачные предчувствия </h1>
                                                                             <p>После того, как поездка по монорельсу резко обрывается вмешательством военных,
                                                                                 заминировавших пути, Гордон выбирается через лабораторию, в которой, по всей
                                                                                  вероятности, исследовалось одно из существ пограничного мира - Ихтиозавр.
                                                                                   Один из исследователей, находящийся в аппаратной над бассейном, сообщает,
                                                                                    что против ихтиозавра может помочь транквилизатор. Арбалет с транквилизатором 
                                                                                    находится в клетке, которая висит прямо над бассейном с существом. К несчастью,
                                                                                     клетка не выдерживает веса Фримена в костюме и обрушивается в воду, где Гордону 
                                                                                     приходится быстро расправиться с монстром.

                                                                                    Покинув лабораторию, Гордон попадает в большой зал с промышленными поршнями,
                                                                                     в дальнем конце которого видно загадочного человека в синем костюме, уходящего
                                                                                      в направлении, которое приведет Гордона к нескольким враждебным пришельцам и
                                                                                       солдатам. Человек в синем костюме в очередной раз бесследно исчез.

                                                                                    После сражения с Чёрными Оперативниками (ещё одним "спасательным отрядом", уничтожающим
                                                                                     даже морпехов HECU), Гордон попадает в засаду военных, которые его оглушают и, недолго
                                                                                      думая, решают ликвидировать Фримена, оставив его в уплотнителе для мусора. К счастью,
                                                                                       Гордону удаётся выбраться из уплотнителя через вентиляцию.</p>
                                                                                     
                                                                                       <img src="https://cdn.wikimg.net/en/strategywiki/images/thumb/c/c0/HL_RP_Screenshot_1.png/300px-HL_RP_Screenshot_1.png" className='img'></img>
                                                                                      <h1>Глава 10: Переработка отходов</h1> 
                                                                                      <p>После побега из уплотнителя, Гордон обнаруживает, что единственный путь выбраться 
                                                                                        из комплекса - это пройти через пустующий комплекс по переработке отходов. Поскольку 
                                                                                        комплекс работает автономно и все двери заперты, единственным выходом остаются 
                                                                                        конвейерные ленты, связанные с другими частями Чёрной Мезы. Прессы, уплотнители
                                                                                         отходов, чаны с радиоактивной жидкостью, печи для сжигания мусора становятся 
                                                                                         смертельными ловушками. Однако Гордону удаётся успешно их миновать, после чего он
                                                                                          попадает в секретные лаборатории.</p>
                                                                                          <img src={Page11} className='img'></img>
                                                                                          <h1>Глава 11: Сомнительная этика</h1>
                                                                                          <p>В лабораториях Гордон обнаруживает, что здесь учёными проводились исследования 
                                                                                            существ из Зена ещё задолго до инцидента. Одним из самых опасных существ оказывается
                                                                                             пехотинец пришельцев, бронированный монстр, вооружённый биологической пушкой. На
                                                                                              верхних этажах лабораторий Гордон находит прототип Тау-пушки - разрушительного 
                                                                                              оружия, уничтожившего двух испытателей во время тестов (по всей вероятности,
                                                                                               взрыв произошёл от перегрузки тау-пушки в режиме альтернативного огня, о чём 
                                                                                               свидетельствуют переговоры испытателей в лаборатории непосредственно перед взрывом).
                                                                                                Там же Фримен активирует 4 лазерных установки, которые подают энергию на лазерный
                                                                                                 излучатель, достаточно мощный, чтобы разрушить стену за ограждающим щитом. Через 
                                                                                                 образовавшийся проход Гордон спускается на нижний этаж и находит троих учёных, 
                                                                                                 которые помогают ему покинуть комплекс, открыв двери с помощью устройства считывания
                                                                                                  сетчатки глаз. Напоследок они предупреждают Фримена о настоящей войне, происходящей
                                                                                                   снаружи комплекса.</p>
                                                                                                  <img src={Page12} className="img"></img>
                                                                                                   <h1>Глава 12: Поверхностное натяжение</h1>
                                                                                                   <p>Гордон Фримен вновь выходит на поверхность. Однако там дела действительно даже
                                                                                                     хуже, чем внутри - поверхность стала полем битвы между пришельцами и военными,
                                                                                                      причём солдаты HECU проигрывают. Морпехи вызывают подкрепления, но этого всё 
                                                                                                      равно недостаточно. Гордону приходиться обогнуть часть территории комплекса по
                                                                                                       внешним скалам каньона, забираясь всё выше. Наконец он находит относительно
                                                                                                        безопасное место под землёй.</p>
                                                                                                        <img src={Page13} className='img'></img>
                                                                                                        <h1>Глава 13: «Забудьте о Фримене!»</h1>
                                                                                                        <p>Военные начинают эвакуацию, осознав, что они проигрывают сражение против пришельцев,
                                                                                                             а Фримена ликвидировать так и не удалось. Чёрная Меза подвергается массированной
                                                                                                              бомбардировке с воздуха для прикрытия отступления. Между тем Гордон спускается 
                                                                                                              в подземное хранилище, чтобы спрятаться от бомбардировок, где переходит подземные 
                                                                                                              водные каналы, стараясь не столкнуться с врагами, и в итоге выбирается на поверхность
                                                                                                               ко входу в комплекс "Лямбда". Уничтожив танк Abrams, блокирующий вход, Фримен спускается 
                                                                                                               в комплекс "Лямбда".</p>
                                                                                                               <img src={Page14} className='img'></img>
                                                                                                               <h1>Глава 14: Ядро Лямбды</h1>
                                                                                                               <p>Гордон Фримен прибывает в комплекс "Лямбда", где обнаруживает команду учёных, спрятавшихся
                                                                                                                 от пришельцев из пограничного мира Зен, поскольку большая часть территории комплекса уже захвачена ими.
                                                                                                                  Фримену сообщают, что он должен попасть в лаборатории телепортации, но для этого необходимо затопить
                                                                                                                   активную зону реактора.

                                                                                                                Продвигаясь по комплексу, Гордон в очередной раз может заметить человека в синем костюме, который стоит в противоположном 
                                                                                                                конце пустого зала, кишащего хедкрабами. Бросив короткий взгляд на Фримена, человек исчезает 
                                                                                                                в светящемся портале. Использованием порталов можно объяснить его возникновение в различных частях Чёрной Мезы, равно
                                                                                                                 как и загадочное исчезновение из мест, не предусматривающих иного выхода.

                                                                                                                Пройдя через лабораторию телепортации и на собственном опыте испытав работу портальной системы, Фримен 
                                                                                                                присоединяется к команде учёных. Он узнает, что атака пришельцев не просто случайный инцидент, а одна большая
                                                                                                                 наступательная операция. Остановить её невозможно, поскольку какое-то могущественное существо из пограничного 
                                                                                                                 измерения не даёт закрыть межпространственные порталы. Единственный способ закрыть порталы - устранить существо
                                                                                                                  непосредственно в пограничном мире.

                                                                                                                Эту задачу возлагают на Гордона Фримена. Ему предоставляют всё необходимое снаряжение, а также специальный модуль
                                                                                                                 длинных прыжков для костюма HEV, который должен помочь в перемещении по миру Зен. Во время подготовки телепортации 
                                                                                                                 Фримена на Зен, в лабораторию начинают проникать неизвестные летающие существа. Несмотря на сложные условия, Гордону
                                                                                                                  удается телепортироваться в пограничный мир.</p>
                                                                                                                  <img src={Page15} className='img'></img>
                                                                                                                  <h1>Глава 15: Зен</h1>
                                                                                                                  <p>Гордон Фримен прибывает в пограничный мир Зен. Здесь он встречает множество пришельцев в их естественной 
                                                                                                                    среде обитания, а также находит останки нескольких исследователей Чёрной Мезы в HEV-костюмах. Перемещаясь
                                                                                                                     между парящими островами с помощью модуля длинных прыжков, Гордон открывает для себя регенеративные свойства
                                                                                                                      воды Зена. Пробравшись внутрь одного из островов, Фримен активирует естественный портал пограничного измерения.</p>
                                                                                                                      <img src={Page16} className='img'></img>
                                                                                                                      <h1>Глава 16: Логово гонарха</h1>
                                                                                                                      <p>Портал переносит Фримена в логово одного из самых опасных обитателей Зена - гонарха. Все тело гонарха покрыто
                                                                                                                         панцирем, уязвим лишь его кокон-мешок, который постоянно порождает толпы хедкрабов-детенышей. Расстреливая 
                                                                                                                         существо издалека и из мест, куда гонарх не может пробраться из-за своих размеров, Гордон заставляет его 
                                                                                                                         отступить. Гонарх убегает, пробивая себе путь сквозь стены и огромные паутины. После очередной атаки на гонарха,
                                                                                                                          тот падает в огромную яму, где Фримен добивает его. Мешок монстра лопается, заливая все вокруг кислотой, которая 
                                                                                                                          прожигает дыру, ведущую к телепорту в комплекс по клонированию солдат Зена.</p>
                                                                                                                          <img src={Page17} className='img'></img>
                                                                                                                          <h1>Глава 17: Нарушитель</h1>
                                                                                                                          <p>Гордон Фримен, изрядно потрепанный после сражения с гонархом, телепортируется на фабрику Зена. Он обнаруживает,
                                                                                                                             что вортигонты, обслуживающие комплекс, ведут себя мирно, если их не трогать (однако не перестают подозрительно
                                                                                                                              наблюдать за каждым движением Фримена). Пробираться по территории комплекса приходится осторожно, поскольку 
                                                                                                                              любой случайный выстрел может разрушить капсулы, в которых находятся пехотинцы пришельцев.

                                                                                                                        Передвигаясь по территории завода, используя странного вида лифты и конвееры, Фримен добирается до телепорта,
                                                                                                                         который перебрасывает его к огромному алтарю, вблизи которого слышны голоса ученых: "Вытащите его оттуда! 
                                                                                                                         Выключите оборудование и кто-нибудь, вытащите его!"'. В момент каскадного резонанса один из ученых кричал 
                                                                                                                         эти слова. Кроме прочего, сам алтарь выглядит как искаженная и деформированная версия Анти-масс спектрометра.

                                                                                                                        Войдя в красный телепорт на алтаре, Гордон переносится в логово Нихиланта.</p>
                                                                                                                        <img src={Page18} className='img'></img>
                                                                                                                        <h1>Глава 18: Нихилант</h1>
                                                                                                                        <p>Гордон Фримен находит таинственное существо, не позволяющее закрыть межпространственные 
                                                                                                                            порталы. Нихилант - могучий обитатель Зена, способный атаковать большим количеством 
                                                                                                                            электрических сфер и призывать силой мысли местные порталы, через которые он призывает
                                                                                                                             помощников - вортигонтов и контроллеров - или же отправляет самого Гордона в места, 
                                                                                                                             где его поджидают враги. Нихилант может регенерировать повреждения своего тела с 
                                                                                                                             помощью жёлтых энергетических сфер, парящих вокруг него, пополняя запас энергии через
                                                                                                                              кристаллы, расположенные на стенах пещеры. Уничтожив кристаллы и пробив защитную 
                                                                                                                              оболочку головы Нихиланта, Гордон использует естественные трамплины, чтобы добраться
                                                                                                                               до ставшего уязвимым мозга существа и уничтожить его. Нихилант умирает, взлетая к 
                                                                                                                               потолку и взрывами обрушивая потолок своего логова. Последнее, что видит Гордон 
                                                                                                                               Фримен в обрушивающейся пещере - вспышка зелёного света, возникающая при телепортации.</p>
                                                                                                                               <img src={Page19} className='img'></img>
                                                                                                                               <h1>Конец игры</h1>
                                                                                                                               <p>Когда Гордон приходит в себя, он лицом к лицу встречается с таинственным
                                                                                                                                 человеком в синем костюме - G-Man'ом. Телепортируясь в различные места
                                                                                                                                  Зена, G-Man ведёт с Фрименом разговор:

                                                                    "Гордон Фримен во плоти, или, вернее сказать, в защитном костюме. Я взял на себя смелость освободить Вас от оружия, тем более, что большинство из него принадлежало правительству. Что касается костюма - я думаю, Вы его заслужили.
                                                                    Благодаря Вам в настоящее время пограничный мир - Зен - находится под нашим контролем. Какую отвратительную, грязную часть работы Вы проделали. Я впечатлён.
                                                                    Именно поэтому я здесь, Мистер Фримен. Я рекомендовал Ваши услуги моим... работодателям, и они уполномочили меня предложить Вам работу. Они согласны со мной, что Вы имеете безграничный потенциал."
                                                                    После последней телепортации Гордон оказывается в таком же вагончике, в котором он ехал в лаборатории Чёрной Мезы. Однако вагончик находится в чёрной пустоте, окружённый смазанными белыми вспышками, в обстановке, больше всего похожей на гиперпространство. G-Man предлагает Фримену последний выбор:

                                                                    "Вы показали, что можете принимать благоразумные решения, поэтому я думаю, что Вы не доставите особых проблем. Если Вы заинтересовались моим предложением - просто станьте в портал, что даст мне считать Ваш ответ положительным.
                                                                    В противном случае… Что ж… Я могу предложить Вам битву, в которой у Вас не будет шансов на победу. Это довольно... разочаровывающая перспектива, после всего того, что Вам пришлось пережить."
                                                                    Дверь вагончика открывается и за ней образуется небольшой портал. У Гордона есть немного времени на раздумья, прежде чем G-Man поторопит его:

                                                                    "Время выбирать... Пришло время выбирать."
                                                                    Если Гордон Фримен откажется от предложения G-Man'а и не войдёт в портал, дверь закроется и G-Man телепортирует Фримена в Зен, окружённого бесчисленным количеством чудовищ из пограничного мира, при этом с сожалением добавив:

                                                                    "Что ж, похоже, мы не будем работать вместе. Никаких сожалений, Мистер Фримен."
                                                                    Если Гордон Фримен соглашается на предложение G-Man'а и входит в портал, G-Man помещает Фримена в стазис, где тот ожидает своего возвращения в Сити 17 почти через 20 лет, добавляя:

"Мудрый выбор, мистер Фримен. До встречи..."</p>
                                                  </div>
        );
    }
}