import React, {Component} from 'react';
import "./style.css"

export default class Arb extends Component{
    render(){
        return(
                <div className='h'><h1>Арбалет</h1>
                <p>Арбалет — оружие дальнего действия в Half-Life. Единственный вид оружия в игре, оснащённый оптическим прицелом.</p>
                <p>Арбалет создан по принципу современных композитных луков — боеприпасы (болты) выпускаются в воздух за счёт ударно-спускового механизма,
                    подключённого к высоковольтному проводу. Скорость болтов существенно ниже скорости пуль, и поэтому времени на попадание в цель уходит больше.

Впервые игрок может взять арбалет в главе «Мрачные предчувствия», чтобы убить ихтиозавра. Повторно его можно подобрать в главе «Сомнительная этика» у мёртвого охранника.
При первом получении оружия учёный рассказывает о том, что арбалет использовали, как «транквилизирующее оружие». Костюм HEV же называет болты «нейротоксичными боеприпасами
для арбалета». Любопытно, что ихтиозавр после попадания начинает дёргаться, возможно — именно из-за действия нейропаралитика. Учёный не упомянул, должен ли болт оказывать
лишь транквилизирующее воздействие на жертву или поражать её насмерть.</p> </div>
                )
            }
        }