import React, {Component} from 'react';
import "./style.css"

export default class Armley extends Component{
    render(){
        return(
                <div className='h'> <h1>Рукоулей</h1>
                <p>Ручной улей, или рукоулей (англ. Hivehand) — органическое оружие из игры Half-Life, которое 
                    используют пехотинцы пришельцев и Гордон Фримен.</p>
                    <p>Это оружие, надеваемое на одну из рук, стреляет так называемыми «мухами» — похожими на насекомых
                         существами, которые сами ищут живую мишень и атакуют её. Мухи внутри улья постоянно воспроизводятся,
                          обеспечивая бесконечный боезапас. В отличие от других видов оружия, рукоулей нельзя подобрать с трупа.

В игре можно найти всего два таких «улья». Один находится в помещении, куда можно спуститься на лифте из ангара, заполненного минами. Второй можно найти 
в одном из помещений на уровне A в комплексе «Лямбда», прямо перед порталом. Оба рукоулья можно подобрать.</p></div>
                )
            }
        }