import React, {Component} from 'react';
import "./style.css"

export default class Glock extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>9-мм пистолет </h1>
                    <p>Glock 17, также известный как 9-мм пистолет — оружие из Half-Life и её дополнений. Основное оружие охранников Чёрной Мезы, 
                        одно из наиболее часто используемых оружий в серии. Оно может стрелять в полуавтоматическом и автоматическом режимах.</p>
                        <p>В Half-Life пистолет можно найти в главе «Непредвиденные последствия»: его можно забрать у убитого первого охранника или у умирающего охранника при покидании Лаборатории аномальных материалов. Повторно его можно подобрать в главе «Переработка отходов» у охранников, проглоченных барнаклами.</p>
                     </div>
                )
            }
        }