import React, {Component} from 'react';
import "./style.css"

export default class Gluon extends Component{
    render(){
        return(
                <div className='h'><h1>Глюонная пушка</h1>
                <p>Глюонная пушка (или квантовый дестабилизатор) — экспериментальное оружие, созданное одним из учёных Чёрной Мезы.</p>
                <p>Генерирует луч голубого цвета, расщепляющий на молекулы всякую органическую и неорганическую материю. Основной минус
                   данного оружия заключается в быстром истощении боеприпасов. Пушка состоит из ручного излучателя, прикреплённого при 
                   помощи толстого кабеля к рюкзаку.

Название глюонной пушки исходит от глюонов. Глюоны — это частицы, являющиеся посредниками в ядерном взаимодействии и держащие атомные ядра вместе. Глюонная пушка
стреляет потоками глюонов, или же вместо этого она сталкивает вместе уже присутствующие в объекте глюоны. В любом случае, оружие фундаментально воздействует на 
материю. В игре напряжения, вызванные этой реакцией, могут разорвать на куски практически любое живое существо.</p> </div>
                )
            }
        }