import React, {Component} from 'react';
import "./style.css"

export default class Granade1 extends Component{
    render(){
        return(
                <div className='h'><h1>Осколочная граната</h1>
                <p>Mk2 — американская ручная оборонительная граната, используемая солдатами HECU и чёрными
                     оперативниками во время Инцидента в Чёрной Мезе. Взрыв происходит через пять секунд 
                     после метания гранаты. Имеет средний радиус взрыва. Урон от взрыва пропорционален расстоянию 
                     до цели.</p> </div>
                )
            }
        }