import React, {Component} from 'react';
import "./style.css"

export default class Mine1 extends Component{
    render(){
        return(
                <div className='h'> <h1>Радиоуправляемая мина</h1>
                <p>Радиоуправляемая мина (фугас), или взрывпакет — взрывчатка, впервые появившаяся в 
                   Half-Life и дополнениях к ней. Взрывпакет намного превосходит по мощи гранату Mk2,
                    и может быть взорван с помощью специального дистанционного детонатора.</p>
                    <h1>Лазерная мина-ловушка HECU</h1>
                    <p>Лазерная мина-ловушка — специальная мина-ловушка с лазером-датчиком, при пересечении которого происходит взрыв.</p></div>
                )
            }
        }