import React, {Component} from 'react';
import "./style.css"

export default class Mp5 extends Component{
    render(){
        return(
                <div className='h'><h1>MP5</h1>
                <p>HK MP5 — пистолет-пулемёт, появляющийся в Half-Life и её дополнениях. Чаще всего встречается 
                    у солдат HECU и чёрных оперативников. Имеет высокую скорострельность, объёмный магазин и
                     подствольный гранатомёт, что делает это оружие эффективным и универсальным.</p>
                     <p>MP5 — обычный пистолет-пулемёт, снабжённый подствольным 40 мм гранатомётом M203. Имеет выдвижной приклад (в игре не используется), обладает неплохой точностью стрельбы и высокой скорострельностью. Большой объём магазина позволяет долго не перезаряжаться, что полезно в некоторых ситуациях. Подствольный гранатомёт также полезен в некоторых ситуациях, например при зачистке участка со множеством противников, или ликвидации противника в укрытиях.

Впервые данное оружие можно найти в главе «Мы встретили неприятеля» у трупа солдата HECU. После этого оно будет попадаться почти на протяжении всей игры</p> </div>
                )
            }
        }