import React, {Component} from 'react';
import "./style.css"

export default class Rpg extends Component{
    render(){
        return(
                <div className='h'><h1>Ручной противотанковый гранатомёт</h1>
                <p>Ручной противотанковый гранатомёт (РПГ), или GAM14B — гранатомёт с лазерным прицелом, используемый для эффективного 
                    уничтожения воздушных и наземных целей.</p>
                    <p>РПГ стреляет мощными ракетами, которые можно нацеливать на движущуюся цель с помощью встроенного лазерного прицела, или же без него, используя так называемый «немой метод», который отлично подходит для уничтожения неподвижных целей, например, танка M1A1 «Абрамс».
Несмотря на то, что РПГ можно найти на захваченных HECU территориях, это оружие нельзя увидеть в руках самих солдат (за исключением Адриана Шепарда). Тем не менее, ракеты можно найти на всех территориях, контролируемых военными, например, на поверхности Чёрной Мезы в главе «Поверхностное натяжение».
Оружие впервые появляется на скале в главе «Поверхностное натяжение», где вскоре появляется AH-64 «Апач», позволяющий Гордону проверить свои стрелковые навыки.</p> </div>
                )
            }
        }