import React, {Component} from 'react';
import "./style.css"

export default class Snark extends Component{
    render(){
        return(
                <div className='h'><h1>Снарк</h1>
                <p>Снарк — обитатель Зена, маленькое насекомое, которое присутствует в Half-Life и её аддонах и является ручным оружием игрока.</p>
                <p>Похожие на красных жуков с зелёным глазом, снарки обладают необычной для своих размеров особенностью — высокой агрессией. 
                   В игре снарки являются особым оружием — игрок выпускает снарков из рук во врагов, и те в свою очередь играют роль «живых
                    гранат», имея способность закусать врагов до смерти. При нападении на врагов снарки издают очень звонкий визг. Выпущенный 
                    снарк исследует территорию в поиске возможного противника. Если же противник извне не найден, то снарк может вернуться и 
                    напасть на запустившего его игрока.</p> </div>
                )
            }
        }