import React, {Component} from 'react';
import "./style.css"

export default class Spas12 extends Component{
    render(){
        return(
                <div className='h'> <h1>SPAS-12</h1>
                <p>HECU SPAS-12 или просто SPAS-12 — мощный помповый дробовик, стреляющий картечью.
                    В первую очередь используется HECU; его также используют все игровые персонажи 
                    подсерии Half-Life.</p>
                    <p>SPAS-12 имеет два режима огня. В первом режиме выбрасывается четыре дробины со 
                       средним разбросом, используется один патрон и перерыв между выстрелами небольшой.
                        Вторичный огонь выбрасывает восемь дробин (два патрона), разброс становится больше,
                         а также более длительную задержку перед следующим выстрелом.</p></div>
                )
            }
        }