import React, {Component} from 'react';
import "./style.css"

export default class Tauweapon extends Component{
    render(){
        return(
                <div className='h'> <h1>Тау-пушка</h1>
                <p>Тау-пушка, также известная как пушка Гаусса — оружие, разработанное и созданное в комплексе Чёрная Меза.</p>
                <p>Оружие работает по принципу ускорения частиц и обладает свойством накапливать урон в зависимости от того, как долго будет 
                    зажат спусковой крючок. При накоплении максимального заряда, выстрел будет обладать отталкивающим свойством. Идеальное
                     оружие для средней и дальней дистанций, однако делит боезапас с глюонной пушкой, да и шанс пополнить его представляться
                      будет очень редко. Работает от обеднённого урана, который попадается игроку в виде коробок с пометкой «U-235» и 
                      естественным знаком радиации. Гордон Фримен и Адриан Шепард могут носить их, поскольку одеты в защитные костюмы.</p></div>
                )
            }
        }