import React, {Component} from 'react';
import "./style.css"

export default class Arbalet2 extends Component{
    render(){
        return(
                <div className='h'>
 <h1>Арбалет</h1>
                                                                                <p>Арбалет Сопротивления — снайперское оружие в Half-Life 2 и эпизодах.</p>
                                                                                <p>Арбалет крайне эффективен против отдаленных целей и способен мгновенно убить
                                                                                     ничего не подозревающего противника. Однако использовать его в ближнем бою
                                                                                      или против быстро движущихся целей затруднительно, поскольку оружие требует
                                                                                       долгой перезарядки и имеет низкую скорострельность. Арбалет — единственное 
                                                                                       оружие в игре, на котором есть оптический прицел (активируется кнопкой вторичного огня).

Это оружие сильно отличается от арбалета, показанного в Half-Life.<br/>

Во-первых, хорошо видно. что оно собрано кое-как, из бывшего под рукой мусора - например, обрезков труб.<br/>
Во-вторых, арбалет Сопротивления снаряжается не арбалетными болтами,а кусками арматуры длиной 12 дюймов (30 см).<br/>
В-третьих, у данной модели нет магазина. Снаряды вкладываются в арбалет по одному, вручную.<br/>
Наконец, этому самодельному арбалету требуется батарея, которая раскаляет арматуру докрасна.<br/>
Боеприпасы к арбалету встречаются очень редко, сами арбалеты — ещё реже. Альянс не использует подобное оружие, поэтому его можно найти только на трупах
 повстанцев или в тайниках. Попадание в жертву стрелы арбалета смертельно, так как раскалённые куски металла пробивают живые ткани насквозь, буквально
  пригвождая убитого к месту.

Редкость такого оружия, видимо, обусловлена трудностями приобретения материалов для него, в частности, оптических прицелов. Вероятно, они снимаются со 
снайперских винтовок Альянса или какого-то довоенного оружия.</p>
                </div>
                )
            }
        }