import React, {Component} from 'react';
import "./style.css"

export default class Av2 extends Component{
    render(){
        return(
                <div className='h'>
                      <h1>Импульсная винтовка Патруля</h1>
                                                                          <p>Импульсная винтовка Патруля (англ. Overwatch Standard Issue Pulse Rifle, или кратко OSIPR; другое обозначение — AR2)
                                                                             — импульсная штурмовая винтовка, производимая Альянсом и использующая также тёмную энергию.</p>
                                                                             <p>OSIPR по существу является переделанной Альянсом штурмовой винтовкой, обычно выдающейся солдатам Патруля и
                                                                                 элитным солдатам Патруля. В магазине содержатся 3 тридцатизарядные ячейки, перезаряжающиеся автоматическим 
                                                                                 механизмом, встроенным в оружие. В винтовку также встроено подствольное дополнение, стреляющее энергетическими
                                                                                  шарами; шары способны аннигилировать почти всё, чего касаются. На корпусе винтовки можно увидеть буквенно-цифровой
                                                                                   код "V952", также размещаемый на других устройствах Альянса.

Впервые игрок получает это оружие в конце шестой главы Half-Life 2 "Мы не ходим в Рейвенхольм...", подняв его с убитого солдата, дравшегося с зомби. Еще раньше его можно получить в той же главе,
 в амбаре слева выхода из Ревенхольма. В Episode One оно может быть найдено в одном из помещений управления Альянса во главе "Побег из города". В Episode Two впервые винтовка встречается во главе
  "Мостостроитель Фримен" в дверном проёме возле небольшого форпоста повстанцев. Хотя OSIPR распространена среди сил Патруля, энергетическими шарами снабжены только Элитные солдаты.

Винтовки часто захватывают повстанцы. Примечательно, что боец Сопротивления в Белой Роще говорит своим товарищам, что вторичная атака может быть полезна против охотников, что ведёт к спору об AR3
 (разговор об AR3 можно услышать сразу после приезда на базу, после спринта Пса). Хотя смонтированный вариант стационарного пулемёта Альянса это другой вариант импульсного оружия, скорее всего, 
 он называется AR1, а не AR3 (об этом можно узнать из игровых файлов и кодов). AR3, по словам того же повстанца, "не существует в природе".

Игрок впервые получает энергетические шары во главе "Мы не ходим в Рейвенхольм", из ящика у входа на базу повстанцев. В Episode One эти шары можно получать, убивая Элитных солдат в госпитале,
 или из ящика с боеприпасами в компьютерном зале с Элитным солдатом. В Episode Two энергетический шар можно получить из ящика с боеприпасами в тайнике перед Белой Рощей или в комнате с зарядным устройством.</p>
                </div>
                )
            }
        }