import React, {Component} from 'react';
import "./style.css"

export default class Colt extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Colt Python</h1>
                                                   <p>Colt Python (или Магнум .357) — наиболее мощное и точное (по сравнению с
                                                     пистолетами Glock 17 и USP Match) оружие, представленное в большинстве игр
                                                      серии Half-Life. Основан на реально существующем одноимённом револьвере.</p>
                                                     <p>Шестизарядный револьвер двойного действия калибра .357 Magnum. «Питон» очень 
                                                        мощен, однако долго перезаряжается и имеет большую отдачу. Также может
                                                         использоваться при стрельбе на дальние дистанции из-за своей точности.</p> 
                </div>
                )
            }
        }