import React, {Component} from 'react';
import "./style.css"

export default class Crowbar extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Монтировка</h1>
                <p>Монтировка, или лом (англ. Crowbar) — единственное оружие ближнего боя в 
                    серии Half-Life и в Half-Life 2. Это первое оружие, приобретаемое в Half-Life.
                     Является символом вселенной Half-Life наравне с Гордоном Фрименом.</p>
                     <p>Монтировка — это универсальный ударно-рычажный инструмент, используемый в основном для разбития твёрдых материалов.
                         В играх служит как эффективное оружием ближнего боя.

Монтировка в Half-Life и её дополнениях представлена как вытянутый S-образный стальной стержень с двумя плоскими заострёнными краями и
 одним более изогнутым верхним концом. В Half-Life 2 стержень лома слегка более изогнут на нижнем конце и он больше похож на гвоздодёр.
  Версия лома из Half-Life: Alyx ничем не отличается от версии из второй части, за исключением более высокой детализации.

В Half-Life 2 и эпизодах её может заменить манипулятор энергетического поля нулевого уровня, так как он позволяет безопаснее и быстрее
 расправляться со врагами, если рядом с игроком присутствуют тяжёлые объекты. Тем не менее, монтировка всё же более эффективна для 
 уничтожения препятствий и хедкрабов, так как гравитационная пушка убивает любых хедкрабов с трёх выстрелов, а монтировка — с одного удара.</p>
                </div>
                )
            }
        }