import React, {Component} from 'react';
import "./style.css"

export default class Grenade extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Осколочная граната</h1>
                                                                                    <p>Осколочная граната MK3A2 — оружие солдат Альянса, появляющееся в Half-Life 2 и её эпизодах.</p>
                                                                                    <p>MK3A2 — это стандартная граната, взрывающаяся через несколько секунд после броска. Данная 
                                                                                        граната оснащена красным мигающим световым сигналом и издающим писк таймером. Это полезно 
                                                                                        для игрока, поскольку подсказывает, что рядом опасность. Такие гранаты носят солдаты Патруля 
                                                                                        Альянса и элитные солдаты. После смерти солдата можно подобрать гранаты, которые он не успел бросить.

Гранату можно бросить в сторону противника двумя способами — метнуть с размаху или подкатить по земле (соответственно кнопки основного и вторичного огня). MK3A2 плохо отскакивает от 
поверхности, однако из-за своей цилиндрической формы может укатиться довольно далеко. Это необходимо учитывать при броске. Игрок может подобрать уже активированную гранату руками или гравипушкой,
 чтобы бросить её обратно в противника.</p>
                </div>
                )
            }
        }