import React, {Component} from 'react';
import "./style.css"

export default class Gravi extends Component{
    render(){
        return(
                <div className='h'>
<h1>Гравитационная пушка</h1>
                                                         <p>Гравитационная пушка (по-научному — Манипулятор энергетического поля нулевого 
                                                            уровня или сокращённо грави-пушка) — энергетическое оружие, первоначально
                                                             разработанное для работы с опасными материалами и, как заявила Аликс, они 
                                                             используют её для поднятия тяжёлых грузов. Устройство питается от кристалла
                                                              Зена. Именно он позволяет устройству поднимать и притягивать объекты. 
                                                              Предоставленная Гордону Аликс вскоре после прибытия в Восточную Чёрную Мезу, 
                                                              грави-пушка почти сразу становится незаменимым инструментом в арсенале Гордона
                                                               и считается одним из его символов.</p>
                                                               <p>Гравитационная пушка имеет два основных режима. Основной огонь освобождает 
                                                                взрывную энергию, которая отталкивает предметы с огромной силой. Это полезно 
                                                                для очистки барьеров и перемещения тяжёлых предметов. Вторичный огонь притягивает 
                                                                близкие предметы и держит их на весу. Эти объекты могут быть либо опущены на землю повторным
                                                                 нажатием кнопки вторичного огня, либо могут быть оттолкнуты первичным огнём. Вторичным огнём 
                                                                 можно подбирать только лёгкие предметы, в основном те, которые может нести сам Гордон, однако
                                                                 основной огонь влияет на гораздо более тяжёлые предметы, которые не может захватить вторичный 
                                                                 огонь. Пушка не влияет на органические вещества, хотя есть несколько исключений.</p>
                </div>
                )
            }
        }