import React, {Component} from 'react';
import "./style.css"

export default class Kater extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Воздушный катер</h1>
                                                                                                            <p>Воздушный катер — судно, созданное Сопротивлением из лома и запасных деталей. Быстрый, манёвренный 
                                                                                                                и способный перемещаться как на воде, так и на суше. Идеально подходит для перемещения по Каналам 
                                                                                                                Сити 17. Вначале транспорт без вооружения, затем к нему устанавливают импульсную пушку, чтобы 
                                                                                                                обороняться против вертолёта-охотника.</p>
                </div>
                )
            }
        }