import React, {Component} from 'react';
import "./style.css"

export default class Machinegun extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Стационарный пулемёт</h1>
                                                                                                          <p>Стационарный пулемёт Альянса — стационарная версия импульсной винтовки Патруля. Как правило, 
                                                                                                            устанавливается на специальных щитках, защищающих нижнюю часть тела стрелка. Некоторые пулемёты
                                                                                                             оборудованы тактическими фонариками, устанавливаемыми непосредственно на пулемёте для ведения 
                                                                                                             стрельбы в условиях плохого освещения (например, в неосвещённых помещениях Нова Проспект). 
                                                                                                             Пулемёт может использоваться как войсками Альянса (ГО и Патруль), так и игроком. Также захваченные 
                                                                                                             пулемёты используются Сопротивлением.

Пулемёт может вести полностью автоматический огонь на протяжении бесконечного количества времени. Он не перегревается и не требует боеприпасов, единственной его слабостью является достаточно большой разброс
 пуль, не позволяющий вести точный огонь на дальние дистанции.</p>
                </div>
                )
            }
        }