import React, {Component} from 'react';
import "./style.css"

export default class Mp7 extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>MP7</h1>
                                        <p>MP7 (нем. Maschinenpistole modell 7), также известный как SMG1 — компактное автоматическое 
                                            огнестрельное оружие, используемое как Альянсом, так и Сопротивлением.</p>
                                            <p>MP7 напоминает версию из реальной жизни, за некоторыми исключениями: спереди находятся
                                                 два ствола и установлен коллиматорный прицел. Первичный огонь оружия обладает высокой 
                                                 скорострельностью, плохой точностью и небольшим уроном, а вторичный огонь запускает
                                                  подствольную гранату, которая, предположительно, вылетает из нижнего ствола. Граната 
                                                  летит по дуге и обладает приличным радиусом взрыва, позволяя легко поражать противников
                                                   за укрытиями. MP7 составляет основную часть вооружения солдат Патруля Альянса, Гражданской 
                                                   обороны и членов Сопротивления.</p>
                </div>
                )
            }
        }