import React, {Component} from 'react';
import "./style.css"

export default class Pistol extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>9-мм пистолет</h1>
                                <p>USP Match, также известный как 9-мм пистолет, — полуавтоматический пистолет, а также первое
                                     огнестрельное оружие, которое Гордон Фримен получает в Half-Life 2.</p>
                                     <p>USP Match является стандартным пистолетом Альянса, и чаще всего берут на вооружение офицеры Гражданской обороны.
USP Match — точное и надёжное оружие с большим магазином. Одной из его особенностей является то, что он имеет специальную насадку, которая уменьшает подбрасывание
 ствола вверх при стрельбе за счёт своего веса.
Впервые USP Match можно найти в начале Half-Life 2 главы «Через каналы», после нападения патруля на горожан вблизи туннелей каналов Сити 17. Однако,
 оружие возможно получить раньше, убив офицеров Гражданской обороны в конце главы «Великий день», во время погони на железной дороге. В Episode One
  оружие впервые можно подобрать в подземельях Сити 17. В Episode Two — на территории Шахты Победы.</p>
                </div>
                )
            }
        }