import React, {Component} from 'react';
import "./style.css"

export default class Rpg2 extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Ручной противотанковый гранатомёт</h1>
                                                                                <p>Ручной противотанковый гранатомёт (РПГ) — мощное оружие, которое использует Сопротивление против сил Альянса.</p>
                                                                                <p>Гранатомёт используется Сопротивлением против штурмовиков, транспортников, вертолётов, страйдеров, и иногда — бронетранспортёров.

РПГ — мощное оружие, снабжённое лазерным прицелом, позволяющим точно направлять ракеты в полёте. При помощи лазера можно перенаправить выпущенную мимо цели ракету или заставить её маневрировать, 
чтобы избежать вражеского огня.

Заряд ракеты вдвое мощнее, чем у ручной гранаты.</p>
                </div>
                )
            }
        }