import React, {Component} from 'react';
import "./style.css"

export default class Snhd extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Снаряд с хедкрабами</h1>
                                                                                                  <p>Снаряды с хедкрабами, также известные как ракеты с паразитами или, кратко, крабснаряды 
                                                                                                    — форма биологического оружия, используемого Альянсом для подавления очагов Сопротивления. 
                                                                                                    Снаряды запускаются на дальние дистанции и приземляются на контролируемые противником территории, 
                                                                                                    высвобождая несколько хедкрабов.</p>
                </div>
                )
            }
        }