import React, {Component} from 'react';
import "./style.css"

export default class Spas extends Component{
    render(){
        return(
                <div className='h'>
                     <h1>SPAS-12</h1>
                                                                 <p>Franchi SPAS-12 — итальянский помповый дробовик, в Half-Life 2 — мощное оружие ближнего боя, 
                                                                    используемое Альянсом и бойцами Сопротивления.</p>
                                                                    <p>Стреляет дробью, в виду этого, обладает самой низкой точностью, перезарядка длительная,
                                                                         скорострельность малая, объём магазина - 6 патронов, однако в ближнем бою с ним может 
                                                                         сравнится разве что Магнум. Хорош против разнообразной "Зеновской" живности вроде зомби 
                                                                         и муравьиных львов. Альтернативная атака выстреливает двумя патронами, позволяя убить с
                                                                          одного выстрела вплотную практически любого противника.</p>
                </div>
                )
            }
        }