import React, {Component} from 'react';
import "./style.css"

export default class Turel extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Наземная турель Альянса</h1> 
                                                                              <p>Наземная турель Альянса — автоматическое импульсное оружие Альянса, использующееся 
                                                                                для защиты некоторых областей Нексуса Патруля.</p>     
                                                                                <p>Эти турели встречается только на территории Нексуса Патруля, где они используются для 
                                                                                    защиты важных зон и консолей управления. В Нексусе Патруля они также защищают комнаты
                                                                                     с генераторами.

Турели в «спящем» состоянии находятся под полом. Активируются они тогда, когда кто-либо пересекает лучи, установленные рядом с ними. После этого турель выдвигается и начинает 
стрелять в противника. Обзор турели ограничивается лишь областью из лазеров, которые служат детекторами для турелей.

Несмотря на ограниченную область стрельбы, местоположение турели зачастую компенсирует этот минус, что усложняет борьбу с ними. Турель можно уничтожить взрывчаткой,
 в частности, гранатой.</p>
                </div>
                )
            }
        }