import React, {Component} from 'react';
import "./style.css"

export default class Yellowcar extends Component{
    render(){
        return(
                <div className='h'>
                    <h1>Скоростной автомобиль</h1>
                                                                                                                    <p>Скоростной автомобиль (также известен, как мусор (в файлах) или драндулет (название энтити)) 
                                                                                                                        — вид наземного транспорта, впервые появившийся в Half-Life 2: Episode Two.</p>
                                                                                                                        <p>Скоростной автомобиль — бесценный транспорт в арсенале Сопротивления. Он используется для
                                                                                                                             перевозки членов Сопротивления. В отличие от багги, этот автомобиль имеет второе сидение,
                                                                                                                              предназначающееся для пассажира. Также он быстрее и намного управляемее багги. Также при 
                                                                                                                              езде на багги шанс перевернуться намного выше, чем на этом автомобиле. Минусом машины 
                                                                                                                              являются заносы на резких поворотах. Дизайн автомобиля вдохновлён Dodge Charger B-body 1969 года.

Скоростной автомобиль очень удобен для обхода зомби, охотников и других противников, бой с которыми нежелателен, а также для прорыва через баррикады. Этот автомобиль также играет большую роль в сюжете. Его добыче 
посвящена целая глава, а поиск тайников и перенос устройств Магнуссона облегчается после того, как ИТГС, один из повстанцев, модифицирует его.</p>
                </div>
                )
            }
        }